<?php

// Heading
$_['heading_title'] = '<img width="36" height="36" src="view/image/neoseo.png" style="float: left;"><h1>NeoSeo Склады</h1>';
$_['heading_title_raw'] = 'NeoSeo Склады';

// Text
$_['text_neoseo_warehouse'] = 'NeoSeo Склады';
$_['text_success'] = 'Склады успешно обновлены!';
$_['text_list'] = 'Список складов';
$_['text_add'] = 'Добавить склад';
$_['text_edit'] = 'Изменить склад';
$_['text_default'] = 'Основной магазин';

// Column
$_['column_name'] = 'Название склада';
$_['column_1c_id'] = 'Код склада';
$_['column_action'] = 'Действие';

// Entry
$_['entry_name'] = 'Название склада:';
$_['entry_1c_id'] = 'Код склада:';
$_['entry_code_1c'] = 'Код 1с:';
$_['entry_store'] = 'Магазины:';
$_['entry_param1'] = 'Param 1:';
$_['entry_param2'] = 'Param 2:';
$_['entry_param3'] = 'Param 3:';
$_['entry_param4'] = 'Param 4:';
$_['entry_param5'] = 'Param 5:';
$_['entry_sort_order'] = 'Порядок сортировки';

$_['entry_update_only_main_product_category'] = 'Обновлять только главную категорию товара';
$_['entry_update_only_main_product_category_desc'] = 'Привязка товара к категориям в блоке "Отображать в категориях" не будет сбрасываться. Для правильной работы данной опции должна быть отключена опция "Заполнять родительские категории"';

$_['entry_export_discount_as_element'] = 'Экспортировать скидку как отдельный атрибут';
$_['entry_export_discount_as_element_desc'] = 'Экспортировать скидки как атрибут документа &lt;Скидки&gt;';

// Error
$_['error_permission'] = 'У Вас нет прав для изменения складов!';
$_['error_name'] = 'Название склада обязательно для заполнения!';
$_['error_required'] = 'Обязательно для заполнения!';
$_['error_product'] = 'Этот склад не может быть удален, так как назначен %s товарам!';



/* =============== LECENSE INFO ================= */
$_['text_module_version'] = '298';
$_['error_license_missing'] = '<h3 style="color:red">Отсутствует файл с ключом!</h3>
<p>Для получения файла с ключом свяжитесь с NeoSeo по email <a href="mailto:license@neoseo.com.ua">license@neoseo.com.ua</a>, при этом укажите:</p>
<ul>
	<li>название сайта, на котором вы купили модуль, например: https://neoseo.com.ua</li>
	<li>название модуля, который вы купили, например: NeoSeo Обмен с 1С:Предприятие</li>
	<li>ваше имя пользователя (ник-нейм) на этом сайте, например, NeoSeo</li>
	<li>номер заказа на этом сайте, например, 355446</li>
	<li>основной домен сайта для которого и будет активирован файл с ключом, например, https://neoseo.ua</li>
</ul>
<p>Полученный файл с ключом положите в корень сайта, рядом с файлом robots.txt и нажмите кнопку "Проверить еще раз".</p>
<p>По любым вопросам пишите на support@neoseo.com.ua</p>';
$_['error_ioncube_missing'] = '<h3 style="color:red">Отсутствует IonCube Loader!</h3>
<p>Чтобы пользоваться нашим модулем, вам нужно установить IonCube Loader.</p>
<p>Для установки обратитесь в ТП Вашего хостинга</p>
<p>Если у вас не получается установить IonCube Loader самостоятельно, вы можете попросить помощи у наших специалистов по адресу <a href="mailto:support@neoseo.com.ua">support@neoseo.com.ua</a></p>';
$_['module_licence'] = '<h2>Условия лицензионного соглашения на использование программного обеспечения NeoSeo</h2>
<p>Благодарим вас за покупку программных продуктов нашей веб-студии.</p>
<p>Ниже приведены юридические условия, которые распространяются на всех, кто посещает наш сайт и пользуется нашими программными продуктами или услугами. Данные условия направлены на то, чтобы защитить ваши интересы и интересы ООО “НЕОСЕО” и его аффилированных структур и лиц (далее, "мы", "NeoSeo"), которые выступают в договорах от его имени.</p>
<p><strong>1. Введение</strong></p>
<p>Настоящие Условия использования NeoSeo (“Условия использования”) наряду с дополнительными условиями, которые касаются ряда конкретных услуг или программных продуктов, разработок и представлены на веб-сайте(-ах) NeoSeo, содержат условия и положения, действие которых распространяется на каждого посетителя или пользователя (“Пользователь”, “вы” или “Покупатель”) веб-сайта NeoSeo, приложений, дополнений и компонентов, предложенных нами наряду с предоставлением услуг и веб-сайта, если не указано иное (все услуги и программное обеспечение, программные модули предложенные через веб-сайт NeoSeo или вспомогательные сервисы, веб-сервисы, др. приложения от лица NeoSeo совместно именуются – “Услуги NeoSeo” или “Услуги”).</p>
<p>Условия NeoSeo являются обязательным юридическим договором между NeoSeo и вами – поэтому просим вас внимательно ознакомиться с ними.</p>
<p>Вы можете посещать и/или использовать Услуги NeoSeo только в том случае, если полностью согласны с Условиями NeoSeo: используя какую-либо из Услуг NeoSeo и/или подписываясь на неё, вы выражаете и подтверждаете своё согласие с данными Условиями использования и иными Условиями NeoSeo, например, условия предоставления услуг программирования в разрезе типичных и нетипичных задач, которые выписаны тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далее Условия NeoSeo).</p>
<p>Если вы не можете прочитать Условия NeoSeo, не понимаете их или не согласны с ними, вы должны незамедлительно покинуть Веб-сайт NeoSeo и не пользоваться Услугами NeoSeo.</p>
<p>Используя наши Программные продукты, Сервисы и Услуги, вы подтверждаете, что ознакомились с нашей Политикой конфиденциальности, доступной к просмотру по адресу <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   (“Политика конфиденциальности”).</p>
<p>Настоящий документ является лицензионным соглашением между вами и NeoSeo.</p>
<p>Принимая это соглашение или используя программное обеспечение, вы соглашаетесь со всеми настоящими условиями.</p>
<p>Настоящее соглашение относится к программному обеспечению NeoSeo, любым шрифтам, значкам, изображениям или звуковым файлам, предоставляемым в составе программного обеспечения, а также ко всем обновлениям, дополнениям или службам NeoSeo для программного обеспечения, если в их отношении не применяются иные условия. Это также касается разработанных в NeoSeo приложений и дополнений для SEO-Магазина, которые обеспечивают расширение его функциональных возможностей.</p>
<p>К использованию вами некоторых функций приложений могут применяться дополнительные условия NeoSeo и третьих лиц. Для корректной работы некоторых приложений необходимы дополнительные соглашения с отдельными условиями и политиками конфиденциальности, например с сервисами, предоставляющими услуги смс-нотификации.</p>
<p>Программное обеспечение не продается, а предоставляется по лицензии.</p>
<p>NeoSeo сохраняет за собой все права (например, права, предусмотренные законами о защите интеллектуальной собственности), которые не предоставляются явным образом в рамках настоящего соглашения. Например, эта лицензия не предоставляет вам права:</p>
<li>отдельно использовать или виртуализировать компоненты программного обеспечения;</li>
<li>публиковать или копировать (за исключением разрешенной резервной копии) программное обеспечение, предоставлять программное обеспечение в прокат, в аренду или во временное пользование;</li>
<li>передавать программное обеспечение (за исключением случаев, предусмотренных настоящим соглашением);</li>
<li>пытаться обойти технические ограничения в программном обеспечении;</li>
<li>изучать технологию, декомпилировать или деассемблировать программное обеспечение, а также предпринимать соответствующие попытки, кроме как в той мере и в тех случаях, когда это (а) разрешено применимым правом; (б) разрешено условиями лицензии на использование компонентов с открытым исходным кодом, которые могут входить в состав этого программного обеспечения; (c) необходимо для отладки изменений каких-либо библиотек, лицензируемых по малой стандартной общественной лицензии GNU, которые входят в состав программного обеспечения и связанны с ним;</li>
<p>Вы имеете право использовать данное программное обеспечение, только если у вас имеется соответствующая лицензия и программное обеспечение было должным образом активировано с использованием подлинного ключа продукта или другим разрешенным способом.</p>
<p>В стоимость лицензии SEO-Магазина не включены услуги установки, настройки и тем более его стилизации, также как и других платных/бесплатных дополнений к нему. Данные услуги являются дополнительными, стоимость зависит от количества необходимых для реализации часов, детальнее тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>С полной версией документа можно ознакомиться здесь:<a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';

$_['mail_support'] = '
<p>Всегда рады помочь,</p>
<p>Отдел поддержки Клиентов, веб-студия NeoSeo.</p>
<p>Напоминаем, веб-студия NeoSeo предлагает информационную поддержку бесплатно на форуме <a href="https://opencartmasters.com/">OpenCartMasters.com</a> 
(обычно ответы предоставляются в течении суток на протяжении рабочего дня).</p>
<p>
Если у Вас срочный вопрос и его нужно решить уже, пожалуйста, заказывайте платную поддержку, которая предоставляется в тот же день с использованием Skype и TeamViewer.
</p>
<p>
По общим вопросам пишите в телеграм чат <a href="https://t.me/WebStudioNeoSeo1">https://t.me/WebStudioNeoSeo1</a>
</p>
<p>
Хорошего дня и отличного настроения :) <br>
Команда NeoSeo.</p>
';

// add_entry
$_['entry_module_key'] = "Введите ключ лицензии";
$_['entry_module_key_desc'] = 'Если у Вас проблема с лицензией обратитесь на <a href="https://opencartmasters.com/">OpenCartMasters.com</a> или в телеграм чат <a href="https://t.me/WebStudioNeoSeo1">https://t.me/WebStudioNeoSeo1</a>';
// License
$_['text_license_lifetime'] = 'Пожизненная';
$_['text_license_end_period'] = 'Лицензия просрочена';
$_['text_license_error_domain'] = 'Лицензия не для Вашего домена';
$_['text_license_error_key'] = 'Не верный ключ лицензии';
$_['text_license_missing'] = 'Отсутствует лицензия';
$_['text_valid_to'] = 'Действительна до:';
$_['text_est_time'] = 'Осталось дней:';
$_['text_mode'] = 'Уровень лицензии:';
$_['text_not_included_in_license'] = 'Данная функция не разрешена в этом типе лицензии';

$_['text_mode_0'] = 'Нет лицензии:';
$_['text_mode_1'] = 'Лайт';
$_['text_mode_2'] = 'Стандарт';
$_['text_mode_3'] = 'Про+';
$_['error_access_mode_1'] = 'Данная функция доступна начиная с версии "Лайт';
$_['error_access_mode_2'] = 'Данная функция доступна начиная с версии "Стандарт"';
$_['error_access_mode_3'] = 'Данная функция доступна начиная с версии "Про+"';

