<?php

// Heading
$_['heading_title'] = 'NeoSeo Опции товаров PRO';

// Text
$_['text_success'] = 'Опции изменены!';
$_['text_list'] = 'Список опций';
$_['text_add'] = 'Добавление опции';
$_['text_edit'] = 'Редактирование опции';
$_['text_choose'] = 'Выбор';
$_['text_select'] = 'Список';
$_['text_radio'] = 'Переключатель';
$_['text_checkbox'] = 'Флажок';
$_['text_image'] = 'Изображение';
$_['text_input'] = 'Поле ввода';
$_['text_text'] = 'Текст';
$_['text_textarea'] = 'Текстовая область';
$_['text_file'] = 'Файл';
$_['text_date'] = 'Дата';
$_['text_datetime'] = 'Дата и время';
$_['text_time'] = 'Время';
$_['text_neoseo'] = 'NeoSeo Опции товаров PRO';
$_['text_images'] = 'Блок изображений';

// Column
$_['column_name'] = 'Опция';
$_['column_sort_order'] = 'Порядок сортировки';
$_['column_status'] = 'Статус';
$_['column_action'] = 'Действие';

// Entry
$_['entry_option'] = 'Опция:';
$_['entry_status'] = 'Статус:';
$_['entry_status_image'] = 'Использовать изображение опции из карточки товара:';
$_['entry_name'] = 'Название:';
$_['entry_type'] = 'Тип:';
$_['entry_option_value'] = 'Значение:';
$_['entry_image'] = 'Изображение:';
$_['entry_sort_order'] = 'Порядок сортировки:';

// Error
$_['error_permission'] = 'У Вас нет прав для изменения опций!';
$_['error_name'] = 'Имя опции должно быть от 1 до 128 символов!';
$_['error_no_options'] = 'Требуется выбрать минимум 1 опцию!';
$_['error_duplicate'] = 'Внимание форма не должна иметь дублирующихся опций!';
$_['error_product'] = 'Выбранные опции не могут быть удалены, поскольку они примененяются к %s товарам! <br> %s';
$_['error_option_product'] = '<a href="%s" target="_blank">%s</a>';
$_['error_and_more_products'] = 'И ещё %s товарам...';



/* =============== LECENSE INFO ================= */
$_['text_module_version'] = '26.3';
$_['error_license_missing'] = '<h3 style = "color: red"> Відсутній файл з ключем! </h3>
<p> Для отримання файлу з ключем зв`яжіться з NeoSeo по email <a href="mailto:license@neoseo.com.ua"> license@neoseo.com.ua </a>, при цьому вкажіть: </p>
<ul>
	<li> назву сайту, на якому ви купили модуль, наприклад, https://neoseo.com.ua </li>
	<li> назву модуля, який ви купили, наприклад: NeoSeo Обмін з 1С:Підприємство </li>
	<li> ваше ім`я користувача (нік-нейм) на цьому сайті, наприклад, NeoSeo </li>
	<li> номер замовлення на цьому сайті, наприклад, 355446 </li>
	<li> основний домен сайту для якого буде активований файл з ключем, наприклад, https://neoseo.ua </li>
</ul>
<p> Отриманий файл з ключем покладіть у корінь сайту, тобто поруч з файлом robots.txt і натисніть кнопку "Перевірити ще раз".</p>';
$_['error_ioncube_missing'] = '<h3 style="color: red">Відсутній IonCube Loader!</h3>
<p>Щоб користуватися нашим модулем, вам потрібно встановити IonCube Loader.</p>
<p>Для установки зверніться до ТП Вашого хостингу</p>
<p>Якщо ви не можете встановити IonCube Loader самостійно, у вас є можливість попросити допомоги у наших фахівців за адресою <a href="mailto:support@neoseo.com.ua"> support@neoseo.com.ua </a></p>
';
$_['module_licence'] = '<h2>Ліцензійні умови згоди на використання програмного забезпечення NeoSeo</h2>
<p>Дякуємо вам за покупку програмних продуктів нашої веб-студії.</p>
<p>Нижче наведені юридичні умови, які поширюються на всіх, хто відвідує наш сайт і користується нашими програмними продуктами або послугами. Дані умови спрямовані на те, щоб захистити ваші інтереси та інтереси ТОВ "НЕОСЕО" і його афілійованих структур і осіб (далі, "ми", "NeoSeo"), які виступають в договорах від його імені.</p>
<p><strong>1. Введення</strong></p>
<p>Ці Умови використання NeoSeo ( "Умови використання") поряд з додатковими умовами, які стосуються ряду конкретних послуг або програмних продуктів, розробок і представлені на веб-сайті (-ів) NeoSeo, містять умови і положення, дія яких поширюється на кожного відвідувача або користувача ( "Користувач", "ви" або "Покупець") веб-сайту NeoSeo, додатків, доповнень і компонентів, запропонованих нами поряд з наданням послуг і веб-сайту, якщо не вказано інше (всі послуги та програмне забезпечення, програмні модулі запропоновані через веб-сайт NeoSeo або допоміжні сервіси, веб-сервіси, ін. додатки від імені NeoSeo спільно іменуються - "Послуги NeoSeo" або "Послуги").</p>
<p>Умови NeoSeo є обов`язковим контрактом між NeoSeo і вами - тому просимо вас уважно ознайомитися з ними.</p>
<p>Ви можете відвідувати і / або використовувати Послуги NeoSeo тільки в тому випадку, якщо повністю згодні з Умовами NeoSeo: використовуючи будь-яку з Послуг NeoSeo і / або підписуючись на неї, ви висловлюєте і підтверджуєте свою згоду з даними Умовами користування та іншими Умовами NeoSeo, наприклад, умови надання послуг програмування в розрізі типових і нетипових завдань, які виписані тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далі Умови NeoSeo).</p>
<p>Якщо ви не можете прочитати Умови NeoSeo, не знаєте їх або не згодні з ними, ви повинні покинути Веб-сайт NeoSeo і не користуватися Послугами NeoSeo.</p>
<p>Використовуючи наші Програмні продукти, Сервіси і Послуги, ви підтверджуєте, що ознайомилися з нашою Політикою конфіденційності, доступною до перегляду за адресою <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   ("Політика конфіденційності").</p>
<p>Цей документ є ліцензійною угодою між вами і NeoSeo.</p>
<p>Погоджуючись на цю угоду або використовуючи програмне забезпечення, ви погоджуєтеся з усіма цими умовами.</p>
<p>Ця угода відноситься до програмного забезпечення NeoSeo, будь-яких шрифтів, піктограм, зображень або звукових файлів, що надаються у складі програмного забезпечення, а також до всіх оновлень, доповнень або служб NeoSeo для програмного забезпечення, якщо в їх відношенні не застосовуються інші умови. Це також стосується розроблених в NeoSeo додатків і доповнень для SEO-Магазину, які забезпечують розширення його функціональних можливостей.</p>
<p>До використання вами деяких функцій додатків можуть застосовуватися додаткові умови NeoSeo і третіх осіб. Для коректної роботи деяких додатків необхідні додаткові угоди з окремими умовами та політиками конфіденційності, наприклад з сервісами, які надають послуги смс-нотифікації.</p>
<p>Програмне забезпечення не продається, а надається за ліцензією.</p>
<p>NeoSeo зберігає за собою всі права (наприклад, права, передбачені законами про захист інтелектуальної власності), які не надаються явно в рамках цієї угоди. Наприклад, ця ліцензія не надає вам права:</p>
<li><span></span><span></span>окремо використовувати або віртуалізувати компоненти програмного забезпечення;</li>
<li>публікувати або копіювати (за винятком дозволеної резервної копії) програмне забезпечення, надавати програмне забезпечення у прокат, в оренду або в тимчасове користування;</li>
<li>передавати програмне забезпечення (за винятком випадків, передбачених цією угодою);</li>
<li>намагатися обійти технічні обмеження програмного продукту;</li>
<li>вивчати технологію, декомпілювати або деасемблувати програмне забезпечення, а також вживати відповідні спроби, крім тих що в мірі та у випадках, коли це (а) передбачено відповідним правом; (б) дозволено умовами ліцензії на використання компонентів з відкритим вихідним кодом, які можуть входити до складу цього програмного забезпечення; (c) необхідно для налагодження змін будь-яких бібліотек, що ліцензуються по малій стандартній громадській ліцензії GNU, які входять до складу програмного забезпечення та пов`язані з ним;</li>
<p>Ви маєте право використовувати дане програмне забезпечення, тільки якщо у вас є відповідна ліцензія і програмне забезпечення було належним чином активовано з використанням справжнього ключа продукту або в інший дозволений спосіб.</p>
<p>У вартість ліцензії SEO-Магазину не включені послуги установки, настройки і тим більше його стилізації, також як і інші платні / безкоштовні доповнення до нього. Дані послуги є додатковими, вартість залежить від кількості необхідних для реалізації годин, детальніше тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>З повною версією документа можна ознайомитися тут:</p>
<p><a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';
$_['mail_support'] = '<P> Завжди раді допомогти, </ p>
<P> Відділ підтримки Клієнтів, веб-студія NeoSeo. </ P>
<P> Нагадуємо, веб-студія NeoSeo пропонує інформаційну підтримку безкоштовно на форумі <a href="https://opencartmasters.com/"> OpenCartMasters.com </a>
(Зазвичай відповіді надаються протягом доби протягом робочого дня). </ P>
<P>
Якщо у Вас термінове питання і його треба вирішити вже, будь ласка, замовляйте платну підтримку, яка надається в той же день з використанням Skype і TeamViewer.
</ P>
<P>
Із загальних питань пишіть в телеграм чат <a href="https://t.me/WebStudioNeoSeo1"> https://t.me/WebStudioNeoSeo1 </a>
</ P>
<P>
Гарного дня і відмінного настрою :) <br>
Команда NeoSeo. </ P>
';

// add_entry
$_['entry_module_key'] = "Введіть ключ ліцензії";
$_['entry_module_key_desc'] = 'Якщо у вас проблема з ліцензійним зверненням на <a href="https://opencartmasters.com/"> OpenCartMasters.com </a> або в телеграмі чату <a href="https://t.me/WebStudioNeoSeo1"> https://t.me/WebStudioNeoSeo1 </a>';

// License
$_['text_license_lifetime'] = 'Довічна';
$_['text_license_end_period'] = 'Ліцензія прострочена';
$_['text_license_error_domain'] = 'Ліцензія не для Вашого домену';
$_['text_license_error_key'] = 'Не вірний ключ ліцензії';
$_['text_license_missing'] = 'відсутнє ліцензія';
$_['text_valid_to'] = 'Дійсне до:';
$_['text_est_time'] = 'Залишилося днів:';
$_['text_mode'] = 'Рівень ліцензії:';
$_['text_not_included_in_license'] = 'Ця функція не дозволена в цьому типі ліцензії';

$_['text_mode_0'] = 'Немає ліцензії:';
$_['text_mode_1'] = 'Лайт';
$_['text_mode_2'] = 'Стандарт';
$_['text_mode_3'] = 'Про +';
$_['error_access_mode_1'] = 'Ця функція доступна починаючи з версії "Лайт"';
$_['error_access_mode_2'] = 'Ця функція доступна починаючи з версії "Стандарт"';
$_['error_access_mode_3'] = 'Ця функція доступна починаючи з версії "Про +"';

