<?php
// Text
$_['text_title']                = 'Square';
$_['text_canceled']             = 'Ви успішно скасували платіж. Ми надіслали вам підтвердження електронною поштою.';
$_['text_confirm_cancel']       = 'Ви впевнені, що хочете скасувати регулярний платіж?';
$_['text_order_history_cancel'] = 'Ви скасували профіль регулярних платежів. Стягнення коштів з вашої картки здійснюватись не буде.';

// Button
$_['button_cancel']             = 'Скасувати регулярний платіж';

// Error
$_['error_not_cancelled']       = 'Помилка: %s';
$_['error_not_found']           = 'Неможливо скасувати профіль регулярних платежів';