<?php
// Headers
$_['heading_title']				= 'HDP Редактор групп акций';
$_['settings_text']				= 'Настройка';
$_['specials_editor_text']		= 'Редакторы акций';
$_['add_name']					= 'Создание группы акций';
$_['heading_action_text']		= 'Редактор групп акций';
$_['discount_specials_text']	= 'Массовый редактор акций';
$_['specials_discount_text']    = 'Редактор групп акций';
// Name
$_['entry_title']					= 'Заголовок';
$_['entry_title_titles']			= 'Наименование скидки';
$_['entry_description']				= 'Комментарий';
$_['entry_description_titles']		= 'Комментарий | описание к акции';
$_['entry_shops']					= 'Магазины';
$_['entry_shops_titles']			= 'Редактор магазинов<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_geo']						= 'Гео-зоны';
$_['entry_geo_titles']				= 'Редактор гео-зон<br>ALL = все магазины<br>EDIT - редактировать';
//button
$_['button_edit_shops_list']		= 'Редактировать список магазинов<br>активно только в режиме EDIT';
$_['button_edit_geo_list']			= 'Редактировать список гео-зон<br>активно только в режиме EDIT';
$_['button_product_group_list']		= 'Редактировать группу товаров<br>активно только в режиме EDIT';
$_['button_clone_title']			= 'Клонирование';
$_['button_clone_titles']			= 'Клонировать';
// Editors
$_['entry_users_groups']				= 'Группа покупателей';
$_['entry_users_groups_titles']			= 'Группа покупателей<br>возможен мульти-выбор';
$_['entry_date']						= 'Дата';
$_['entry_date_titles']					= 'Дата начала и окончания<br>Если пусто = всегда';
$_['entry_date_start']					= 'начала';
$_['entry_date_end']					= 'окончания';
//week
$_['discount_week']				= 'Дни';
$_['discount_week_title']		= 'Дни недели запуска акций';
$_['Monday']	= 'Понедельник';$_['Tuesday']	= 'Вторник';$_['Wednesday']	= 'Среда';$_['Thursday']	= 'Четверг';
$_['Friday']	= 'Пятница';$_['Saturday']	= 'Суббота';$_['Sunday']	= 'Воскресенье';
//week
//time
$_['discount_time_title']		= 'Время запуска акций<br>Серверное время';
$_['time_a']	= '00:00 - 01:00'; $_['time_b']	= '01:00 - 02:00'; $_['time_c']	= '02:00 - 03:00'; $_['time_d']	= '03:00 - 04:00';
$_['time_e']	= '04:00 - 05:00'; $_['time_f']	= '05:00 - 06:00'; $_['time_g']	= '06:00 - 07:00'; $_['time_h']	= '07:00 - 08:00';
$_['time_i']	= '08:00 - 09:00'; $_['time_j']	= '09:00 - 10:00'; $_['time_k']	= '10:00 - 11:00'; $_['time_l']	= '11:00 - 12:00';
$_['time_m']	= '12:00 - 13:00'; $_['time_n']	= '13:00 - 14:00'; $_['time_o']	= '14:00 - 15:00'; $_['time_p']	= '15:00 - 16:00';
$_['time_q']	= '16:00 - 17:00'; $_['time_r']	= '17:00 - 18:00'; $_['time_s']	= '18:00 - 19:00'; $_['time_t']	= '19:00 - 20:00';
$_['time_u']	= '20:00 - 21:00'; $_['time_v']	= '21:00 - 22:00'; $_['time_w']	= '22:00 - 23:00'; $_['time_x']	= '23:00 - 24:00';
//time
//period
$_['discount_period_title']		= 'Период запуска акций в неделях<br>каждые 2, каждые 3 и т.д.';
$_['discount_period_titles']	= 'Каждые';
$_['2_week']							= '2 - недели';
$_['3_week']							= '3 - недели';
$_['4_week']							= '4 - недели';
$_['5_week']							= '5 - недель';
$_['6_week']							= '6 - недель';
$_['7_week']							= '7 - недель';
$_['8_week']							= '8 - недель';
$_['9_week']							= '9 - недель';
$_['10_week']						= '10 - недель';
$_['11_week']						= '11 - недель';
//period
//
$_['entry_product_groups']				= 'Товары';
$_['entry_product_groups_titles']		= 'Редактор товаров<br>ALL = все товары<br>EDIT = редактировать';
$_['entry_qty_title']					= 'Приоритет акции';
$_['entry_priority_titles']				= 'Приоритет';
$_['entry_cost_title']					= 'Исходная цена<br>закупочная - COST<br>основная - PRICE';
$_['entry_round_name']					= 'Округлять';
$_['entry_round_title']					= 'Округление итоговой цены';
//protected
$_['protect_cost']			= 'COST';
$_['protect_price']			= 'PRICE';
$_['protect_current']		= 'CURRENT';
$_['round_no']				= 'Нет';
$_['round_tenth']			= 'до десятых';
$_['round_hundredths']		= 'до сотых';
$_['round_whole_number']	= 'до целого';
$_['round_five']			= 'до 5';
$_['round_nine']			= 'до 9';
$_['round_ten']				= 'до 10';
$_['round_ninety_nine']		= 'до 99';
//
$_['entry_groups_clients']				= 'Группа';
$_['entry_groups_clients_titles']		= 'Группа покупателей<br>';
$_['entry_product_group']				= 'Товары';
$_['entry_product_group_titles']		= 'Редактор товаров<br>ALL = все товары<br>EDIT - редактировать';
$_['entry_discount_formula']			= 'Формула';
$_['entry_discount_formula_titles']		= 'Формула получения<br>итоговой цены акций';
$_['discount_products_start']			= 'Запуск и приостановка акций';
$_['discount_products_start_title']		= 'Запустить';
$_['discount_products_stop_title']		= 'Завершить';
$_['column_delete']						= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']				= 'Добавить<br>Удалить';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками "Хелпера" в правом верхнем углу каждого пункта
если, что-то не понятно.</span>';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Products discount
$_['help_name_specials']		= 'Редактор пользовательской скидки | наценки';

$_['help_first_specials']		= '<b>СТАРТ</b>';
$_['help_second_products']		= 'Введите заголовок / наименование данной группы акций от количества товаров
и его краткое описание / комментарий в соответсвующие для этого поля.
<br>Далее: Сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>После применения изменений, можете переходить на редактирование добавленной акций, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования со страницы добавления акций.';
// Info Modal Products discount
$_['info_first_specials']	= '<b>ОПИСАНИЕ</b>';
$_['info_second_specials']	= 'Массовый редактор акций товаров (те самые акции, что расположены в редакторе карточки товара админ части).
<br>Позволяет массово создавать акции для товаров на ваш выбор с возможностью их фильтрации по различным параметрам с памятью, тем самым подвязывая
определённую группу товаров к группам покупателей.<br>Получение конечной цены акции, используя инструмент "формула".
<br>Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['info_third_specials']	= '<b>НАЗВАНИЕ и КОММЕНТАРИЙ</b>';
$_['info_fourth_specials']	= '<b>Название</b>: выводится в корзине напротив самой акции.
<br><b>Комментарий</b>: используется для краткого комментария и прочей технической информации к данной акции.';

// Help Products One
$_['help_name_specials_one']		= 'Настройка';
$_['helper_name_specials_one']		= '<b>ВТОРОЙ ЭТАП</b>';
$_['helpers_name_specials_one']		= 'Выбрав и настроив нужные вам значения: исходную цену для расчёта акционой цены на товар
и один из вариантов округления итоговой акционной цены на ваше усмотрение - сохраните первоначальные изменения кнопками
<i class="fa fa-lg fa-check-circle-o"></i> или <i class="fa fa-lg fa-save"></i>  в правом верхнем углу!
<br>Далее можете переходить на массовое редактирование акций товаров.';
$_['help_first_specials_one']		= '';
$_['help_second_specials_one']		= '';

$_['help_third_specials_one']		= '<i class="fa fa-gg fa-rotate-90" aria-hidden="true"></i> <b>ИСХОДНАЯ ЦЕНА</b>';
$_['help_fourth_specials_one']		= 'Выбор исходной цены для расчёта формулой стоимости по акции:
<br><b>COST</b> - от закупочной стоимости;
<br><b>PRICE</b> - от основной цены;
<br>Выбор расчёта от закупочной стоимости <b>COST</b> возможен только если вы используете подобный функционал и это поле имеется в БД.';
$_['help_fifth_specials_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ОКРУГЛЕНИЕ</b>';
$_['help_sixth_specials_one']		= 'Выбор округления итоговой цены.';

// Help Products Two
$_['help_name_specials_two']		= 'Редакторы акций';
$_['help_first_specials_two']		= '<b>ТРЕТИЙ ЭТАП</b>';
$_['help_second_specials_two']		= 'Добавляйте нужное кол-во групп акций кнопкой <i class="fa fa-plus-circle"></i> добавить.
Настроив нужные вам значения <b style="color:green;">ALL</b> / <b>EDIT</b> редактора группы товаров, групп покупателей, приоритета, формулы
и т.д. на ваше усмотрение - сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование акций для групп покупателей, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования.';

$_['help_third_specials_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГРУППЫ ТОВАРОВ</b>';
$_['help_fourth_specials_two']		= 'Товары, на которые будут распространяться акции.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все товары!
<br>Для действия акции на конкретные товары: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_fifth_specials_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГРУППА ПОКУПАТЕЛЕЙ</b>';
$_['help_sixth_specials_two']		= 'Выбор групп покупателей, к которым будет подвязана акция.
<br>Также возможен мульти-выбор групп покупателей.';

$_['help_seventh_specials_two']		= ' <i class="fa fa-sort-amount-asc fa-rotate-180" aria-hidden="true"></i> <b>ПРИОРИТЕТ</b>';
$_['help_eighth_specials_two']		= 'Поле приоритет - даёт возможность приоритета одной акции над другой: чем больше цифра, тем меньше приоритет.';

$_['help_ninth_specials_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ФОРМУЛА</b>';
$_['help_tenth_specials_two']		= 'Формула получения итоговой цены акции.
<br>В выпадающем списке выберите одно из необходимых вам действий (+, -, *, /,.. и т.д.).
<br>Далее в поле справа от него введите необходимое значение.
<br>Учтите, что формула рассчитывает каждое поле последовательно!
<br>Можете использовать любое одно, любые два или все три поля на ваше усмотрение!
<br>Если нет надобности в каких либо полях, то просто оставьте в этом поле выпадающий список действий пустым.
В таком случае это поле вне зависимости от его значения будет игнорироваться.**';

$_['help_eleventh_specials_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ДАТА</b>';
$_['help_twelfth_specials_two']		= 'Время действия акции.
<br>По умолчанию дата не установленна (Пустое поле = время действия - всегда).
<br>Для действия данной акции в определённое время установите свою дату от её начала и до её конца включительно!';

$_['help_thirteenth_specials_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ДНИ НЕДЕЛИ</b>';
$_['help_fourteenth_specials_two']		= 'Выбор дней недели для запуска акций.
<br>Выбирайте дни, в которые вы хотели бы предоставлять определённые акции.<br>Если не выбрано ничего, то акция будет действовать ежедневно.';

$_['help_fifteenth_specials_two']	= '<i class="fa fa-repeat" aria-hidden="true"></i> <b>ПЕРИОД</b>';
$_['help_sixteenth_specials_two']	= 'Периодичность акции в неделях. Выбрав дни недели, выставьте необходимую переодичность: каждые две недели,
каждые три недели и т.д..<br> Пустое значение = всегда!';

$_['help_seventeenth_specials_two']		= '<i class="fa fa-clock-o" aria-hidden="true"></i> <b>ВРЕМЯ</b>';
$_['help_eighteenth_specials_two']	= 'Выбор времени суток для запуска акций.
<br>Выбирайте промежутки времени суток, в которые вы хотели бы предоставлять определённые акции. Акции будут применяться в выбранные вами часы.
<br>Если не выбрано ничего, то акции будут доступны в течении всего времени.
<br>Серверное время: - используется время сервера.';

$_['help_nineteenth_specials_two']		= '<i class="fa fa-eject fa-rotate-90" aria-hidden="true"></i> <b>СТАРТ и СТОП</b>';
$_['help_twentieth_specials_two']		= 'Вы можете включать или отключать ту или иную акцию, переключая свитчер <b>ON | OFF</b>.
<br>Каждый раз при включении и отключении редактора обновляются и очищаются соответствующие поля цен выбранных товаров.
<br><b style="color:red;">ВАЖНО!</b>: Прежде, чем запустить какую либо акцию, обязательно сохраните все изменения кнопкой
<i class="fa fa-lg fa-check-circle-o"></i> в правом верхнем углу!';

$_['help_twentyfirst_specials_two']		= '<i class="fa fa-clone" aria-hidden="true"></i> <b>КЛОНИРОВАНИЕ</b>';
$_['help_twentysecond_specials_two']	= 'Функция клонирования редактора акции. Упрощает работу с редактированием товаров.
Если вы хотите применить иную формулу, группу покупателей к уже используемым товарам в каком либо редакторе, то просто нажмите для её
клонирования на кнопку <i class="fa fa-lg fa-clone" aria-hidden="true"></i> и отредактируйте на ваше усмотрение.';

$_['help_twentythird_specials_two']	= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['help_twentyfourth_specials_two']	= 'Иконка <i class="fa fa-plus-circle"></i> добавить редактор акций:
добавляет неопределённое количество редакторов.<br>Иконка <i class="fa fa-minus-circle"></i> удалить редактор акций!
Будьте осторожны: востановление удалёной акции невозможно!';

$_['help_end_specials_two']			= 'Общее описание вкладок скидок';
// Error
$_['error_name']			= 'Впишите заголовок!';
$_['error_warning']			= 'У вас недостаточно прав на добавление удаление и редактирование этого модуля!';
