<?php

$_['heading_title']				= 'HDP Пользовательская скидка';
$_['settings_text']				= 'Настройка';
$_['discount_editor_text']		= 'Редактор скидок';
$_['add_name']					= 'Создание скидки';
$_['heading_action_text']		= 'Редактор пользовательской скидки';
$_['users_discount_text']		= 'Пользовательская скидка';
// Name
$_['entry_title']					= 'Заголовок';
$_['entry_title_titles']			= 'Наименование скидки';
$_['entry_description']				= 'Комментарий';
$_['entry_description_titles']		= 'Комментарий к скидке';
$_['entry_shops']					= 'Магазины';
$_['entry_shops_titles']			= 'Редактор магазинов<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_geo']						= 'Гео-зоны';
$_['entry_guest']					= 'Гости';
$_['entry_guest_titles']			= 'Активировать гостей';
$_['entry_geo_titles']				= 'Редактор гео-зон<br>ALL = все магазины<br>EDIT - редактировать';
$_['users_price_correction_titles']	= 'Коррекция цены по условиям скидки<br>MAIN - по основной цене<br>GROUP - по групповым ценам';
$_['entry_users_groups']			= 'Группа клиента';
$_['entry_users_groups_titles']		= 'Группа клиента';
//protected
$_['protect_globals']		= 'Глобально';
$_['protect_default']		= 'По умолчанию';
$_['protect_active']		= 'Активировать';
$_['protect_ignore']		= 'Игнорировать';
$_['protect_priority']		= 'Приоритет';
$_['protect_summary']		= 'Суммировать';
// HIDDEN
$_['protect_discount']		= 'Скидка';
$_['protect_markup']		= 'Наценка';
$_['entry_users_variants']			= 'Вариант';
$_['entry_users_variants_titles']	= 'Скидка или Наценка';
// HIDDEN
// Buttons
$_['button_edit_shops_list']		= 'Редактировать список магазинов<br>активно только в режиме EDIT';
$_['button_edit_geo_list']			= 'Редактировать список гео-зон<br>активно только в режиме EDIT';
$_['button_client_group_list']		= 'Редактировать список клиентов<br>активно только в режиме EDIT';
$_['button_product_group_list']		= 'Редактировать группу товаров<br>активно только в режиме EDIT';
// Editors
$_['entry_date']									= 'Дата';
$_['entry_date_titles']								= 'Дата начала и окончания<br>Если пусто = всегда';
$_['entry_product_groups']							= 'Товары';
$_['entry_product_groups_titles']					= 'Редактор товаров<br>ALL = все товары<br>EDIT = редактировать';
$_['entry_discounts']								= 'Скидки';
$_['entry_discounts_titles']						= 'Скидки от кол-ва товаров<br>Те, что в редакторе карточки товаров';
$_['entry_discount_specials_condition']				= 'Условие';
$_['entry_discount_specials_condition_titles']		= 'Варианты работы скидок<br>от кол-ва товара и акций';
$_['entry_stock']									= 'Акции';
$_['entry_stock_titles']							= 'Акции товаров';
$_['entry_options']									= 'Опции';
$_['entry_options_titles']							= 'Опции товара';

$_['entry_client_group']					= 'Клиенты';
$_['entry_client_group_titles']				= 'Редактор групп и зарегистрированных покупателей<br>ALL = все группы<br>EDIT - редактировать';
$_['entry_product_group']					= 'Товары';
$_['entry_product_group_titles']			= 'Редактор товаров<br>ALL = все товары<br>EDIT - редактировать';
$_['entry_discount_percent']				= 'Размер|Тип';
$_['entry_discount_percent_titles']			= 'Размер скидки<br>Тип: % | фиксированный';
$_['entry_discount_editor_status']			= '<i class="fa fa-power-off" aria-hidden="true"></i> ';
$_['entry_discount_editor_status_titles']	= 'Вкл | Выкл<br>ON | OFF';
$_['entry_date_start']						= 'Дата начала';
$_['entry_date_end']						= 'Дата окончания';
$_['column_delete']							= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']					= 'Добавить<br>Удалить';

// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками "Хелпера" в правом верхнем углу каждого пункта,
если что-либо не понятно.</span>';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Users
$_['help_name_users']		= 'Редактор пользовательской скидки';
$_['help_first_users']		= '<b>СТАРТ</b>';
$_['help_second_users']		= 'Введите заголовок / наименование данной пользовательской или гостевой скидки
и его краткое описание / комментарий в соответсвующие для этого поля.
<br>Далее: Сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>После применения изменений вы сразу перейдёте на страницу редактирования добавленной скидки. После того, как все необходимые параметры настроены, не забудьте активировать скидку на странице добавления скидок.
<br>При необходимости, к редактированию скидки можно перейти позже, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования со страницы добавления скидок.';
// Info Modal Users
$_['info_first_users']	= '<b>ОПИСАНИЕ</b>';
$_['info_second_users']	= 'Вкладка <b>Пользовательские</b> позволяет создавать гибко настраиваемые пользовательские, гостевые скидки,
как в двух различных фиксированных значениях, так и в процентном значении - для каждого магазина, если вы используете режим мульти-магазина.
По их географическим зонам, групп покупателей или отдельных покупателей на ваш выбор, так и для любых товаров с возможностью их фильтрации
по различным параметрам.
<br>Помимо всего, дополнительно внедрены инструменты работы со встроенными в редактор карточки товара скидками от ко-ва и акциями -
позволяя каждую из них использовать в нескольких вариациях совместно с пользовательской скидкой.
<br>Также, есть возможность разграничивать их действия в отношении друг друга, т.е. встроенная скидка от кол-ва или акция что,
используются в редакторе карточки товара по умолчанию.
<br>Также доступна для редактирования дата действия скидки. Каждый элемент более детально расписан в HELPER!';

$_['info_third_users']	= '<b>НАЗВАНИЕ и КОММЕНТАРИЙ</b>';
$_['info_fourth_users']	= '<b>Название</b>: выводится в корзине напротив самой скидки.
<br><b>Комментарий</b>: используется для краткого комментария и прочей технической информации к данной скидке.';
// Help Users One
$_['help_name_users_one']		= 'Настройка';
$_['helper_name_users_one']		= '<b>ВТОРОЙ ЭТАП</b>';
$_['helpers_name_users_one']	= 'Выбрав и настроив нужные вам значения:  магазинов, гео-зон, клиентов или гостей
<b style="color:green;">ALL</b> / <b>EDIT</b>, - на ваше усмотрение -
сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование количественных скидки по магазинам, гео-зонам, гостям,
клиентам, кликнув на иконку <i class="fa fa-pencil"></i> редактирования.';

$_['help_first_users_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>МАГАЗИНЫ</b>';
$_['help_second_users_one']		= 'Магазины, на которые будут распространяться пользовательские скидки.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все магазины!
<br>Для действия скидок в конкретных магазинах: переключите свитчер в режим <b>EDIT</b> сохраните изменения
и далее кликните на активировавшуюся справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора магазинов выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_third_users_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГЕО</b>';
$_['help_fourth_users_one']		= 'Выбор географических зон | регионов - на которые будут распространяться пользовательские скидки.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все географические зоны!
<br>Для действия скидки в конкретных магазинах: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора географических зон отредактируйте их по своему усмотрению или при необходимости
воспользуйтесь подсказками "Хелпера"!';

$_['help_fifth_users_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГОСТИ</b>';
$_['help_sixth_users_one']		= '<br>По умолчанию <b style="color:green;">YES</b> - скидка распространяется на гостей.
<br>Чтобы скидка не действовала на незарегистрированных клиентов, переключите свитчер в режим <b>NO</b>';

$_['help_seventh_users_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РЕДАКТОР КЛИЕНТОВ</b>';
$_['help_eighth_users_one']		= 'Зарегистрированные клиенты / покупатели, на которых будет распространяться каждая добавленная пользовательская скидка!
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все существующие покупатели!
<br>Для действия скидки на конкретных покупателей: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора покупателей выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"';

$_['help_ninth_users_one']		= '<i class="fa fa-exchange" aria-hidden="true"></i> <b>КОРРЕКЦИЯ</b>';
$_['help_tenth_users_one']		= 'Коррекция цены для условий количественной скидки товара (те, что встроены в редактор карточки товара в административной части.
<br><b style="color:green;">MAIN</b> условия работы скидки от количества товара по основной цене. Т.е. отсчёт будет исходя из основной цены товара.
<br><b>GROUP</b> - условия работы скидки от количества товара по групповым ценам. Т.е. отсчёт будет исходя из групповой цены товара
(имеются в виду разные цены для групп покупателей / оптовые цены).
<br><b style="color:red;">**</b> Если у товара нет групповой / оптовой цены - то используется основная цена товара для расчета скидки';

// Help Users Two
$_['help_name_users_two']		= 'Редактор скидок';
$_['help_first_users_two']		= '<b>ТРЕТИЙ ЭТАП</b>';
$_['help_second_users_two']		= 'Добавляйте нужное кол-во скидок кнопкой <i class="fa fa-plus-circle"></i> добавить.
Настроив нужные вам значения, сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование скидки для гостей, клиентов и товаров, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования.';

$_['help_sixth_users_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РАЗМЕР СКИДКИ</b>';
$_['help_seventh_users_two']	= 'Поле для установки размера пользовательской скидки
<br>• <b style="color:red;">%</b> - в процентах.
<br>• <b style="color:red;">each fix</b> - фиксированная на каждый товар.
<br>• <b style="color:red;">full fix</b> - фиксированная на весь заказ.';

$_['help_eighth_users_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ДАТА</b>';
$_['help_ninth_users_two']		= 'Время действия пользовательских скидок.
<br>По умолчанию дата не установлена = время действия - всегда!<br>Для действия данной скидки в определённое время,
установите свою дату от её начала и до её конца включительно!
<br>Для понимания, с какого периода работает скидка, можно установить только дату её начала.';

$_['help_tenth_users_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ТОВАРЫ</b>';
$_['help_eleventh_users_two']		= 'Товары, на которые будет распространяться каждая пользовательская скидка.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все товары!
<br>Для действия скидки на конкретные товары: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_twelfth_users_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>СКИДКИ</b>';
$_['help_thirteenth_users_two']		= 'Функция - скидки от кол-ва товара (те, что добавляются во вкладке "Скидки" в редакторе
карточки товара). Позволяет более гибко настраивать каждую пользовательскую скидку со скидкой от кол-ва товара в 3х вариантах.';

$_['help_fourteenth_users_two'] = '';
$_['help_fifteenth_users_two'] = '• <b style="color:green;">Активировать</b>: Если скидка на количество (та, что на закладке "Скидки" в товаре), меньше текущей настроенной пользовательской скидки, то из пользовательской скидки вычитается это значение. Если значение скидки товара больше, то оно поглощает настроенную пользовательскую скидку. Проверка производится для каждого товара в корзине, поэтому на какие-то товары пользовательская скидка будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: пользовательская скидка применяется только на то кол-во товаров, на которое не распространяется
скидка от кол-ва товара!  (Пример: если у товара скидка от кол-ва товара активна на 2шт (больше одного), то пользовательские скидки модуля
применяются только к одному товару, а не на два и более товара).
<br>• <b style="color:blue;">Суммировать</b>: суммируется пользовательская скидка и скидка товара!
(т.е. скидка от кол-ва товара + пользовательская скидка модуля).';

$_['help_sixteenth_users_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>АКЦИИ</b>';
$_['help_seventeenth_users_two']	= 'Функция - акций товара (те, что добавляются во вкладке "Акции" в редакторе карточки товара).
Позволяет более гибко настраивать пользовательскую скидку с акцией товара в 3-х вариантах.';

$_['help_eighteenth_users_two'] = '';
$_['help_nineteenth_users_two'] = '• <b style="color:green;">Активировать</b>: Если акция (та, что на закладке "Акции" в товаре), меньше текущей настроенной пользовательской скидки, то из пользовательской скидки вычитается это значение. Если значение акции товара больше, то оно поглощает настроенную пользовательскую скидку. Проверка производится для каждого товара в корзине, поэтому на какие-то товары пользовательская скидка будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: игнорируется пользовательская скидка на товары по Акции! -
(т.е. к товарам на которые установлена акция, пользовательская скидка не применяется!)
<br>• <b style="color:blue;">Суммировать</b>: суммируется пользовательская скидка и акция товара!
(т.е. цена товара по акции + пользовательская скидка).';

$_['help_twentieth_users_two']		= '<b><i class="fa fa-power-off" aria-hidden="true"></i></b>';
$_['help_twentyfirst_users_two']	= 'Статус скидки - вы можете включать или отключать ту или иную скидку на своё усмотрение.';

$_['help_twentysecond_users_two']	= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['help_twentythird_users_two']	= 'Иконка <i class="fa fa-plus-circle"></i> добавить скидку: добавляет неопределённое количество скидок.
<br>Иконка <i class="fa fa-minus-circle"></i> удалить скидку! Будьте осторожны: востановление удалёной скидки невозможно!';
$_['help_end_users_two']			= 'Общее описание вкладок скидок.';

// Error
$_['error_permission']		= 'Не хватает прав!';
$_['error_name']			= 'Впишите заголовок!';
$_['error_warning']			= 'Внимательно проверьте форму на ошибки!';
