<?php
// *	@copyright		Pavel Kravchenko; https://opencartforum.com/profile/711752-paulkravchenko/
$_['heading_title'] 				= 'UniShop - Питання покупців v1.3.1';

$_['text_module'] 					= 'Модулі';

$_['button_save'] 					= 'Зберегти';
$_['button_scancel'] 				= 'Скасувати';
$_['button_show_setting'] 			= 'Показати блок налаштувань модуля';
$_['button_save_setting'] 			= 'Зберегти налаштування модуля';

$_['text_status_1'] 				= 'Новий';
$_['text_status_2'] 				= 'В обробці';
$_['text_status_3'] 				= 'Завершений';

$_['entry_request_list'] 			= 'Показувати у картці товару:';
$_['text_on'] 						= 'Так';
$_['text_off'] 						= 'Ні';

$_['text_requests'] 				= 'Питання покупців';
$_['text_total_requests'] 			= 'Всього';

$_['text_notify'] 					= 'Повідомити про наявність';

$_['column_type'] 					= 'Тип звернення';
$_['column_name'] 					= 'Ім’я';
$_['column_phone'] 					= 'Телефон';
$_['column_mail'] 					= 'E-mail';
$_['column_comment'] 				= 'Текст звернення';
$_['column_admin_comment'] 			= 'Коментар адміністрації';
$_['column_date_added'] 			= 'Дата додавання';
$_['column_date_modified'] 			= 'Дата редагування';
$_['column_status']					= 'Статус';
$_['column_request_list']			= 'В картці товару';
$_['column_action'] 				= 'Дія';

$_['text_list'] 					= 'Список звернень покупців';
$_['text_edit'] 					= 'Редагування звернення';
$_['entry_type'] 					= 'Тема звернення';
$_['entry_name'] 					= 'Ім’я';
$_['entry_phone'] 					= 'Контактний телефон';
$_['entry_mail'] 					= 'Контактний e-mail';
$_['entry_product'] 				= 'Товар';
$_['entry_comment'] 				= 'Текст звернення';
$_['entry_admin_comment'] 			= 'Коментар адміністрації';
$_['entry_date_added'] 				= 'Дата додавання';
$_['entry_status'] 					= 'Статус';

$_['column_notify'] 				= 'Налаштування форми оповіщення про надходження товару'; 
$_['column_question']				= 'Налаштування форми питань про товар'; 
$_['column_email_cap']				= 'Заглушка для поля e-mail'; 

$_['entry_heading_notify'] 			= 'Тема звернення та заголовок попап форми заявки повідомлення про наявність:';
$_['entry_notify_phone'] 			= 'Показувати в формі поле телефону?';
$_['entry_notify_email']			= 'Показувати в формі поле e-mail?<span>Якщо виключити даний пункт, покупцеві не відправиться автоматичний лист з оповіщенням про надходження товару, що його цікавить!</span>';
$_['entry_notify_email_required']	= 'Вимагати заповнення поля e-mail?<span>Якщо виключити даний пункт, покупець може не заповнювати це поле та йому не відправиться автоматичний лист з оповіщенням про надходження товару, що його цікавить.</span>';


$_['entry_heading_question'] 		= 'Тема звернення та заголовок форм питання про товар:';
$_['entry_question_list'] 			= 'Показувати в картці товару вкладку зі списком питань покупців?';
$_['entry_question_phone'] 			= 'Показувати в формі поле телефону?';
$_['entry_question_email'] 			= 'Показувати в формі поле e-mail?<span>Якщо виключити даний пункт, покупцеві не відправиться автоматичний лист з оповіщенням про відповідь його запитання!</span>';
$_['entry_question_email_required']	= 'Вимагати заповнення поля e-mail?<span>Якщо виключити даний пункт, покупець може не заповнювати це поле та йому не відправиться автоматичний лист з оповіщенням про відповідь на його запитання.</span>';

$_['entry_question_captcha'] 		= 'Показувати поле captcha та вимагати його обов’язкове заповнення?';

$_['entry_email_cap'] 				= 'Для випадків, коли покупець не заповнив поле e-mail: <span>Використовується виключно в службових цілях.</span>';

$_['text_notes']					= 'Питання користувача буде показуватися в товарі тільки в тому разі, якщо сам список включений для показу, статус питання стоїть як "Завершено" і в пункті "Показувати в картці товару" стоїть ТАК.'; 

$_['text_comment'] 					= 'Лист відправлений, статус змінений.';

$_['text_subject_notify'] 			= '%s - повідомлення про надходження товару.';
$_['text_message_notify'] 			= 'Доброго дня. Повідомляємо вам, що товар <a href="'.HTTPS_CATALOG.'index.php?route=product/product&product_id=%s">%s</a> з’явився в наявності, будемо раді бачити вас в нашому магазині.';

$_['text_subject_question'] 		= '%s - відповідь на ваше питання.';
$_['text_message_question'] 		= 'Добрий день. Повідомляємо вам, що ви отримали відповідь на ваше питання про <a href="'.HTTPS_CATALOG.'index.php?route=product/product&product_id=%s">%s</a>. <br />
									<b>Ви запитували:</b> %s <br />
									<b>Ми відповідаємо:</b> %s <br /><br />
									Будемо раді бачити вас в нашому магазині.';

$_['text_confirm'] 					= 'Ви впевнені?';

$_['text_success'] 					= 'Звернення покупця змінене.';
$_['text_success_delete'] 			= 'Звернення покупця видалене.';
$_['error_permission'] 				= 'У вас недостатньо прав для редагування або видалення звернення.';
?>
