<?php
// HEADER
$_['heading_title']					= 'HDP Накопительная скидка';
$_['heading_action_text']			= 'Редактор накопительной скидки';
$_['heading_text_title']			= 'Накопительная скидка';
$_['add_name']						= 'Создание скидки';
$_['entry_title']					= 'Заголовок';
$_['entry_title_titles']			= 'Наименование скидки';
$_['entry_description']				= 'Комментарий';
$_['entry_description_titles']		= 'Комментарий к скидке';
$_['settings_text']					= 'Настройка';
$_['discount_editor_text']			= 'Редактор';

$_['entry_shops']							= 'Магазины';
$_['entry_shops_titles']					= 'Редактор магазинов<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_geo']								= 'Гео-зоны';
$_['entry_geo_titles']						= 'Редактор гео-зон<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_client_group']					= 'Клиенты';
$_['entry_client_group_titles']				= 'Редактор групп и зарегистрированных покупателей<br>ALL = все покупатели';
$_['entry_product_group']					= 'Товары';
$_['entry_product_group_titles']			= 'Редактор товаров<br>ALL = все товары<br>EDIT - редактировать';
$_['entry_accumulative_condition']			= 'Условие';
$_['entry_accumulative_condition_titles']	= 'Варианты работы скидок<br>от кол-ва товара и акций';
$_['accumulative_price_correction_titles']	= 'Коррекция цены по условиям скидки<br>MAIN - по основной цене<br>GROUP - по групповым ценам';
//protected
$_['protect_all']			= 'Все значения';
$_['protect_custom']		= 'Хотя бы одно значение';
$_['protect_globals']		= 'Глобально';
$_['protect_default']		= 'По умолчанию';
$_['protect_active']		= 'Активировать';
$_['protect_ignore']		= 'Игнорировать';
$_['protect_priority']		= 'Приоритет';
$_['protect_summary']		= 'Суммировать';
// HIDDEN
$_['protect_discount']		= 'Скидка';
$_['protect_markup']		= 'Наценка';
$_['entry_users_variants']				= 'Вариант';
$_['entry_users_variants_titles']		= 'Скидка или Наценка';
// HIDDEN
//button
$_['button_edit_shops_list']		= 'Редактор списока магазинов<br>активно только в режиме EDIT';
$_['button_edit_geo_list']			= 'Редактировать список гео-зон<br>активно только в режиме EDIT';
$_['button_edit_product_groups']	= 'Редактор группы товаров<br>активно только в режиме EDIT';
$_['button_client_group_list']		= 'Редактор группы клиентов<br>активно только в режиме EDIT';
$_['button_product_group_list']		= 'Редактор группы товаров<br>активно только в режиме EDIT';

$_['name_function_orders']				= 'Заказов';
$_['name_function_orders_titles']		= 'Кол-во совершённых заказов<br>Пустое поле игнорируется!';
$_['name_function_products']			= 'Товаров';
$_['name_function_products_titles']		= 'Кол-во купленных товаров<br>Пустое поле игнорируется!';
$_['name_function_sum']					= 'Сумма';
$_['name_function_sum_titles']			= 'Общая сумма накопления<br>Пустое поле игнорируется!';

$_['entry_variant_accumulative']			= 'Значение';
$_['entry_variant_accumulative_titles']		= 'Варианты занчений<br>Заказов|Товаров|Суммы';
$_['entry_date']							= 'Дата';
$_['entry_date_titles']						= 'Дата начала и окончания скидки<br>Если пусто = всегда';
$_['entry_product_groups']					= 'Товары';
$_['entry_product_groups_titles']			= 'Редактор товаров<br>ALL = все товары<br>EDIT - редактировать';
$_['entry_discounts']						= 'Скидки';
$_['entry_discounts_titles']				= 'Скидки от кол-ва товаров<br>Те, что в редакторе карточки товаров';
$_['entry_options']							= 'Опции';
$_['entry_options_titles']					= 'Опции товара';
$_['entry_options_titles_stock']			= 'Опции товара';
$_['entry_stock']							= 'Акции';
$_['entry_stock_titles']					= 'Акции товаров';
$_['entry_sum_status_orders']				= 'Статусы';
$_['entry_sum_status_orders_titles']		= 'Статусы заказов, при которых<br>скидка будет задействована';
$_['entry_sum_data_orders_titles']			= 'За период времени<br>совершенных заказов';

$_['entry_discount_percent']				= 'Размер|Тип';
$_['entry_discount_percent_titles']			= 'Размер скидки<br>Тип: % - процент<br>each fix - фикс. к товару<br>full fix - фикс. на общую';
$_['entry_discount_editor_status']			= '<i class="fa fa-power-off" aria-hidden="true"></i> ';
$_['entry_discount_editor_status_titles']	= 'Вкл | Выкл<br>ON | OFF';

$_['entry_client_status']			= 'Статус накопления';
$_['entry_client_status_titles']	= 'Накопительные статусы<br>см. блок настройки';
$_['entry_discount_date']			= 'Дата';
$_['entry_discount_date_titles']	= 'Дата начала и окончания<br>Если пусто = всегда';
$_['entry_date_start']				= 'Дата начала';
$_['entry_date_end']				= 'Дата окончания';
$_['column_delete']					= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']			= 'Добавить<br>Удалить';


// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками "Хелпера" в правом верхнем углу каждого пункта,
если что-либо не понятно.</span>';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Users
$_['help_name_accumulative']		= 'Редактор накопительной скидки';
$_['help_first_accumulative']		= '<b>СТАРТ</b>';
$_['help_second_accumulative']		= 'Введите заголовок / наименование данной накопительной скидки
и его краткое описание / комментарий в соответствующие для этого поля.
<br>Далее: Сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>После применения изменений вы сразу перейдёте на страницу редактирования добавленной скидки. После того, как все необходимые параметры настроены, не забудьте активировать скидку на странице добавления скидок.
<br>При необходимости, к редактированию скидки можно перейти позже, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования со страницы добавления скидок.';

// Info Modal Accumulative
$_['info_first_accumulative']	= '<b>ОПИСАНИЕ</b>';
$_['info_second_accumulative']	= 'Вкладка <b>Накопительные</b> позволяет создавать гибко настраиваемые накопительные скидки.
На общее количество заказов, товаров и накопленной суммы (с условием: "и, или, одно", как в двух различных фиксированных значениях,
так и в процентном значении), для каждого магазина, если вы используете режим мульти-магазина. По географическим зонам,
групп покупателей или отдельных покупателей на ваш выбор, так и для любых товаров с возможностью их фильтрации по различным параметрам.
<br>Дополнительно ко всему внедрены инструменты работы со встроенными в редактор карточки товара количественными скидками и акциями -
позволяя каждую из них использовать в нескольких вариациях совместно с накопительной скидкой.
<br>Также, есть возможность разграничивать их действия в отношении друг друга, т.е. встроенная количественная скидка или акция
что, используются в редакторе карточки товара по умолчанию.
<br>Также доступна для редактирования дата действия скидки.  Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['info_third_accumulative']	= '<b>НАЗВАНИЕ и КОММЕНТАРИЙ</b>';
$_['info_fourth_accumulative']	= '<b>Название</b>: выводится в корзине напротив самой скидки.
<br><b>Комментарий</b>: используется для краткого комментария и прочей технической информации к данной скидке.';
// Help Users One
$_['help_name_accumulative_one']		= 'Настройка';
$_['helper_name_accumulative_one']		= '<b>ВТОРОЙ ЭТАП</b>';
$_['helpers_name_accumulative_one']		= 'Выбрав и настроив нужные вам значения:  магазинов, гео-зон, клиентов и товаров
<b style="color:green;">ALL</b> / <b>EDIT</b>, скидок от кол-ва товара, акции условий их работы и опций а также статусы заказов
для получения накопительной скидки - сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование накопительной скидки по магазинам, гео-зонам, группам клиентов и товаров
кликнув на иконку <i class="fa fa-pencil"></i> редактирования.';

$_['help_first_accumulative_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>МАГАЗИНЫ</b>';
$_['help_second_accumulative_one']	= 'Магазины на которые будут распространяться накопительные скидки.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все магазины!
<br>Для действия скидки в конкретных магазинах: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся справа иконку
<i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора магазинов выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_third_accumulative_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГЕО-ЗОНЫ</b>';
$_['help_fourth_accumulative_one']	= 'Географические зоны, на которые будут распространяться накопительные скидки.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все географические зоны!
<br>Для действия скидки в конкретных магазинах: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора географических зон отредактируйте их по своему усмотрению или при необходимости
воспользуйтесь подсказками "Хелпера"!';

$_['help_fifth_accumulative_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РЕДАКТОР КЛИЕНТОВ</b>';
$_['help_sixth_accumulative_one']	= 'Зарегистрированные клиенты / покупатели, на которых будет распространяться накопительная скидка!
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все существующие покупатели!
<br>Для действия скидки на конкретных клиентов: переключите свитчер в режим
<b>EDIT</b> и кликните на активировавшуюся справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора покупателей выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_seventh_accumulative_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ТОВАРЫ</b>';
$_['help_eighth_accumulative_one']		= 'Товары на которые будут распространяться накопительные скидки.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все товары!<br>Для действия скидок на конкретные товары: переключите свитчер в режим
<b>EDIT</b> и кликните на активировавшуюся справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_ninth_accumulative_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>СКИДКИ</b>';
$_['help_tenth_accumulative_one']		= 'Функция - скидки от кол-ва товара (те, что добавляются во вкладке "Скидки" в редакторе карточки товара).
Позволяет более гибко настраивать каждую накопительную скидку со скидкой от кол-ва товара в 3х вариантах.';

$_['help_eleventh_accumulative_one']	= '';
$_['help_twelfth_accumulative_one']		= '• <b style="color:green;">Активировать</b>: Если скидка на количество (та, что на закладке "Скидки" в товаре), меньше текущей настроенной накопительной скидки, то из накопительной скидки вычитается это значение. Если значение скидки товара больше, то оно поглощает настроенную накопительную скидку. Проверка производится для каждого товара в корзине, поэтому на какие-то товары накопительная скидка будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: накопительная скидка применяется только на то кол-во товаров, на которое не распространяться
скидка от кол-ва товара!  (Пример: если у товара скидка от кол-ва товара активна на 2шт (больше одного), то накопительная скидка модуля
применяется только к одному товару, а не на два и более товара).
<br>• <b style="color:blue;">Суммировать</b>: суммируется накопительная скидка и скидка товара!
(т.е. скидка от кол-ва товара + накопительная скидка модуля).';

$_['help_thirteenth_accumulative_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>АКЦИИ</b>';
$_['help_fourteenth_accumulative_one']		= 'Функция - акций товара (те, что добавляются во вкладке "Акции" в редакторе карточки товара).
Позволяет более гибко настраивать накопительную скидку с акцией товара в 3-х вариантах.';

$_['help_fifteenth_accumulative_one']	= '';
$_['help_sixteenth_accumulative_one']	= '• <b style="color:green;">Активировать</b>: Если акция (та, что на закладке "Акции" в товаре), меньше текущей настроенной накопительной скидки, то из накопительной скидки вычитается это значение. Если значение акции товара больше, то оно поглощает настроенную накопительную скидку. Проверка производится для каждого товара в корзине, поэтому на какие-то товары накопительная скидка будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: игнорируется накопительная скидка на товары по Акции! -
(т.е. к товарам на которые установлена акция, накопительная скидка не применяется!)
<br>• <b style="color:blue;">Суммировать</b>: суммируется накопительная скидка и акция товара!
(т.е. цена товара по акции + накопительная скидка).';

$_['help_seventeenth_accumulative_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>СТАТУСЫ ЗАКАЗОВ</b>';
$_['help_eighteenth_accumulative_one']	= 'Суммируемые статусы заказов. Выбор статусов, при которых срабатывает накопленная скидка.';

$_['help_nineteenth_accumulative_one']		= '<i class="fa fa-calendar"></i> <b>ДАТА</b>';
$_['help_twentieth_accumulative_one']		= 'Период времени совершённых ранее суммируемых заказов, за который начисляется накопительная скидка.
<br>По умолчанию дата не установлена Пустое поле = период - за всё время!';


$_['help_twentyfirst_accumulative_one']		= '<i class="fa fa-exchange" aria-hidden="true"></i> <b>КОРРЕКЦИЯ</b>';
$_['help_twentysecond_accumulative_one']	= 'Коррекция цены для условий количественной скидки товара (те, что встроены в редактор карточки товара в административной части.
<br><b style="color:green;">MAIN</b> условия работы скидки от количества товара по основной цене. Т.е. отсчёт будет исходя из основной цены товара.
<br><b>GROUP</b> - условия работы скидки от количества товара по групповым ценам. Т.е. отсчёт будет исходя из групповой цены товара
(имеются в виду разные цены для групп покупателей / оптовые цены).
<br><b style="color:red;">**</b> Если у товара нет групповой / оптовой цены - то используется основная цена товара для расчета скидки';

// Help Users Two
$_['help_name_accumulative_two']	= 'Редактор скидок';
$_['help_first_accumulative_two']	= '<b>ТРЕТИЙ ЭТАП</b>';
$_['help_second_accumulative_two']	= 'Добавляйте нужное кол-во скидок под накопительные статусы кнопкой <i class="fa fa-plus-circle"></i>
добавить. Настроив нужные вам значения <b style="color:green;">ALL</b> / <b>EDIT</b>, скидки, акции и их опций - на ваше усмотрение
и сохраните первоначальные изменения кнопками <i class="fa fa-lg fa-check-circle-o"></i> или <i class="fa fa-lg fa-save"></i>
в правом верхнем углу! Далее можете переходить на более гибкое редактирование скидки по группам клиентов и товаров, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования.';

$_['help_third_accumulative_two']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>СТАТУС НАКОПЛЕНИЯ</b>';
$_['help_fourth_accumulative_two']	= 'Присвоение статусов накопительных скидок.
В блоке НАСТРОЙКИ выберите вкладку СТАТУСЫ, создайте их и присвойте каждой группе созданных накопительных скидок свои статусы,
к примеру - GOLD, VIP  и т.д. После этого вы можете присвоить каждой накопительной скидке принадлежащий ей накопительный статус.';

$_['help_tenth_accumulative_two']		 = '<b><i class="fa fa-pencil-square-o" aria-hidden="true"></i> ЗАКАЗОВ</b>';
$_['help_eleventh_accumulative_two']	= 'Поле ввода значения для общего количества совершённых заказов, при которых
накопительная скидка будет задействована.<br>Или оставьте это поле пустым для его исключения!';

$_['help_twelfth_accumulative_two']		= '<b><i class="fa fa-pencil-square-o" aria-hidden="true"></i> ТОВАРОВ</b>';
$_['help_thirteenth_accumulative_two']	= 'Поле ввода значения для общего количества купленных товаров, при которых
накопительная скидка будет задействована.<br>Или оставьте это поле пустым для его исключения!';

$_['help_fourteenth_accumulative_two']	= '<b><i class="fa fa-pencil-square-o" aria-hidden="true"></i> СУММА</b>';
$_['help_fifteenth_accumulative_two']	= 'Поле ввода значения для общей накопленной суммы, при которых
накопительная скидка будет задействована.<br>Или оставьте это поле пустым для его исключения!';

$_['help_sixth_accumulative_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РАЗМЕР|ТИП</b>';
$_['help_seventh_accumulative_two']		= 'Поле для установки размера накопительной скидки
<br>• <b style="color:red;">%</b> - в процентах.
<br>• <b style="color:red;">each fix</b> - фиксированная на каждый товар.
<br>• <b style="color:red;">full fix</b> - фиксированная с общей суммы.';

$_['help_eighth_accumulative_two']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ЗНАЧЕНИЕ</b>';
$_['help_ninth_accumulative_two']	= 'Выбор условия для полей <b>• ЗАКАЗОВ • ТОВАРОВ • СУММА •</b>, в соответствии с которыми
накопительная скидка будет задействована:
<br>• <b>Все значения</b>: скидка начисляется, если условия не пустых полей соответствуют статусу заказа.
<br>• <b>Хотя бы одно значение</b>: скидка начисляется, если условие хотя бы одного из не пустых полей совпало со статусом завершённого заказа.
<br> ***Если вы из всех полей используете только одно поле, то оба условия значения будут применяться только на одно заполненное поле.
При заполнении двух, трёх полей - в соответствии с условием выбранного значения.';

$_['help_sixteenth_accumulative_two']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ДАТА</b>';
$_['help_seventeenth_accumulative_two']	= 'Время действия накопительной скидки.
<br>По умолчанию дата не установлена Пустое поле = время действия - всегда!
<br>Для действия данной скидки в определённое время, установите свою дату от её начала и до её конца включительно!
<br>Для понимания, с какого периода работает скидка, можно установить только дату её начала.';

$_['help_eighteenth_accumulative_two']	= '<b><i class="fa fa-power-off" aria-hidden="true"></i></b>';
$_['help_nineteenth_accumulative_two']	= 'Статус скидки - вы можете включать или отключать ту или иную скидку на своё усмотрение.';

$_['help_twentieth_accumulative_two']		= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['help_twentyfirst_accumulative_two']		= 'Иконка <i class="fa fa-plus-circle"></i> добавить скидку: добавляет неопределённое количество
скидок.<br>Иконка <i class="fa fa-minus-circle"></i> удалить скидку: удаляет добавленную скидку!
<br>Будьте осторожны: восстановление удалённой скидки невозможно!';

$_['help_twentysecond_accumulative_two']	= '';
$_['help_twentythird_accumulative_two']		= '';
$_['help_end_accumulative_two']	= 'Общее описание вкладок скидок.';

// Error
$_['error_permission']		= 'Не хватает прав!';
$_['error_name']			= 'Впишите заголовок!';
$_['error_warning']			= 'Внимательно проверьте форму на ошибки!';
