<?php

// Heading
$_['heading_title'] = '<img width="24" height="24" src="view/image/neoseo.png" style="float: left;"><p style="margin:0;line-height: 24px;">NeoSeo Опции товаров PRO</p>';
$_['heading_title_raw'] = 'NeoSeo Опции товаров PRO';

$_['tab_general'] = 'Параметры';
$_['tab_header'] = 'Шапка';
$_['tab_logs'] = 'Логи';
$_['tab_fields'] = 'Поля';
$_['tab_support'] = 'Поддержка';
$_['tab_license'] = 'Лицензия';
$_['tab_summ'] = 'Сумма прописью';
$_['tab_usefull'] = 'Полезные ссылки';

// Text
$_['text_payment'] = 'Оплата';
$_['text_success'] = 'Настройки модуля обновлены!';
$_['text_module'] = 'Модули';
$_['text_order_date_created'] = 'Дата создания';
$_['text_order_date_modified'] = 'Дата изменения';
$_['text_order_date_current'] = 'Текущая дата';
$_['text_separate_column'] = 'В отдельной колонке';
$_['text_product_column'] = 'В колонке продукта';
$_['text_product_name'] = 'В названии продукта';
$_['text_success_clear'] = 'Лог файл успешно очищен!';
$_['text_clear_log'] = 'Очистить лог';

$_['button_save'] = 'Сохранить';
$_['button_save_and_close'] = 'Сохранить и Закрыть';
$_['button_close'] = 'Закрыть';
$_['button_recheck'] = 'Проверить еще раз';
$_['button_clear_log'] = 'Очистить лог';

// Entry
$_['entry_unit_option_null'] = 'Единицы:';
$_['entry_unit_option_null_desc'] = 'Только 0 (ноль)';
$_['entry_unit_option_one_nine'] = 'Единицы:';
$_['entry_unit_option_one_nine_desc'] = 'Только 1-9';
$_['entry_unit_option_ten_nineteen'] = 'Единицы:';
$_['entry_unit_option_ten_nineteen_desc'] = 'Только 10-19';
$_['entry_tens_option'] = 'Десятки:';
$_['entry_tens_option_desc'] = 'Только 20,30,40,50,60,70,80,90';
$_['entry_hundreds_option'] = 'Сотни:';
$_['entry_hundreds_option_desc'] = 'Только 100,200,300,400,500,600,700,800,900';
$_['entry_money_option_coins'] = 'Денежные единицы:';
$_['entry_money_option_coins_desc'] = 'Только наименование монет';
$_['entry_money_option_currency'] = 'Денежные единицы:';
$_['entry_money_option_currency_desc'] = 'Только наименование валюты';
$_['entry_unit_option_one_nine_thousand'] = 'Единицы тысячи:';
$_['entry_unit_option_one_nine_thousand_desc'] = 'Только 1-9';
$_['entry_count_money_option_thousand'] = 'Количество денежных единиц:';
$_['entry_count_money_option_thousand_desc'] = 'Только тысяча';
$_['entry_count_money_option_millon'] = 'Количество денежных единиц:';
$_['entry_unit_option_one_nine_millon'] = 'Единицы миллиона:';
$_['entry_unit_option_one_nine_millon_desc'] = 'Только 1-9';
$_['entry_count_money_option_millon_desc'] = 'Только миллион';
$_['entry_count_money_option_billion'] = 'Количество денежных единиц:';
$_['entry_unit_option_one_nine_billon'] = 'Единицы миллиарда:';
$_['entry_unit_option_one_nine_billon_desc'] = 'Только 1-9';
$_['entry_count_money_option_billion_desc'] = 'Только миллиард';
$_['entry_print_img'] = 'Печать:';
$_['entry_print_img_desc'] = 'Рекомендуемые размеры изображения: 100х100';
$_['entry_print_img_store'] = 'Логотип магазина:';
$_['entry_print_logo_img_desc'] = 'Если не заполнено, то будет выводиться название магазина';
$_['entry_print_img_width'] = 'Ширина печати:';
$_['entry_print_img_width_desc'] = '';
$_['entry_print_img_height'] = 'Высота печати:';
$_['entry_print_img_height_desc'] = '';
$_['entry_status_sale'] = 'Статус:';
$_['entry_product_list_status'] = 'Выводить опции в списках товаров:';
$_['entry_product_base_price'] = 'Выводить базовую цену в списках товаров:';
$_['entry_text'] = 'Дополнительный текст:';
$_['entry_debug'] = 'Отладочный режим:<br /><span class="help">В логи модуля будет писаться различная информация для разработчика модуля.</span>';
$_['entry_status'] = 'Статус:';

// Error
$_['error_permission'] = 'У Вас нет прав для управления этим модулем!';
$_['error_supplier_info'] = 'Это поле обязательно для заполнения!';
$_['error_ioncube_missing'] = '';
$_['error_license_missing'] = '';
$_['mail_support'] = '';
$_['module_licence'] = ' ';
$_['text_module_version'] = '';



/* =============== LECENSE INFO ================= */
$_['text_module_version'] = '26.3';
$_['error_license_missing'] = '<h3 style="color:red">Отсутствует файл с ключом!</h3>
<p>Для получения файла с ключом свяжитесь с NeoSeo по email <a href="mailto:license@neoseo.com.ua">license@neoseo.com.ua</a>, при этом укажите:</p>
<ul>
	<li>название сайта, на котором вы купили модуль, например: https://neoseo.com.ua</li>
	<li>название модуля, который вы купили, например: NeoSeo Обмен с 1С:Предприятие</li>
	<li>ваше имя пользователя (ник-нейм) на этом сайте, например, NeoSeo</li>
	<li>номер заказа на этом сайте, например, 355446</li>
	<li>основной домен сайта для которого и будет активирован файл с ключом, например, https://neoseo.ua</li>
</ul>
<p>Полученный файл с ключом положите в корень сайта, рядом с файлом robots.txt и нажмите кнопку "Проверить еще раз".</p>
<p>По любым вопросам пишите на support@neoseo.com.ua</p>';
$_['error_ioncube_missing'] = '<h3 style="color:red">Отсутствует IonCube Loader!</h3>
<p>Чтобы пользоваться нашим модулем, вам нужно установить IonCube Loader.</p>
<p>Для установки обратитесь в ТП Вашего хостинга</p>
<p>Если у вас не получается установить IonCube Loader самостоятельно, вы можете попросить помощи у наших специалистов по адресу <a href="mailto:support@neoseo.com.ua">support@neoseo.com.ua</a></p>';
$_['module_licence'] = '<h2>Условия лицензионного соглашения на использование программного обеспечения NeoSeo</h2>
<p>Благодарим вас за покупку программных продуктов нашей веб-студии.</p>
<p>Ниже приведены юридические условия, которые распространяются на всех, кто посещает наш сайт и пользуется нашими программными продуктами или услугами. Данные условия направлены на то, чтобы защитить ваши интересы и интересы ООО “НЕОСЕО” и его аффилированных структур и лиц (далее, "мы", "NeoSeo"), которые выступают в договорах от его имени.</p>
<p><strong>1. Введение</strong></p>
<p>Настоящие Условия использования NeoSeo (“Условия использования”) наряду с дополнительными условиями, которые касаются ряда конкретных услуг или программных продуктов, разработок и представлены на веб-сайте(-ах) NeoSeo, содержат условия и положения, действие которых распространяется на каждого посетителя или пользователя (“Пользователь”, “вы” или “Покупатель”) веб-сайта NeoSeo, приложений, дополнений и компонентов, предложенных нами наряду с предоставлением услуг и веб-сайта, если не указано иное (все услуги и программное обеспечение, программные модули предложенные через веб-сайт NeoSeo или вспомогательные сервисы, веб-сервисы, др. приложения от лица NeoSeo совместно именуются – “Услуги NeoSeo” или “Услуги”).</p>
<p>Условия NeoSeo являются обязательным юридическим договором между NeoSeo и вами – поэтому просим вас внимательно ознакомиться с ними.</p>
<p>Вы можете посещать и/или использовать Услуги NeoSeo только в том случае, если полностью согласны с Условиями NeoSeo: используя какую-либо из Услуг NeoSeo и/или подписываясь на неё, вы выражаете и подтверждаете своё согласие с данными Условиями использования и иными Условиями NeoSeo, например, условия предоставления услуг программирования в разрезе типичных и нетипичных задач, которые выписаны тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далее Условия NeoSeo).</p>
<p>Если вы не можете прочитать Условия NeoSeo, не понимаете их или не согласны с ними, вы должны незамедлительно покинуть Веб-сайт NeoSeo и не пользоваться Услугами NeoSeo.</p>
<p>Используя наши Программные продукты, Сервисы и Услуги, вы подтверждаете, что ознакомились с нашей Политикой конфиденциальности, доступной к просмотру по адресу <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   (“Политика конфиденциальности”).</p>
<p>Настоящий документ является лицензионным соглашением между вами и NeoSeo.</p>
<p>Принимая это соглашение или используя программное обеспечение, вы соглашаетесь со всеми настоящими условиями.</p>
<p>Настоящее соглашение относится к программному обеспечению NeoSeo, любым шрифтам, значкам, изображениям или звуковым файлам, предоставляемым в составе программного обеспечения, а также ко всем обновлениям, дополнениям или службам NeoSeo для программного обеспечения, если в их отношении не применяются иные условия. Это также касается разработанных в NeoSeo приложений и дополнений для SEO-Магазина, которые обеспечивают расширение его функциональных возможностей.</p>
<p>К использованию вами некоторых функций приложений могут применяться дополнительные условия NeoSeo и третьих лиц. Для корректной работы некоторых приложений необходимы дополнительные соглашения с отдельными условиями и политиками конфиденциальности, например с сервисами, предоставляющими услуги смс-нотификации.</p>
<p>Программное обеспечение не продается, а предоставляется по лицензии.</p>
<p>NeoSeo сохраняет за собой все права (например, права, предусмотренные законами о защите интеллектуальной собственности), которые не предоставляются явным образом в рамках настоящего соглашения. Например, эта лицензия не предоставляет вам права:</p>
<li>отдельно использовать или виртуализировать компоненты программного обеспечения;</li>
<li>публиковать или копировать (за исключением разрешенной резервной копии) программное обеспечение, предоставлять программное обеспечение в прокат, в аренду или во временное пользование;</li>
<li>передавать программное обеспечение (за исключением случаев, предусмотренных настоящим соглашением);</li>
<li>пытаться обойти технические ограничения в программном обеспечении;</li>
<li>изучать технологию, декомпилировать или деассемблировать программное обеспечение, а также предпринимать соответствующие попытки, кроме как в той мере и в тех случаях, когда это (а) разрешено применимым правом; (б) разрешено условиями лицензии на использование компонентов с открытым исходным кодом, которые могут входить в состав этого программного обеспечения; (c) необходимо для отладки изменений каких-либо библиотек, лицензируемых по малой стандартной общественной лицензии GNU, которые входят в состав программного обеспечения и связанны с ним;</li>
<p>Вы имеете право использовать данное программное обеспечение, только если у вас имеется соответствующая лицензия и программное обеспечение было должным образом активировано с использованием подлинного ключа продукта или другим разрешенным способом.</p>
<p>В стоимость лицензии SEO-Магазина не включены услуги установки, настройки и тем более его стилизации, также как и других платных/бесплатных дополнений к нему. Данные услуги являются дополнительными, стоимость зависит от количества необходимых для реализации часов, детальнее тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>С полной версией документа можно ознакомиться здесь:<a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';

$_['mail_support'] = '
<p>Всегда рады помочь,</p>
<p>Отдел поддержки Клиентов, веб-студия NeoSeo.</p>
<p>Напоминаем, веб-студия NeoSeo предлагает информационную поддержку бесплатно на форуме <a href="https://opencartmasters.com/">OpenCartMasters.com</a> 
(обычно ответы предоставляются в течении суток на протяжении рабочего дня).</p>
<p>
Если у Вас срочный вопрос и его нужно решить уже, пожалуйста, заказывайте платную поддержку, которая предоставляется в тот же день с использованием Skype и TeamViewer.
</p>
<p>
По общим вопросам пишите в телеграм чат <a href="https://t.me/WebStudioNeoSeo1">https://t.me/WebStudioNeoSeo1</a>
</p>
<p>
Хорошего дня и отличного настроения :) <br>
Команда NeoSeo.</p>
';

// add_entry
$_['entry_module_key'] = "Введите ключ лицензии";
$_['entry_module_key_desc'] = 'Если у Вас проблема с лицензией обратитесь на <a href="https://opencartmasters.com/">OpenCartMasters.com</a> или в телеграм чат <a href="https://t.me/WebStudioNeoSeo1">https://t.me/WebStudioNeoSeo1</a>';
// License
$_['text_license_lifetime'] = 'Пожизненная';
$_['text_license_end_period'] = 'Лицензия просрочена';
$_['text_license_error_domain'] = 'Лицензия не для Вашего домена';
$_['text_license_error_key'] = 'Не верный ключ лицензии';
$_['text_license_missing'] = 'Отсутствует лицензия';
$_['text_valid_to'] = 'Действительна до:';
$_['text_est_time'] = 'Осталось дней:';
$_['text_mode'] = 'Уровень лицензии:';
$_['text_not_included_in_license'] = 'Данная функция не разрешена в этом типе лицензии';

$_['text_mode_0'] = 'Нет лицензии:';
$_['text_mode_1'] = 'Лайт';
$_['text_mode_2'] = 'Стандарт';
$_['text_mode_3'] = 'Про+';
$_['error_access_mode_1'] = 'Данная функция доступна начиная с версии "Лайт';
$_['error_access_mode_2'] = 'Данная функция доступна начиная с версии "Стандарт"';
$_['error_access_mode_3'] = 'Данная функция доступна начиная с версии "Про+"';

