<?php
// Entry
$_['entry_email']				= 'E-mail';
$_['entry_domain']				= 'Домен';
$_['entry_market']				= 'Продавец';
$_['entry_payment_id']			= '№ чека/счета';
$_['entry_license']				= 'Ключ лицензии';

// Help
$_['help_email']				= 'Введите e-mail на который будет отправлен ключ лицензии';
$_['help_domain']				= 'Домен к которому будет привязана лицензия. Можно указать несколько через запятую без пробела';
$_['help_market']				= 'Укажите место, где Вы приобрели расширение';
$_['help_payment_id']			= 'Введите номер чека/счета или другую информацию для идентификации покупки';
$_['help_send']					= 'Отправить данные о покупке';
$_['help_license']				= 'Вставьте ключ и нажмите &laquo;Активировать&raquo; (изображение ключа)';
$_['help_activate']				= 'Активировать';

// Text
$_['text_license_request']		= 'Форма запроса лицензии';
$_['text_license']				= 'Активация лицензии';
$_['text_contacts']				= 'Контакты';
$_['text_success_sent']			= 'Данные о покупке успешно отправлены!';
$_['text_success_activate'] 	= 'Активация прошла успешно!';
$_['text_about_license']		= '<i class="fa fa-list-ol" aria-hidden="true"></i> Порядок активации лицензии:<br/>
<ol>
	<li>Укажите все данные о покупке и нажмите кнопку &laquo;Отправить&raquo;</li>
	<li>После проверки расширение активируется автоматически, а ключ лицензии будет отправлен на указанный электронный адрес</li>
	<li>Если у Вас уже есть ключ активации, то введите его в соответствующее поле и нажмите кнопку &laquo;Активировать&raquo;</li>
</ol>
<p><i class="fa fa-clock-o" aria-hidden="true"></i> Активация лицензии происходит в течении нескольких часов после покупки!</p>
<p><i class="fa fa-info-circle" aria-hidden="true"></i> Чтобы проверить активацию достаточно обновить страницу с настройками расширения!</p>
<p><i class="fa fa-exclamation-triangle" aria-hidden="true"></i> Лицензия предоставляется на 1(один) домен и на любое количество поддоменов или тестовых сайтов!</p>';
$_['text_about_support']		= 'По всем вопросам, которые связаны с работой дополнения обращайтесь по следующим контактам:';
$_['text_support_skype']		= '<a href="skype:oc.max?chat">oc.max</a> (отвечаем быстро, предпочтительный канал связи)';
$_['text_support_email']		= '<a href="mailto:support@oc-max.com">support@oc-max.com</a> (ответ в течении 24-72 часов)';
$_['text_support_site']			= 'oc-max.com';

// Error
$_['error_sent']				= 'Ошибка! Данные о покупке не отправлены!';
$_['error_activate']			= 'Ошибка! Ключ лицензии не верен!';