<?php
// Heading
$_['heading_title'] 	= 'Удаление демонстрационных данных';
// Text
$_['text_extension'] = 'Расширения';
$_['text_success'] = 'Успешно: Вы модифицировали модуль «Удалить демо-данные»!';
$_['text_edit'] = 'Редактировать Удалить модуль содержимого демонстрационных данных';
// Entry
$_['entry_name'] = 'Имя модуля';
$_['entry_title'] = 'Заголовок заголовка';
$_['entry_status'] = 'Статус';
// Error
$_['error_permission'] = 'Внимание: у вас нет прав на изменение модуля!';
$_['error_name'] = 'Имя модуля должно содержать от 3 до 64 символов!';