<?php

// Heading
$_['heading_title']             = 'Поисковая система с морфологией и релевантностью v3.1 <b style="color: #1E91CF">[ <span style="color: yellow">++++</span>]</b>';

// Entry
$_['entry_status']              = 'Статус';
$_['entry_field']               = 'Поле';
$_['entry_join']                = 'JOIN для новой таблицы';
$_['entry_where']               = 'WHERE для новой таблицы';
$_['entry_transliteration']     = 'Транслитерация';
$_['entry_fix_keyboard_layout'] = 'Исправлять раскладку клавиатуры';
$_['entry_inexact_search']      = 'Неточный поиск';
$_['entry_base_search']         = 'Основной поиск';
$_['entry_search_type_order']   = 'Сортировка типов поиска';
$_['entry_search_type']         = 'Тип поиска';
$_['entry_search_type_sort']    = 'Сортировка';
$_['entry_sort_order_stock']    = 'Учитывать наличие на складе';
$_['entry_search_whole_word']   = 'Поиск по целому слову';
$_['entry_fields_name']         = 'Поля';
$_['entry_search']              = 'Где искать';
$_['entry_parts_of_speech_filter']= 'Фильтр по частям речи';
$_['entry_part_of_speech']      = 'Часть речи';
$_['entry_search_logic']        = 'Логика поиска для фраз из нескольких слов';
$_['entry_min_word_length']     = 'Минимальная длина слова для поиска';
$_['entry_cache_results']       = 'Кешировать результаты поиска';
$_['entry_relevance_start']     = 'Вес первого слова';
$_['entry_relevance_end']       = 'Вес последнего слова';
$_['entry_contains']            = 'Поиск по вхождеиню слова';
$_['entry_key']                 = 'Ключ';
$_['entry_exclude_words']       = 'Исключить слова';
$_['entry_synonyms']            = 'Синонимы';
$_['entry_replace_words']       = 'Заменить слова';
$_['entry_multistore']          = 'Мультимагазин';
$_['entry_date_available']      = 'Использовать дату поступления товаров';
$_['entry_progress']            = 'Индексирование';
$_['entry_category']            = 'Категория';
$_['entry_manufacturer']        = 'Производитель';
$_['entry_coefficient']         = 'Коэффициент';

// Text
$_['text_module']               = 'Модули';
$_['text_success']              = 'Модуль удачно обновлен!';
$_['text_success_index']        = 'Индексы созданы!';
$_['text_index_progress']       = 'Выполнено на <b>%.2f%%</b>';
$_['text_edit']                 = 'Ректировать';
$_['text_always']               = 'Всегда';
$_['text_nothing_found']        = 'Когда ничего не найдено';
$_['text_logic_or']             = 'ИЛИ';
$_['text_logic_and']            = 'И';
$_['text_stock_end']            = 'В конце результатов';
$_['text_stock_remove']         = 'Исключить из результатов';
$_['text_confirm']              = 'Вы уверены?';

$_['text_NOUN']                 = 'Существительное	(	телефон	)';
$_['text_ADJ_FULL']             = 'Прилагательное	(	красный	)';
$_['text_ADJ_SHORT']            = 'Краткое прилагательное	(	красива	)';
$_['text_INFINITIVE']           = 'Инфинитив	(	идти	)';
$_['text_VERB']                 = 'Глагол в личной форме	(	идет	)';
$_['text_ADVERB_PARTICIPLE']    = 'Деепричастие	(	идя	)';
$_['text_PARTICIPLE']           = 'Причастие	(	идущий	)';
$_['text_PARTICIPLE_SHORT']     = 'Краткое причастие	(	построена	)';
$_['text_NUMERAL']              = 'Числительное (количественное)	(	восемь	)';
$_['text_NUMERAL_P']            = 'Порядковое числительное	(	восьмой	)';
$_['text_PRONOUN']              = 'Местоимение-существительное	(	он	)';
$_['text_PRONOUN_PREDK']        = 'Местоимение-предикатив	(	нечего	)';
$_['text_PRONOUN_P']            = 'Местоименное прилагательное	(	всякий	)';
$_['text_ADV']                  = 'Наречие	(	круто	)';
$_['text_PREDK']                = 'Предикатив	(	интересно	)';
$_['text_PREP']                 = 'Предлог	(	под	)';
$_['text_CONJ']                 = 'Союз	(	и	)';
$_['text_INTERJ']               = 'Междометие	(	ой	)';
$_['text_PARTICLE']             = 'Частица	(	же, бы	)';
$_['text_INP']                  = 'Вводное слово	(	конечно	)';
$_['text_PHRASE']               = 'Фразеологизм	(	бухты-барахты, зги	)';

// Tabs
$_['tab_general']               = 'Основные настройки';
$_['tab_field']                 = 'Настройки полей';
$_['tab_support']               = 'Поддержка';
$_['tab_exclude_words']         = 'Исключить слова';
$_['tab_synonyms']              = 'Синонимы';
$_['tab_replace_words']         = 'Заменить слова';
$_['tab_add_fields']            = 'Добавить поля';
$_['tab_categories']            = 'Категории';
$_['tab_manufacturers']         = 'Производители';
$_['tab_parts_of_speech']       = 'Части речи';

// Fields
$_['field_pd_name']             = 'Название';
$_['field_pd_description']      = 'Описание';
$_['field_pd_tag']              = 'Теги';
$_['field_pa_text']             = 'Атрибуты';
$_['field_p_model']             = 'Модель';
$_['field_p_sku']               = 'SKU';
$_['field_p_upc']               = 'UPC';
$_['field_p_ean']               = 'EAN';
$_['field_p_jan']               = 'JAN';
$_['field_p_isbn']              = 'ISBN';
$_['field_p_mpn']               = 'MPN';

// Buttons
$_['button_add']                = 'Создать индексы';
$_['button_delete']             = 'Удалить все индексы';
$_['button_stop_hide']          = 'Остановить / Скрыть';
$_['button_category_add']       = 'Добавить категорию';
$_['button_manufacturer_add']   = 'Добавить производителя';

// Error
$_['error_permission']          = 'Внимание: Вы не имеете права модифицировать модуль Поисковая система с морфологией и релевантностью!';
$_['error_field']               = 'Новое поле для поиска не может быть пустым';
$_['error_warning']             = 'Внимательно проверьте форму на ошибки!';

// Help
$_['help_tab_general'] = '';
$_['help_tab_field'] = 'Помощь:<br/>
    <ul>
      <li>после изменения настроек нужно обновить идексы</li>
      <li>веса слов рассчитываются пропорционально от первого к последнему, чем ближе слово к началу тем больше у него вес</li>
      <li>вес последнего слова обычно должен быть меньше веса первого</li>
      <li>поиск по вхождению желатаельно использовать для небольших полей (модель, артикул..), для больших полей таких как описание товара это значительно увеличит размер индекса и скажется на скорости поиска</li>			
    </ul>';
$_['help_tab_synonyms'] = 'Каждая группа синонимов в новой строке, разделитель слов - пробел. Например: телефон смартфон';    
$_['help_tab_exclude_words'] = 'Одно слово или несколько слов (для исключения фразы) на строку';
$_['help_tab_replace_words'] = 'Одна пара слов или фраз на строку, слова в паре разделены пробелом или символом | для фраз. Например: aple apple или big aple|big apple';
$_['help_tab_add_fields'] = 'Помощь:<br/>
    <ul>
      <li><b>Поле:</b> поле, по которому Вы хотите осуществлять поиск, например: p.product_id, pd.meta_title, pa.text и т.д.</li>
      <li><b>JOIN для новой таблицы: </b> SQL код для добавления новой таблицы, например: "LEFT JOIN oc_product_attribute pa ON (p.product_id=pa.product_id)" <br />
			  Вот перечень полей, которые уже используются в модуле, их не нужно добавлять:
				<ul>
				  <li>product p</li>
					<li>product_description pd</li>
					<li>product_attribute pa (если включен поиск по атрибутам)</li>
				  <li>category_path cp (если включено искать в подкатегориях)</li>
					<li>product_to_category p2c (если включено искать в категории)</li>
					<li>product_to_store p2s</li>
				</ul>
			</li>
			<li><b>WHERE для новой таблицы: </b> SQL код для условия WHERE для новой таблицы, например: "pa.language_id = pd.language_id"</li>
			<li>После добавления нового поля сохраните настройки и измените настройки для этого поля во вкладке "Настройки полей"</li>
    </ul>';
$_['help_tab_categories'] = 'Помощь:<br/>
    <ul>
      <li>После изменения настроек нужно обновить идексы</li>
      <li>Коэффициентом может быть как дробное число, напр.: 0.3 или 1.2 так и целое, напр.: 2 </li>
			<li>Веса каждого товара в этой категории или производителя будут умножаться на этот коэффициент</li>
      <li>Если указать коэффициент - 0 то товары из этой категории совсем не попадут в индекс</li>
      <li>Если указать коэффициент - 1 то он никак не повлияет на вес слов и результат поиска, так как любое число при умножении на 1 дает то же самое число</li>
      <li>Если у одного товара есть более одной категории с коэффициентами то будет браться тот, который больше</li>
      <li>Если у одного товара есть и категория с коэффициентом и производитель то их коэффициенты будут умножаться</li>
    </ul>';

$_['help_tab_parts_of_speech'] = 'Помощь:<br/>
    <ul>
      <li>Для тех полей, где включен фильтр по части речи, веса всех слов этой части речи будут умножаться на этот коэффициент</li>
      <li>После изменения настроек нужно обновить идексы</li>
      <li>Коэффициентом может быть как дробное число, напр.: 0.3 или 1.2 так и целое, напр.: 2 </li>
      <li>Если указать коэффициент - 0 то слова этой части речи совсем не попадут в индекс</li>
      <li>Если указать коэффициент - 1 то слово попадет в индекс без изменения веса</li>
      <li>Работает только для русского языка</li>
    </ul>';

$_['help_transliteration']     = 'Использовать транслитерацию: аппле -> apple';    
$_['help_fix_keyboard_layout'] = 'Исправлять неправильную раскладку клавиатуры, например: yjen,er->ноутбук';
$_['help_inexact_search']      = 'Поиск с опечатками и грамматическими ошибками. Нужно обновить индексы после включения';
$_['help_search_type_order']   = 'Новый тип поиска запускается когда предыдущий ничего не нашел';
$_['help_sort_order_stock']    = 'Товары, которых нет в наличии будут отображаться последними или исключены из результатов';
$_['help_search_whole_word']   = 'Кроме поиска по корням слов будет осуществляться также поиск по точному совпадению слова. Это увеличит точность поиска и релевантности но также увеличит размер и скорость создания индексов и может повлиять на скорость поиска. Нужно обновить индексы после изменения';

$_['help_support'] = '
<br />
<b>Если у вас возникли проблемы с установкой или использованием этого модуля, то вы можете:</b>
<ul>
  <li>Написать мне на <a href="mailto:sv2109@gmail.com?subject=Search Engine module">sv2109@gmail.com</a></li>
  <li>Создать тикет на <a href="http://sv2109.com/ru/tickets">http://sv2109.com/ru/tickets</a></li>
  <li>Написать комментарий на странице модуля</li>
</ul>
<br/>
<b>Вы так же можете ко мне обратиться если:</b>
<ul>
  <li>вам нужна помощь с вашим OpenCart-ом</li>
  <li>вам нужно создать любой другой модуль для OpenCart</li> 
</ul>
<br/>
<div style="font-size: 150%;">Другие полезные модули вы можете найти <a href="http://sv2109.com/ru/modules">тут</a>:</div>
<br/>
<a href="http://sv2109.com/ru/modules"><img src="http://sv2109.com/i/ssb.png" alt=""><img src="http://sv2109.com/i/srb.png" alt=""><img src="http://sv2109.com/i/isb.png" alt=""><img src="http://sv2109.com/i/fcsb.png" alt="">
<br/><img src="http://sv2109.com/i/acb.png" alt=""><img src="http://sv2109.com/i/asb.png" alt=""><img src="http://sv2109.com/i/iocb.png" alt=""><img src="http://sv2109.com/i/tab.png" alt=""></a>
';

