<?php
// Heading
$_['heading_title'] = '<img width="24" height="24" src="view/image/neoseo.png" style="float: left;"><span style="margin:0; line-height: 24px;">NeoSeo Обмін з 1C</span>';
$_['heading_title_raw'] = 'NeoSeo Обмін з 1C';

// Tabs
$_['tab_general'] = 'Параметри';
$_['tab_logs'] = 'Логи';
$_['tab_product'] = 'Товари';
$_['tab_price'] = 'Ціни';
$_['tab_quantity'] = 'Залишки';
$_['tab_category'] = 'Категорії';
$_['tab_manufacturer'] = 'Виробники';
$_['tab_attribute'] = 'Атрибути';
$_['tab_option'] = 'Опції';
$_['tab_order'] = 'Замовлення';
$_['tab_support'] = 'Підтримка';
$_['tab_license'] = 'Ліцензія';
$_['tab_filter'] = 'Фільтр';
$_['tab_counterparties'] = 'Покупці';

//Buttons
$_['button_insert'] = 'Додати';
$_['button_import'] = 'Імпорт';
$_['button_export'] = 'Завантажити замовлення';
$_['button_export_product'] = 'Завантажити товари';
$_['button_save'] = 'Зберегти';
$_['button_save_and_close'] = 'Зберегти та Закрити';
$_['button_close'] = 'Закрити';
$_['button_recheck'] = 'Перевірити ще раз';
$_['button_clear_log'] = 'Очистити логі';
$_['button_download_log'] = 'Завантажити файл логів';
$_['button_delete_orders'] = 'Видалити замовлення';
$_['button_delete_categories'] = 'Видалити категорії';
$_['button_delete_manufacturers'] = 'Видалити виробників';
$_['button_delete_products'] = 'Видалити товари';
$_['button_delete_1c_products'] = 'Видалити тільки 1С товари';
$_['button_delete_products_warehouses'] = 'Видалити залишки за складами';
$_['button_delete_attributes'] = 'Видалити атрибути';
$_['button_delete_options'] = 'Видалити опції';
$_['button_delete_links'] = 'Видалити зв\'язки';
$_['button_delete_export_list_orders'] = 'Очистити позначки про розвантаження замовлень';
$_['button_upload'] = 'Завантажити';
$_['button_exchange_control'] = 'Прибрати позначку. Обмін іде ';
$_['button_exchange_control_minut'] = 'хвилин';
$_['button_exchange_control_wait'] = 'Чекаємо обмін';

// Text
$_['text_module'] = 'Модулі';
$_['text_success'] = 'Налаштування модуля оновлено!';
$_['text_import_warning'] = 'Імпорт може забрати тривалий час';
$_['text_upload_success'] = 'Імпорт завершено';
$_['text_upload_error'] = 'Щось пішло не так. Загляньте в логі';
$_['text_max_filesize'] = 'Файл, що завантажується, не повинен перевищувати %s Мб';
$_['text_success_clear'] = 'Логи успішно очищені';
$_['text_bynone'] = 'Вимкнено';
$_['text_bysku'] = 'По артикулу';
$_['text_byname'] = 'По артикулу, потім по імені';
$_['text_bymodel'] = 'По артикулу в моделі';
$_['text_byupc'] = 'За кодом UPC';
$_['text_bycode'] = 'За внутрішнім кодом 1с';
$_['text_bycode_name'] = 'За кодом 1с (тег Код), потім по імені';
$_['text_byean'] = 'По штрих-коду в моделі';
$_['text_bymodel_name'] = 'По артикулу в моделі, потім на ім\'я';
$_['text_byproduct_id_offer_id'] = 'По product_id магазину та offerID від 1С, потім на ім\'я';
$_['text_disable_out_of_stock'] = 'Відсутні';
$_['text_disable_out_of_stock_null_price'] = 'Відсутні та з нульовою ціною';
$_['text_disable_out_of_stock_without_images'] = 'Відсутні та без основного зображення';
$_['text_disable_null_price'] = 'З нульовою ціною';
$_['text_disable_without_images'] = 'Без основного зображення';
$_['text_disable_null_quantity'] = 'З нульовим залишком';
$_['text_order_export_exchange1c'] = 'Вивантажити замовлення в 1С:';
$_['text_order_export_exchange1c_status_yes'] = 'Замовлення буде вивантажено в 1С';
$_['text_order_export_exchange1c_status_not'] = 'Замовлення не буде вивантажуватися в 1С';
$_['text_export_status'] = 'За статусом';
$_['text_export_mark'] = 'По мітці на замовлення';
$_['text_cleaned'] = 'Очищено';
$_['text_err_cleaned'] = 'Мітки вже очищені';
$_['text_success'] = 'Налаштування модуля оновлено!';
$_['text_module'] = 'Модулі';
$_['text_option_type_select'] = 'Випадаючий список';
$_['text_option_type_radio'] = 'Перемикач';
$_['text_price_default'] = 'Ціна на сайті';
$_['text_transaction_always'] = 'Завжди';
$_['text_transaction_change'] = 'Якщо сума або дата оплати змінено';
$_['text_tools'] = '
<p>Якщо ви з якоїсь причини не можете завантажити дані безпосередньо через посилання, ви все ще можете зробити це вручну.</p>
    <p>Вам знадобиться архів, який формує 1c, або можете завантажити файли import.xml і offers.xml. Порядок дуже важливий, оскільки товари створюються під час навантаження файлу import.xml, а на offers.xml вже оновлюються залишки та ціни</p>
';
$_['text_setting_price_type'] = 'Налаштування основної ціни та знижок товару';
$_['text_setting_special_price_type'] = 'Налаштування акційних цін товару';
$_['text_setting_cprice_type'] = 'Налаштування довільних цін товару';
$_['text_neoseo_filter'] = 'NeoSeo Фільтр';
$_['text_ocfilter'] = 'OcFilter';
$_['text_filter'] = 'Стандартний фільтр';

$_['text_counterparties_method_phone'] = "За номером телефону";
$_['text_counterparties_method_email'] = "По e-mail";
$_['text_counterparties_fio'] = "По П.І.Б.";
$_['text_counterparties_mixed'] = "За номером телефону, потім e-mail, заетм П.І.Б.";
$_['text_counterparties_delete'] = "Видалити покупців, отриманих з 1С";
$_['text_counterparties_delete_links'] = "Видалити зв'язки покупців з 1С";
$_['text_counterparties_download'] = "Завантажити покупців";
$_['text_comma'] = "Кома";
$_['text_dot'] = "Крапка";

$_['text_setting_option_discount_price_type'] = 'Налаштування знижкових цін опцій товару';
$_['text_setting_option_discount_price_type_desc'] = '<span style="color:red">Увага! Знижкові ціни опцій на даний момент можна використовувати лише за наявності модуля "Пов\'язані опції"</span><br>';

// Entry
$_['entry_seo_url_field'] = 'Оновлювати ЧПУ товару';
$_['entry_seo_url_field_desc'] = 'Вкажіть назву якості з файлу обміну';
$_['entry_update_related_products'] = 'Оновлювати супутні товари';
$_['entry_update_related_products_desc'] = 'Значення «Супутні товари» має бути у властивостях товару. Задається через «;», Приклад «А001; 12548; СМ001» ';
$_['entry_update_related_products_mode'] = 'За яким параметром вибирати товар для супутніх товарів';
$_['entry_use_tree_delete'] = 'Деревовидне видалення зображень';
$_['entry_use_tree_delete_desc'] = 'Увімкніть тільки якщо на вашому хостингу є проблема зі збереженням зображень з 1С і якщо є повне розвантаження картинок';
$_['entry_order_manufacturer'] = 'Вивантажувати виробника на замовлення:';
$_['entry_status'] = 'Статус:';
$_['entry_debug'] = 'Налагодження:';
$_['entry_sql_before'] = 'SQL до обробки залишків:';
$_['entry_sql_before_desc'] = 'Якщо у вас є якась специфічна логіка оновлення бази перед імпортом даних із 1с - ви можете реалізувати її за допомогою серії SQL запитів, розділених крапкою з комою - ";"';
$_['entry_sql_after'] = 'SQL після обробки залишків:';
$_['entry_sql_after_desc'] = 'Якщо у вас є якась специфічна логіка оновлення бази після імпорту даних із 1с - ви можете реалізувати її за допомогою серії SQL запитів, розділених точкою з комою - ";"';
$_['entry_username'] = 'Логін:';
$_['entry_password'] = 'Пароль:';
$_['entry_price_name'] = 'Назва ціни:';
$_['entry_price_name_desc'] = '1С вивантажує кілька цін по товару, ви можете вказати, яку саме використовувати. Залиште поле порожнім, щоб взяти першу за списком.';
$_['entry_update_attribute'] = 'Оновлювати атрибути товарів:';
$_['entry_update_attribute_desc'] = 'Вимкніть, якщо вам взагалі не потрібні атрибути товару з 1с';
$_['entry_update_attribute_group'] = 'Оновлювати групи атрибутів';
$_['entry_update_attribute_group_desc'] = 'Вимкніть, якщо хочете, щоб усі аттрибути потрапляли до Загальних';
$_['entry_attribute_group_prefix'] = 'Символ для розділення групи та атрибута';
$_['entry_attribute_group_prefix_desc'] = 'Символ, з 1С який поділяє групу та аттрибут, для прикладу Загальні.ширина, де роздільником є точка';
$_['entry_update_price'] = 'Оновлювати ціни:';
$_['entry_update_price_desc'] = 'Вимкніть, якщо вам не потрібні ціни з 1с';
$_['entry_update_currency_plus'] = 'Перелічити ціни всіх товарів:';
$_['entry_update_currency_plus_desc'] = 'Якщо необхідно використовувати модуль Валюта Плюс, увімкніть цю опцію і після обміну буде викликано функцію перерахунку цін у всіх товарах';
$_['entry_new_price_column'] = 'Вкажіть нове поле для основної ціни в таблиці';
$_['entry_new_price_column_desc'] = 'Наприклад, baseprice - ім\'я поля в таблиці товарів, основна ціна буде додана в дане поле, основна ціна оновлюватися не буде.';
$_['entry_update_quantity'] = 'Оновлювати залишки:';
$_['entry_update_quantity_desc'] = 'Вимкніть, якщо вам не потрібні залишки з 1с';
$_['entry_update_images'] = 'Оновлювати зображення:';
$_['entry_update_images_desc'] = 'Вимкніть, якщо вам не потрібні зображення товару з 1с';
$_['entry_update_additional_images'] = 'Обновити лише основне зображення:';
$_['entry_update_additional_images_desc'] = 'Вимкніть, якщо вам потрібно оновлювати і додаткові зображення товару з 1с';
$_['entry_update_categories'] = 'Оновлювати категорії товарів:';
$_['entry_update_categories_desc'] = 'Вимкніть, якщо вам не потрібна прив\'язка товару до категорій з 1с. У цьому випадку нові товари будуть створені без прив\'язки до категорій взагалі';
$_['entry_create_product'] = 'Додавати нові товари:';
$_['entry_create_product_desc'] = 'Вимкніть, якщо вам потрібна синхронізація залишків і цін або тільки за наявними в магазині товарами';
$_['entry_product_status'] = 'Початковий статус нових товарів';
$_['entry_product_status_desc'] = 'Якщо потрібна додаткова обробка товарів, що прийшли з 1с, то вимкніть';
$_['entry_disable_missing'] = 'Вимкнути товари';
$_['entry_disable_missing_desc'] = 'Відключати товари, які відповідають вибраним параметрам. І навпаки, включати ті товари, які не відповідають';
$_['entry_disable_missing_tag'] = 'Вимкнути товари за окремим тегом';
$_['entry_disable_missing_tag_desc'] = 'Відключати товар за спеціальним, окремим тегом. Якщо цей тег має значення false тоді товар буде вимкнено.';
$_['entry_ip_list'] = 'Дозволені IP адреси';
$_['entry_ip_list_desc'] = 'Список IP-адрес, з яких можна звертатися до вашої синхронізації. Кожна адреса з нового рядка. Порожній список - без обмежень.';
$_['entry_fill_parent_cats'] = 'Заповнювати батьківські категорії:';
$_['entry_fill_parent_cats_desc'] = 'Якщо включено, то товару будуть призначені всі категорії від поточної до кореневої. Інакше буде встановлено лише категорію найнижчого рівня';
$_['entry_update_parent_cats'] = 'Оновлювати зв\'язок батьківських категорій:';
$_['entry_update_parent_cats_desc'] = 'Якщо включено, то буде перевірено для кожної категорії її актуальність прив\'язки до батьківської категорії. Якщо 1С змінилася вкладеність категорій, то магазині так само синхронізовані категорії змінять свій порядок';
$_['entry_order_statuses'] = 'Вивантажувати замовлення зі статусом:';
$_['entry_final_order_status'] = 'Статус вивантажених замовлень:';
$_['entry_order_status_notify'] = 'Повідомляти користувачів про зміну статусу:';
$_['entry_flush_product'] = 'Скидати товари:';
$_['entry_flush_category'] = 'Скидати категорії:';
$_['entry_flush_manufacturer'] = 'Скидати виробників:';
$_['entry_flush_quantity'] = 'Скидати кількість товарів:';
$_['entry_flush_attribute'] = 'Скидати атрибути:';
$_['entry_order_date'] = 'Останній обмін:';
$_['entry_link'] = 'Посилання для обміну:';
$_['entry_no_address'] = 'Вимкнути передачу адреси:';
$_['entry_no_address_desc'] = 'Вимкнути передачу адреси при розвантаженні замовлень';
$_['entry_cron_command'] = 'Команда для запуску через планувальник (cron)';
$_['entry_cron_command_desc'] = '1C повинна сама розміщувати файли обміну offers.xml,import.xml,order.xml - до директорії system/upload/exchange1C';
$_['entry_lookup_product'] = 'Синхронізація товарів';
$_['entry_lookup_product_desc'] = 'Рекомендується синхронізувати лише за артикулом';
$_['entry_multy_currency'] = 'Вивантаження для модуля Мультивалютні товари';
$_['entry_multy_currency_price'] = 'Оновлювати звичайну ціну (якщо опція Мультивалютні товари включена)';
$_['entry_ignore_table_quantities'] = 'Ігнорувати кількість у таблиці та брати кількість із цін пропозицій';
$_['entry_ignore_table_quantities_desc'] = 'Для розвантаження використовується тег ЗнижкаКількість';
$_['entry_create_category'] = 'Додавати нові категорії';
$_['entry_create_category_desc'] = 'Вимкніть, якщо вам потрібні лише ті категорії, що вже занесені до магазину';
$_['entry_category_status'] = 'Початковий статус нових категорій';
$_['entry_category_status_desc'] = 'Вимкніть, якщо потрібна попередня обробка нових категорій';
$_['entry_category_top_status'] = 'Додавати нові категорії в меню';
$_['entry_category_top_status_desc'] = 'Увімкніть, якщо хочете, щоб усі нові категорії автоматично відображалися в меню';
$_['entry_category_update_name'] = 'Оновлювати назву категорій';
$_['entry_category_update_name_desc'] = 'Вимкніть, якщо немає потреби в синхронізації назв категорій з 1с';
$_['entry_create_attribute'] = 'Додавати нові атрибути';
$_['entry_create_attribute_desc'] = 'Вимкніть, якщо вам потрібні тільки атрибути, що вже занесені в магазин';
$_['entry_create_manufacturer'] = 'Додавати нових виробників';
$_['entry_create_manufacturer_desc'] = 'Вимкніть, якщо вам потрібні ті виробники, що вже занесені в магазин';
$_['entry_add_manufacturer_to_attribute'] = 'Записувати дані виробника в атрибути';
$_['entry_add_manufacturer_to_attribute_desc'] = 'При включенні дані про виробника будуть дублюватися в атрибути';
$_['entry_alternative_manufacturer_tag'] = 'Альтернативний тег для даних про виробника';
$_['entry_alternative_manufacturer_tag_desc'] = 'Залишити порожнім, щоб використовувати стандартні "виробник\виробник". Замінює стандартні.<br>Шукає як тег і як найменування в реквізитах.';

$_['entry_customer_phone'] = 'Додавати телефон до імені клієнта';
$_['entry_customer_phone_desc'] = 'Якщо не додати, то в 1с буде створено 1 Олександр на всі замовлення по Олександрах, які не вказали прізвище';
$_['entry_order_currency'] = 'Валюта замовлення:';
$_['entry_order_currency_desc'] = 'Вкажіть позначення вашої валюти згідно з налаштуваннями в 1с';
$_['entry_update_name'] = 'Оновлювати найменування:';
$_['entry_update_name_desc'] = 'Вимкніть, якщо найменування вам потрібне тільки при створенні товару, а далі ви редагуватимете його в самому магазині';
$_['entry_update_description'] = 'Оновлювати опис:';
$_['entry_update_description_desc'] = 'Вимкніть, якщо опис вам потрібний тільки при створенні товару, а далі ви редагуватимете його в самому магазині';
$_['entry_category_links'] = 'Зв\'язки між категоріями';
$_['entry_category_links_desc'] = 'Якщо вам потрібно, щоб категорія 1с відповідала кільком категоріям у магазині або ж вам потрібно, щоб категорія 1с з одним ім\'ям, відповідала категорії магазину з іншим - ви можете задати правила в цьому полі<br>Формат:< <br>ліжка : Меблі \ Меблі дитячі \ ліжка<br>ножиці : Канцтовари для школи \ Ножиці; Канцтовари для офісу \ Ножиці';
$_['entry_create_option'] = 'Додавати нові опції';
$_['entry_update_option_images'] = 'Оновлювати/додавати зображення для опцій';
$_['entry_update_option_images_desc'] = 'Завантажує або оновлює зображення для товару у зв\'язці з опцією. Ця опція працює тільки з файлом offers.xml, а також у таблиці product_option_value має бути поле image. У файлі offers.xml має бути властивість Пропозиції->Пропозиція->Малюнок';
$_['entry_create_option_desc'] = 'Вимкніть, якщо вам потрібні ті властивості, що вже занесені в магазин';
$_['entry_update_option'] = 'Оновлювати опції у товарів';
$_['entry_update_option_desc'] = 'Вимкніть, якщо вам взагалі не потрібні властивості товару з 1с';
$_['entry_order_utf8'] = 'Вивантаження в UTF-8:';
$_['entry_order_utf8_desc'] = 'Старі системи розуміють тільки win1251, новим потрібно ставити utf8';
$_['entry_order_status_notify'] = 'Повідомити покупця:';
$_['entry_order_status_notify_desc'] = 'Повідомити покупця про зміну статусу замовлення';
$_['entry_order_status_override'] = 'Ігнорувати:';
$_['entry_order_status_override_desc'] = 'Включити ігнорування, якщо статус замовлення було автоматично змінено системою Anti-Fraud';
$_['entry_model_in_id'] = 'Виводити в ІД товару значення поля Модель:';
$_['entry_model_in_id_desc'] = 'Увімкніть, якщо необхідно замінити значення ІД 1с товару на значення з поля Модель';
$_['entry_transaction_status'] = 'Додавати транзакції до замовлення:';
$_['entry_final_list_order_statuses'] = 'Відповідність статусів у магазині після вивантаження в 1С';
$_['entry_final_list_order_statuses_desc'] = 'Вкажіть відповідність статусів замовлення після вивантаження замовлення в 1с (Скасує пункт "Статус вивантажених замовлень"). Якщо поле порожнє – вимкнено. Ліворуч - до вивантаження, праворуч - після <br> <b>Приклад:</b> <br>Чекаємо на оплату = Резервування <br> Оплачено = В обробці';
$_['entry_extra_document_tag'] = 'Вивантажувати додатковий тег у Документ';
$_['entry_extra_document_tag_desc'] = 'Вкажіть <b>Тег;Таблиця БД;Поле</b>, якщо потрібно вивантажувати додаткові теги в тег <b>Добкумент</b>, де <b>Тег</b> - назва тега, який буде поміщений у тег Добкумент, <b>Таблиця БД</b> - таблиця з якої буде взято поле <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля order_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> roistat;oc_order;roistat_visit';
$_['entry_extra_customer'] = 'Вивантажувати розширені дані щодо покупця';
$_['entry_extra_customer_desc'] = 'Вкажіть <b>Тег;Таблиця БД;Поле</b>, якщо потрібно вивантажувати додаткові теги в тег <b>Контрагент</b>, де <b>Тег</b> - назва тега, який буде поміщений у тег Адреса, <b>Таблиця БД</b> - таблиця з якої буде взято поле <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля customer_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> Пол;oc_customer_simple_fields;gender';
$_['entry_extra_address'] = "Вивантажувати розширену адресу";
$_['entry_extra_address_desc'] = 'За замовчуванням адреса вивантажується одним рядком. Вкажіть <b>Тег;Таблиця БД;Поле</b>, якщо потрібно вивантажувати розширену адресу, де <b>Тег</b> - назва тега, який буде поміщений у тег Адреса, <b>Таблиця БД</b> - таблиця з якої буде взято поле, <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля order_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> Індекс;oc_order;shipping_postcode<br> Вулиця;oc_order_simple_fields;shipping_address_street';
$_['entry_extra_property'] = "Довільні значення в тезі 'Значення Реквізитів'";
$_['entry_product_extra_property'] = "Вивантажувати розширені дані щодо товару";
$_['entry_extra_property_desc'] = 'Якщо в замовленні Вам потрібно вивантажувати довільні значення реквізитів, вкажіть <b>Назва;Таблиця БД;Поле</b>, якщо потрібно вивантажувати розширену адресу, де <b>Назва</b> - Назва ЗначенняРеквізиту, який буде поміщений у тег Адреса, <b>Таблиця БД</b> - таблиця з якої буде взято поле, <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля order_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> Індекс;oc_order;shipping_postcode<br> Вулиця;oc_order_simple_fields;shipping_address_street';
$_['entry_product_extra_property_desc'] = 'Якщо в замовленні Вам потрібно вивантажувати додаткові дані по товару, вкажіть <b>Назва;Таблиця БД;Поле</b>, якщо потрібно вивантажувати додаткові дані, де <b>Назва</b> - назва тега, який буде поміщений у тег Товар, <b>Таблиця БД</b> - таблиця з якої буде взято поле, <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля order_product_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> ЗнижкаПроцент;oc_order_product;discount_percent';
$_['entry_order_status_marge_list'] = 'Відповідність статусів сайту та 1с';
$_['entry_order_status_marge_list_desc'] = 'Вкажіть відповідність статусу замовлення до статусу 1с. Ліворуч - сайт, праворуч - 1с <b>Приклад:</b> <br> Угода завершена = Угода виконана <br> В обробці = В роботі';
$_['entry_product_subtract'] = 'Відняти від складу:';
$_['entry_product_subtract_desc'] = 'Це значення буде використано під час створення нових продуктів у процесі обміну';
$_['entry_product_fullname'] = 'Використовувати повне найменування:';
$_['entry_product_fullname_desc'] = 'Якщо включено, то для назви товару буде використовуватися його атрибут Повне Найменування у разі його наявності';
$_['entry_product_fulldescription'] = 'Опис товару брати з поля повне найменування:';
$_['entry_product_fulldescription_desc'] = 'Якщо включено, то для опису товару буде використовуватися його атрибут Повне Найменування у разі його наявності';
$_['entry_product_dimension'] = 'Оновлювати Розміри (Д x Ш x В):';
$_['entry_product_dimension_desc'] = 'Якщо включено, то Розміри (Д x Ш x В) з властивостей товару будуть записані у відповідні поля у картці товару, інакше будуть записані в атрибути товару';
$_['entry_product_export_model_to_sku'] = 'Вивантажувати в 1с модель як артикль';
$_['entry_product_export_model_to_sku_desc'] = 'Якщо включено, при розвантаженні товарів в 1с, артикль буде братися з поля модель';
$_['entry_use_warehouse'] = 'Використовувати склади:';
$_['entry_use_warehouse_desc'] = 'Якщо включено, інформація про склади та залишки товарів за ними підтягуватиметься з файлу offers.xml';
$_['entry_main_warehouse'] = 'Основний склад:';
$_['entry_main_warehouse_desc'] = 'Якщо вказати назву складу, то як залишок по товару використовуватиметься не загальний залишок, а залишок за вказаним складом';
$_['entry_use_related_options'] = 'Використовувати зв\'язкові опції:';
$_['entry_use_related_options_desc'] = 'Якщо в 1с використовується 2 і більше опції на товар, це єдиний спосіб правильно прийняти дані з offers.xml. Модуль зв\'язкових опцій має бути встановлений. <br>Підтримуються наступні модулі зв\'язкових опцій: <br>Related options,NeoSeo Product options PRO, Комбінації опцій';
$_['entry_ignore_attributes'] = "Виключати атрибути";
$_['entry_ignore_attributes_desc'] = "Список атрибутів для виключення. Кожен атрибут на окремому рядку";
$_['entry_unit_field'] = 'Поле Товар/ОдиницяВимірювання';
$_['entry_unit_field_desc'] = 'Куди писати поле Товар/ОдиницяВимірювання, якщо воно буде знайдено у файлі обміну. Варіанти – mpn, upc, ean тощо. Якщо хочете записувати, залиште поле порожнім';
$_['entry_order_customer'] = 'Покупець';
$_['entry_order_customer_desc'] = 'Якщо заповнено, всі замовлення будуть вивантажуватися під цим покупцем';
$_['entry_code_field'] = 'Поле Товар/Код';
$_['entry_code_field_desc'] = 'Куди писати поле Товар/Код, якщо воно буде знайдено у файлі обміну. Варіанти – mpn, upc, ean тощо. Якщо хочете записувати, залиште поле порожнім';
$_['entry_barcode_field'] = 'Поле Товар/ШтрихКод';
$_['entry_barcode_field_desc'] = 'Куди писати Товар/ШтрихКод, якщо воно буде знайдено у файлі обміну. Варіанти – mpn, upc, ean тощо. Якщо хочете записувати, залиште поле порожнім';
$_['entry_update_sku'] = 'Оновлювати артикул';
$_['entry_update_sku_desc'] = 'Корисно для синхронних змін з 1с';
$_['entry_option_price'] = 'Ціна опції';
$_['entry_option_price_desc'] = 'Якщо залишити ціну опцій як є, то треба ставити спеціальний модуль для опцій, який правильно оброблятиме їх ціну';
$_['text_default'] = 'Як є';
$_['text_product_min'] = 'Продукту мінімальну ціну, опції плюсом до неї';
$_['text_product_max'] = 'Продукту максимальну ціну, опції мінусом до неї';
$_['entry_delete_zero_option'] = 'Видалення нульових опцій';
$_['entry_delete_zero_option_desc'] = 'Якщо після обміну частина опцій отримають нульовий залишок, вони будуть видалені, щоб не заважати на сайті';
$_['entry_product_stock_status'] = 'Початковий статус наявності нових товарів:';
$_['entry_product_stock_status_desc'] = 'Вкажіть статус наявності, який потрібно виставляти створеним продуктам';
$_['entry_special_group_id'] = 'Група покупців для акційної ціни';
$_['entry_price_special'] = 'Акційна ціна';
$_['entry_price_special_desc'] = 'Якщо поле заповнене, то по всіх товарах в обміні очищується список акцій. Якщо товару вказано акційну ціну, то товару буде встановлено безстрокову акцію на цю ціну, а ціни опцій будуть вирівняні за ціною акції';
$_['entry_order_export_type'] = 'Як вибирати замовлення для розвантаження';
$_['entry_product_languages'] = 'Оновлювати опис та назву товарів мовою:';
$_['entry_product_languages_desc'] = 'Якщо залишити порожнім - оновлюватимуться всі мови';
$_['entry_product_tags_languages'] = 'Обновлять мета-теги товаров на языке:';
$_['entry_product_tags_languages_desc'] = 'Если оставить пустым - будут обновлятся все языки';
$_['entry_category_languages'] = 'Оновлювати назву категорій мовою:';
$_['entry_category_languages_desc'] = 'Якщо залишити порожнім - оновлюватимуться всі мови';
$_['entry_forbidden_options'] = 'Не завантажувати опції';
$_['entry_forbidden_options_desc'] = 'Введіть назви опцій, які потрібно виключити з вивантаження, кожна опція з нового рядка';
$_['entry_category_forced'] = 'Примусово вивантажувати у певну категорію';
$_['entry_category_forced_id'] = 'Категорія для примусового розвантаження';

$_['entry_limit_orders'] = 'Ліміт замовлень на одну синхронізацію';
$_['entry_limit_orders_desc'] = '0 = без обмеження (всі замовлення).<br><b>Увага!</b> Якщо "Статус вивантажених замовлень" буде у списку "Вивантажувати замовлення зі статусом" - Замовлення не лімітуються, виберіть тип вивантаження - за мітками';
$_['entry_sync_missing_status'] = 'Спец. Тег для статусу, якщо товару немає на складі';
$_['entry_sync_missing_status_desc'] = 'Вкажіть ім\'я тега, який відповідає за значення статусу товару якого немає в наявності. Можуть бути використані властивості товару або окремий тег.<br> Залиште поле порожнім, якщо Вам не потрібно враховувати статус відсутності товару.';
$_['entry_default_missing_status'] = 'Статус за замовчуванням для товарів яких немає';
$_['entry_default_missing_status_desc'] = 'Статус встановлюється якщо є спец. тег для статусів';
$_['entry_order_shipping_links'] = 'Вивантаження методів доставки';
$_['entry_order_shipping_links_desc'] = 'Вкажіть відповідність методів доставки до номенклатури 1с. Якщо приватна відповідність не буде знайдена, то використовуватиметься загальне по shipping у секції вивантаження підсумків замовлення<br><b>Приклад:</b><br>dostavkaplus.sh1 = 0000-0000-1111<br>dostavkaplus.sh2 = 0000 -0000-2222 ';
$_['entry_order_payment_links'] = 'Вивантаження методів оплати';
$_['entry_order_payment_links_desc'] = 'Вкажіть відповідність методів оплати до номенклатури 1с. Якщо приватна відповідність не буде знайдена, то використовуватиметься загальна за payment у секції вивантаження підсумків замовлення<br><b>Приклад:</b><br>paymentplus.sh1 = 0000-0000-1111<br>paymentplus.sh2 = 0000 -0000-2222 ';
$_['entry_order_utf8_bom'] = 'Додати BOM до UTF-8 кодування';
$_['entry_order_total_links'] = 'Вивантаження результатів замовлення';
$_['entry_order_total_links_desc'] = 'Вкажіть відповідність підсумків замовлення (сертифікати, купони, доставка) до номенклатури 1с. Для вказівки загальної відповідності з доставки використовується код shipping<br><b>Приклад:</b><br>shipping = 0000-0000-3333<br>coupon = 0000-0000-4444';
$_['entry_config_price_type'] = 'Тип ціни, що вивантажується:';
$_['entry_customer_group'] = 'Група покупців:';
$_['entry_quantity'] = 'Кількість:';
$_['entry_priority'] = 'Пріоритет:';

$_['entry_currency_convertor'] = 'Конвертувати валюти:';
$_['entry_currency_convertor_desc'] = 'Якщо валюта пропозиції буде відповідати одній зі списку, то вона буде автоматично сконвертована за курсом валют у магазині.<br><b>Приклад</b> списку відповідностей:<br>Руб:RUB, Дол:USD';
$_['entry_currency_convertor_multy'] = 'Вкажіть коди валюти для модуля Мультивалюти:';
$_['entry_currency_convertor_multy_desc'] = '<br><b>Приклад</b> списку відповідностей:<br>Руб:RUB,Дол:USD';

$_['entry_enable_zip'] = 'Вимагати архів:';
$_['entry_enable_zip_desc'] = 'Вимагати з боку 1с архів замість окремих файлів. Прискорює обмін';
$_['entry_delete_offers'] = 'Видаляти файл пропозицій:';
$_['entry_delete_offers_desc'] = 'Ця опція додана як захист від тупості сервісу moysklad.ru, який не чекає закінчення обробки файлу пропозицій і надсилає запит на його обробку повторно 4 рази поспіль. Тому ми просто видаляємо файл пропозицій відразу після його прочитання і на повторні запити розводимо руками, мовляв ми не при справах. Милиць, але якось же треба жити';
$_['entry_extra_comment'] = 'Розширена примітка:';
$_['entry_extra_comment_desc'] = 'У примітку до замовлення додаються всі деталі на замовлення';

$_['entry_option_type'] = 'Тип опцій';
$_['entry_option_type_desc'] = '';

$_['entry_option_required'] = 'Опція є обов\'язковою';
$_['entry_option_required_desc'] = 'Увімкніть, щоб покупець не міг оформити замовлення без вибору опції';

$_['entry_option_by_box'] = 'Створювати опції з упаковки';
$_['entry_option_by_box_desc'] = 'Якщо в атрибутах приходить Упаковка_1,Упаковка_2,Упаковка_3, то ці атрибути трансформуються в опції, а кількість з атрибута записується в Бали опції. При вивантаженні в 1с бали використовуватимуться як коефіцієнт, де буде множитися реальна кількість';
$_['entry_option_source'] = 'Забирати опції з поля Характеристики товару';
$_['entry_option_source_desc'] = 'Якщо вимкнено значення опцій буде братися спочатку з поля "ЗначенняВластивостей", потім з Характеристик, якщо включено - навпаки';

$_['entry_totals_positive'] = 'Всі результати замовлення повинні бути позитивними';
$_['entry_totals_positive_desc'] = 'Потрібно для того випадку, коли вивантаження йде в 1с і 1с не розуміє негативну суму. Їй потрібна позитивна';

$_['entry_attribute_routing'] = 'Перенаправлення властивостей:';
$_['entry_attribute_routing_desc'] = 'Якщо треба якусь властивість записати саме в товар, а не до списку властивостей, то вкажіть назву властивості та поле таблиці товару через знак рівності.<br><b>Приклад</b> списку відповідностей: <br>Вага=weight<br>Артикул=model';

$_['entry_update_attribute_product_sort'] = 'Сортування аттрибутів для товарів:';
$_['entry_update_attribute_product_sort_desc'] = 'Якщо необхідно отримати порядок сортування атрибутів для кожної категорії окремо увімкніть цю опцію.<br> Для роботи необхідний стовпець sort_order у таблиці product_attributes. А також у файлах обміну зв\'язок ктаегорій та атрибутів.';

$_['entry_missing_quantity_is_zero'] = 'Відсутність кількості вважати нулем:';
$_['entry_missing_quantity_is_zero_desc'] = 'Частина конфігурацій 1с завзято не хочуть вивантажувати кількість якщо товару немає в наявності, в результаті в магазині з\'являються фантомні залишки. Якщо це ваш випадок - увімкніть опцію і відсутність залишку означатиме його нульове значення';

$_['entry_upload'] = 'Виберіть файл:';

$_['entry_unit_links'] = 'Відповідності базових одиниць опціям';
$_['entry_unit_links_desc'] = 'Вкажіть текст, який має бути переданий як базова одиниця в 1с, відповідно до імені опції<br><b>Приклад</b><br>блок=1<br>упаковка=2' ;

$_['entry_update_filter'] = 'Оновлювати фільтр на основі значень атрибутів';
$_['entry_update_filter_desc'] = 'Значення фільтра будуть актуалізуватися, виходячи із значень атрибутів, призначених товару. Принагідно опціям будуть додаватися ті категорії, у товарах яких вони зустрічаються';
$_['entry_update_option_product_filter'] = 'Оновлювати фільтр виходячи із значень опцій товару';
$_['entry_update_option_product_filter_desc'] = 'Значення фільтра будуть актуалізуватися виходячи із значень опцій, призначених товару.';
$_['entry_option_product_filter'] = 'Виключити опції товару з фільтра';
$_['entry_option_product_filter_desc'] = 'Вкажіть перелік опцій товару, які не потрібно додавати до фільтра. Кожна опція на окремому рядку.';
$_['entry_get_from_naclad'] = 'Отримувати ціну та кількість товару на замовлення з накладної';
$_['entry_get_from_naclad_desc'] = 'Ця опція доступна, якщо у Вас використовується модуль Накладна';
$_['entry_get_orders_from_1c'] = 'Отримувати та оновлювати статуси замовлення з 1с';
$_['entry_get_orders_from_1c_desc'] = 'Актуально в тому випадку, якщо 1с передає статуси замовлень на сайт.';

$_['entry_clear_system_cache'] = 'Очищати системний кеш після обміну';
$_['entry_clear_system_cache_desc'] = 'Очищати кеш після обробки offers.xml';
$_['entry_clear_image_cache'] = 'Очищати кеш зображень після обміну';
$_['entry_clear_image_cache_desc'] = 'Очищати кеш після обробки offers.xml';

$_['entry_clear_neoseo_filter_cache'] = 'Очищати кеш модуля NeoSeo Фільтр';
$_['entry_clear_neoseo_filter_cache_desc'] = 'Кеш модуля NeoSeo Фільтр буде очищено, якщо модуль встановлений.';
$_['entry_update_date'] = 'Вимкнути оновлення дати товари.';
$_['entry_update_date_desc'] = 'При обміні з 1С не змінювати дату зміни товару, якщо залишок товару не змінився';

$_['entry_use_fraction_quantity'] = 'Використовувати дрібний залишок';
$_['entry_use_fraction_quantity_desc'] = 'При використанні даної опції дробовий залишок повинен підтримуватись у Вас на сайті';

$_['entry_search_option_for_sku'] = 'Виконувати пошук опцій за артикулом';
$_['entry_search_option_for_sku_desc'] = 'Дану опцію слід застосовувати тільки в тому випадку, якщо опції із сайту є окремими товарами в 1с.';
$_['entry_option_field_sku'] = 'Поле артикула опції';
$_['entry_option_field_sku_desc'] = 'Необхідно вказати поле в таблиці product_option_value, де зберігається значення артикула. Використовується лише за умови увімкненої опції "Виконувати пошук опцій за артикулом". <br>Наприклад, sku, model, optsku.';
$_['entry_option_field_ean'] = 'Поле штрих-коду опції';
$_['entry_option_field_ean_desc'] = 'Необхідно вказати поле в таблиці product_option_value або relatedoptions, де зберігається значення штрих-коду. <br>Наприклад, ean.';
$_['entry_option_sku_add_product_sku'] = 'Артикул опції містить артикул товару';
$_['entry_option_sku_add_product_sku_desc'] = 'Використовується тільки в тому випадку, якщо з 1с приходить повний артикул, а на сайті в артикулі опції зберігається частина артикула, а також тільки при включеній опції "Виконувати пошук опцій за артикулом". <br>Наприклад, з 1с приходить артикул 111-222, де 111 - це артикул товару на сайті, а -222 - це артикул опції.';
$_['entry_option_sku_symbol_add_product_sku'] = 'Символ, який поєднує артикул товару та артикул опції';
$_['entry_option_sku_symbol_add_product_sku_desc'] = 'Використовується тільки при включеній опції "Артикул опції містить артикул товару".<br> Наприклад, якщо поле не заповнене, тоді визначити де артикул товару, а де опції неможливо..';
$_['entry_set_auto_tag_order'] = 'Встановити мітку замовлення автоматично під час його редагування';
$_['entry_set_auto_tag_order_desc'] = 'Використовується при увімкненій опції "Як вибирати замовлення для вивантаження" - за міткою в замовленні.';
$_['entry_exclude_auto_tag_order'] = 'Виключати автоматичне встановлення мітки для замовлень зі статусом';
$_['entry_exclude_auto_tag_order_desc'] = 'Використовується при увімкненій опції "Встановити мітку замовлення автоматично під час його редагування".';

$_['entry_use_filter'] = 'Використовувати фільтр';

$_['entry_delete_special_price'] = 'Видаляти акційні ціни перед їх оновленням';
$_['entry_delete_discount_price'] = 'Видаляти знижкові ціни перед їх оновленням';
$_['entry_zero_special_discount'] = 'Ігнорувати акційну та знижкову ціну якщо вона нульова';

$_['entry_user_answer_for_moy_sklad'] = "Використовувати відповідь processing під час іпорту";
$_['entry_user_answer_for_moy_sklad_desc'] = "Опція спеціально для сервісу 'Мій склад', яка використовує повторний виклик імпорту рівно через хвилину. Якщо активна - протягом 5 хвилин буде відповідь processing якщо імпорт не завершено";
$_['entry_import_orders_disable_curl'] = 'Вимкнути curl при імпорті статусу замовлення з 1с';
$_['entry_import_orders_comment_field'] = 'Вкажіть назву поля з 1с для коментаря в статусі замовлення';
$_['entry_exclude_warehouses'] = 'Вкажіть найменування складів, які необхідно виключити з вивантаження';
$_['entry_exclude_warehouses_desc'] = 'Якщо з боку 1с немає можливості прибрати з вивантаження зайві склади, в даному полі вкажіть найменування непотрібних складів. Кожен склад з нового рядка';

$_['entry_zero_quantity_missing_goods'] = "Встановити кількість 0 відсутнім товарам";
$_['entry_zero_quantity_missing_goods_desc'] = "Встановити кількість 0 товарів, яких немає у файлі обміну";

$_['entry_commerce_ml_version'] = "Версія протоколу обміну CommerceMl";
$_['entry_commerce_ml_version_order'] = "Версія протоколу обміну замовленнями CommerceMl";
$_['entry_use_two_side_products_exchange'] = "Використовувати двосторонній обмін товарами на замовлення";
$_['entry_use_two_side_products_exchange_desc'] = "<span style='color: orangered;'>Тестова версія</span> Обмін товарами без опцій!!";

$_['entry_counterparties_exchange'] = "Використовувати обмін покупцями";
$_['entry_counterparties_exchange_desc'] = "<span style='color: orangered;'>УВАГА! Функціонал доступний у тестовому режимі</span> Обмін контрагентами доступний у версії протоколу обміну CommerceML версії 3";
$_['entry_counterparties_method'] = "Метод ідентифікації покупців";
$_['entry_counterparties_create_new'] = "Створювати нових покупців";
$_['entry_counterparties_new_group'] = "Надавати групу новим покупцям";
$_['entry_counterparties_fio_field'] = "Поле в якому передається ПІБ покупця";
$_['entry_counterparties_phone_field'] = "Поле, в якому передається номер телефону";
$_['entry_counterparties_email_field'] = "Поле, в якому передається e-mail покупця";
$_['entry_counterparties_update_fio'] = "Оновлювати ПІБ покупця на сайті";
$_['entry_counterparties_import_address'] = "Використовувати під час обміну адресу покупця";
$_['entry_counterparties_import_address_desc'] = "Адреса з картки контрагента в полі Адреса-Подання";
$_['entry_import_external_orders'] = "Імпортувати нові замовлення з 1С на сайт";
$_['entry_import_external_orders_desc'] = "<span style='color: orangered;'>УВАГА! Функціонал доступний у тестовому режимі</span>Перевірте чи увімкнена можливість створювати нових контрагентів-покупців на Вашому сайті. Замовлення з незнайденими контрагентами будуть пропущені .";
$_['entry_external_orders_status'] = 'Статус для імпортованих замовлень';

$_['entry_wait_import_command'] = "Чекати від 1С команду на обробку файлу";
$_['entry_wait_import_command_desc'] = "Іноді 1С не надсилає запит на обробку файлів. Якщо опція відключена, обробка файлу почнеться відразу після його завантаження.";

$_['entry_extra_totals_property'] = "Передавати підсумки як значення у тезі 'Значення Реквізитів'";
$_['entry_extra_totals_property_desc'] = 'Якщо в замовленні Вам потрібно вивантажувати довільні значення підсумків, вкажіть <b>Назва;Код_підсумка;Тип</b>. Кожне правило з нового рядка! Де Назва - Значення для поля Найменування, Код підсумку - Код підсумку з opencart (збігається з кодом модуля з розділу "Враховувати замовлення"), Тіт - може приймати 2 значення: abs - завжди передавати тільки позитивне значення (значення за модулем), asis - передавати те значення, яке потрапляє у вказаний результат.<br><b>Наприклад:</b><br>ПрограмаЛояльності;neoseo_loyality_system;abs - у полі "ЗначенняРеквізиту" отримаємо Назва "ПрограмаЛояльності", "Значення" - сума знижки за програмі лояльності, але без знаку мінус. ';

$_['entry_field_for_1c_order_id'] = "Поле для номера замовлення";
$_['entry_field_for_1c_order_id_desc'] = "Якщо поле не заповнене то буде використовуватись поле 'order_id' з таблиці із замовленнями. Якщо вам необхідно передати якийсь інший номер замовлення, а потім при обміні знайти замовлення по цьому полю вкажіть його тут. Поле має знаходитись у таблиці замовлень префікс_orders";

$_['entry_special_price_tag_date_start'] = "Спеціальний тег, для вказівки дати початку акції";
$_['entry_special_price_tag_date_start_desc'] = "Вкажіть спец. тег акцій ціни з offers.xml, який відповідає за дату початку акції. За стандартом тег, який відповідає за дату початку акції, відсутній у протоколі CommerceML і його додавання вимагає доопрацювання з боку 1с .";
$_['entry_special_price_tag_date_end'] = "Спец. тег, для вказівки дати закінчення акції";
$_['entry_attribute_label'] = "Зв'язок атрибутів з мітками товарів теми оформлення Journal";
$_['entry_attribute_label_desc'] = "Вкажіть зв'язок значення атрибута мітки та назви мітки в темі оформлення journal.<b>hit=Хіт</b>. Кожне правило з нового рядка!. ";
$_['entry_currency_convertor_multy_main_price'] = "Вкажіть валюту, яку потрібно розцінювати як основна ціна.";
$_['entry_currency_convertor_multy_main_price_desc'] = "Опція використовується при роботі мультивалютним вивантаженням, вкажіть назву валюти з вивантаження 1С";

$_['entry_export_order_special_price_tag'] = "Спец. тег для вивантаження у замовленні старої ціни товару";
$_['entry_export_order_special_price_tag_desc'] = "Якщо поле заповнене, то у вказаний у полі тег буде вивантажена стара ціна товару, за умови, що ціна товару із замовлення та ціна, яка вказана в полі price різниться (тобто у товару в на замовлення вказана акційна або знижкова ціна товару).";

$_['entry_order_comment'] = "Коментар до замовлення при зміні статусу замовлення";
$_['entry_order_comment_desc'] = "Вкажіть коментар до замовлення, яке буде присвоєно замовленню, при зміні статусу при передачі замовлень в 1с. Якщо залишити поле порожнім, тоді коментар не буде присвоєний.";

$_['entry_decimal_separator'] = 'Розділювач десяткової частини';
$_['entry_decimal_separator_desc'] = 'Необхідно вказати роздільник десяткової частини "точка" або "кома", що використовується в конфігурації 1С. <br>Наприклад: 2,5 - роздільник кома<br>2.5 - роздільник точка';
$_['entry_use_options_special'] = 'Використовувати акційну ціну для опцій';
$_['entry_use_options_special_desc'] = '<span style=\'color: orangered;\'>УВАГА!</span> Переконайтеся, що Ваш магазин підтримує цей функціонал';
$_['entry_options_special_price'] = 'Вкажіть акційну ціну з 1С для опцій';

$_['entry_update_auto_filter'] = 'Додавати значення для фільтра "Автофільтр"';
$_['entry_update_auto_filter_desc'] = 'Повинен бути встановлений модуль "Авто фільтр" - фільтр по автомобілях, і у вивантаженні повинні бути значення &lt;Автомобілі&gt;&lt;Автомобіль&gt;.';

$_['entry_warehouses_multistore'] = 'Вкажіть відповідність складів із модулем MultiStore';
$_['entry_warehouses_multistore_desc'] = 'Для роботи цієї опції Вам необхідний встановлений модуль MultiStore. Потрібно вказати відповідність найменувань 1с складу та MultiStore<br> Наприклад: Склад 1С = Склад MultiStore';
$_['entry_unit_field_offer'] = 'Поле Товар/ОдиницяВимірювання брати з файлу offers із тегу ціни';
$_['entry_unit_field_offer_desc'] = 'Цей пункт потрібно включити якщо потрібно брати одиницю виміру з тега ціни, поле куди буде збережено значення береться із значення вище';
$_['entry_option_quantity'] = 'Перераховувати залишки товару за опціями';
$_['entry_option_quantity_desc'] = 'Якщо Вам не потрібно оновлювати основний залишок товару за залишками в опціях - відключіть цей пункт';
$_['entry_options_as_product'] = 'Вивантажувати у замовленні для 1С опції як товар';
$_['entry_options_as_product_desc'] = 'Для коректної роботи потрібно щоб опція мала зв\'язок за внутрішнім кодом 1С, якщо ВД від 1С для опції не призначає функція виведе як звичайний товар';
$_['entry_attribute_routing_download_files'] = 'Вкажіть властивості для перенаправлення в прикріплені файли';
$_['entry_attribute_routing_download_files_desc'] = 'Вказані атрибути будуть використовуватися як отримання посилання на файл для скачування. Як мусить бути посилання на файл';
$_['entry_attribute_file_name'] = 'Назва файлу, отриманого з атрибутів';
$_['entry_attribute_file_name_desc'] = 'Необхідно заповнити, якщо використовується попереднє налаштування для отримання файлів з властивостей';
$_['entry_update_auto_neoseo_filter_warehouse'] = 'Оновлювати фільтр "Склади"';
$_['entry_update_auto_neoseo_filter_warehouse_desc'] = 'Значення фільтра "Склади" будуть актуалізуватися автоматично, якщо налаштовані склади.';
$_['entry_export_product_field_attr'] = 'При експорті товарів вивантажувати як атрибут поля з таблиці product';
$_['entry_export_product_field_attr_desc'] = 'Приклад: model=Модель, де model - це поле з таблиці product, Модель - це назва майбутнього атрибута';
$_['entry_product_update_avaro'] = 'Оновлювати товари в модулі НРМ';
$_['entry_delete_by_mark'] = 'Видалити товар за тегом, зазначеним у налаштуванні вище, "Вимкнути товари за окремим тегом"';
$_['entry_delete_by_mark_desc'] = 'Приклад тега "<ПоміткаВидалення> true < /ПоміткаВидалення>" ';

$_['entry_categories_reset_quantity'] = 'Обнулити залишок товарів із категорій';
$_['entry_categories_reset_quantity_desc'] = 'Вкажіть категорії для яких потрібно обнулити залишок товарів, які відносяться до них, перед обробкою залишків';
$_['entry_update_price_special_option'] = 'Оновлювати акційну ціну за мінімальною опцією';
$_['entry_skip_without_id'] = 'Пропускати товари в замовленні без 1с_id';
$_['entry_skip_without_id_desc'] = 'Активуйте цю настройку якщо необхідно пропускати товари в замовленні якщо вони раніше не були синхронізовані';
$_['entry_product_kit_status'] = 'Оновлювати Комплект товарів';
$_['entry_product_kit_status_desc'] = 'При включеній опції та наявності модуля "NeoSeo Комплект товарів" до товарів будуть додані комплекти.';
$_['entry_product_kit_tag'] = 'Назва тега для оновлення комплектів товару';
$_['entry_product_kit_tag_desc'] = 'Вкажіть назву тега, в якому зберігаються коди товарів для створення комплекту. Коди вказуються через кому.';
$_['entry_product_kit_field'] = 'Назва поля товару, за якою буде здійснено пошук коду товару, вказаний у тезі для комплектів';
$_['entry_product_kit_field_desc'] = 'Вкажіть поля товару (поле в таблиці product),за яким буде здійснено пошук коду товару, вказаний у тезі для комплектів.';
$_['entry_description_column'] = 'Виберіть поле, куди вивантажувати опис';
$_['entry_description_column_desc'] = 'Опис буде записуватись у це поле з таблиці product_description';
$_['entry_save_forbidden_options'] = 'Не видаляти опції зі списку "Не вивантажуваних опцій"';
$_['entry_save_forbidden_options_desc'] = 'Увімкніть цю функцію, якщо Вам необхідно не перезаписувати/очищати опції, що вказані у списку вище "Не вивантажувати опції". Опції залишаться в товарі, інші будуть оновлюватись';
$_['entry_attribute_links'] = 'Зв\'язки між атрибутами';
$_['entry_attribute_links_desc'] = 'Якщо вам потрібно, щоб атрибут 1с з одним найменуванням відповідав атрибуту магазину з іншим - ви можете задати правила в цьому полі. Кожна відповідність до нового рядка. <br> Формат: властивість_1С: властивість_ІМ';
$_['entry_product_for_option_discount_price'] = 'Вказати знижку товару з останньої опції';
$_['entry_product_for_option_discount_price_desc'] = 'Активуйте, якщо необхідно отримати знижку з опції в основний товар. Візьметься знижка за останньою опцією у файлі обміну. Призначення цін до груп встановлюється на вкладці опції';

$_['entry_update_only_main_product_category'] = 'Оновлювати лише головну категорію товару';
$_['entry_update_only_main_product_category_desc'] = 'Прив\'язка товару до категорій у блоці "Відображати в категоріях" не скидатиметься. Для правильної роботи даної опції має бути відключена опція "Заповнювати батьківські категорії"';

$_['entry_export_discount_as_element'] = 'Експортувати знижку як окремий атрибут';
$_['entry_export_discount_as_element_desc'] = 'Експортувати знижки як атрибут документа &lt;Знижки&gt;';
$_['entry_tax_list'] = 'Податки, виводити на замовлення';
$_['entry_tax_list_desc'] = 'Податки, що розраховуються на загальну суму товарів, незалежно від того, який податок обраний у товарі';
$_['entry_options_in_product'] = 'Виводити опції в товар';
$_['entry_options_in_product_desc'] = 'Опції будуть вивантажуватися в товар у теги \<Опції\>, якщо опція не синхронізована раніше - буде вказано в ІД її найменування';
$_['entry_price_routing'] = 'Перенаправити ціни';
$_['entry_price_routing_desc'] = 'Даний настрій дозволить перенаправити ціни в таліцю product у вказане поле<br> Наприклад: Оптова ціна = ean';
$_['entry_special_price_to_custom_table'] = 'Перенаправити ціни на спец. таблицю ';
$_['entry_special_price_to_custom_table_desc'] = 'Ця настройка дозволить перенаправити ціни в таліцю price_user_group, з полями price_product_id,<br> price_user_group,<br> price';
$_['entry_order_currency_route'] = 'Вкажіть відповідність валют у замовленні';
$_['entry_order_currency_route_desc'] = 'Вкажіть відповідність кодів валют магазину та 1С. Якщо поле заповнене модуль буде вивантажувати замовлення у валюті покупки <br> Наприклад: usd = грн <br> Де usd - це код валюти магазину, справа грн - код в 1С';
$_['entry_clear_product_option'] = 'Очистити опції товару, якщо є у розвантаженні';
$_['entry_clear_product_option_desc'] = 'Якщо під час аналізу файлу import.xml є товар - тоді очищаємо його опції.';
$_['entry_product_extra_full'] = 'Вивантажувати розширені дані щодо товару з основної таблиці';
$_['entry_product_extra_full_desc'] = 'Якщо в замовленні Вам потрібно вивантажувати додаткові дані по товару, вкажіть <b>Назва;Таблиця БД;Поле</b>, якщо потрібно вивантажувати додаткові дані, де <b>Назва</b> - назва тега, який буде поміщений у тег Товар, <b>Таблиця БД</b> - таблиця з якої буде взято поле, <b>Поле</b> - поле таблиці, з якого буде взято значення та поміщено у тег. Обов\'язкове наявність у таблиці поля product_id. Розбір зазначених тегів має бути налаштований на 1с. Кожен запис з нового рядка. <br> <b>Приклад:</b> <br> Артикул;oc_product;sku<br> Опис;oc_product_description;description';
$_['entry_customer_name_empty'] = 'Вкажіть ім\'я покупця, якщо це не вказано';
$_['entry_customer_name_empty_desc'] = 'Вкажіть ім\'я покупця, яке буде виводитися, якщо покупець не вказано';
$_['entry_option_exclude_required_name'] = 'Виключити опції як обов\'язкові за назвою';
$_['entry_option_exclude_required_name_desc'] = 'Кожне найменування опції з нового рядка';
$_['entry_update_filter_offers'] = 'Оновлювати фільтри також після обробки файлу offers';
$_['entry_filter_import_clear'] = 'Очищати примусово значення фільтрів у товарі після обробки файлу import';
$_['entry_exchange_control'] = 'Заборонити обміни запущені одночасно';
$_['entry_exchange_control_desc'] = 'Активуйте функцію, якщо необхідно заборонити проводити обміни, якщо обмін вже йде';
$_['entry_exchange_control_time'] = 'Час для скидання позначки обміну в хвилинах';
$_['entry_exchange_control_time_desc'] = 'Вкажіть кількість хвилин після закінчення яких буде скинута мітка обміну яка блокує запуск декількох обмінів в один час.<br>Необхідно на випадок якщо обмін не був завершений і мітка сама не знялася. Функція працює лише якщо активована функція "Заборонити обміни запущені в один час"';
$_['entry_only_add_new_products'] = 'Тільки додати товари';
$_['entry_only_add_new_products_desc'] = 'Під час обміну будуть додаватися нові товари, наявні у розвантаженні. Товари, які вже є на сайті, будуть пропущені і ніяк не оброблені, навіть якщо вони були додані в ході більш ранніх обмінів';
$_['entry_clear_attribute'] = 'Очищати атрибути товару перед оновленням';
$_['entry_related_product_quantity_sum'] = 'Сумувати залишки супутніх товарів';
$_['entry_related_product_quantity_sum_desc'] = 'Функція працює якщо в товарах присутні супутні товари, основному товару сумуватиме залишки супутніх';
$_['entry_option_not_zero'] = 'Не призначати ціну товару з опцій, якщо вона дорівнює 0';
$_['entry_control_order_status'] = 'Контроль статусу передачі замовлення в 1С';
$_['entry_control_order_status_desc'] = 'Після передачі замовлення в 1С очікуємо відповідь від 1С зі статусом success, якщо він є міняємо статус у замовленні';
$_['entry_order_status_completed'] = 'Статус успішно завершеного замовлення, від 1С';
$_['entry_order_status_completed_desc'] = 'Вкажіть статус замовлення, який буде отриманий від 1С як завершений, якщо присутній реквізит, що вказує на статус (статус повинен бути такий як у 1С, у карті можна перевизначити)';
$_['entry_order_status_not_completed'] = 'Статус не успішно завершеного замовлення, від 1С';
$_['entry_order_status_not_completed_desc'] = 'Вкажіть статус замовлення, який буде отриманий від 1С як не завершений, якщо присутній реквізит, що вказує на статус (статус повинен бути такий як у 1С, у карті можна перевизначити)';
$_['entry_order_status_completed_status'] = 'Реквізит, що вказує на стан завершеного замовлення, від 1С';
$_['entry_order_status_completed_status_desc'] = 'Вкажіть назву реквізиту, який буде надходити від 1С і вказувати завершене замовлення чи ні';
$_['entry_extra_document_download_tag'] = 'Вкажіть назву поля, яка є файлом, для генерації посилання';
$_['entry_extra_document_download_tag_desc'] = 'Це поле пов\'язане з "Вивантажувати додатковий тег у Документ" вкажіть назву поля для 1С, яке модуль буде проводити пошук у таблиці upload і конвертувати в посилання для скачування, підмінивши у вивантаженні замовлення';

// Error
$_['error_permission'] = 'У Вас немає прав для керування цим модулем!';
$_['error_post_size'] = "Збільште значення параметрів post_max_size та upload_max_filesize, щоб вони перевищували розмір архіву";
$_['error_empty_archive'] = "Архів порожній або має неправильну структуру. Правильна структура передбачає наявність файлів відразу в корені архіву";
$_['error_download_logs'] = 'Файл логів порожній або відсутній!';

$_['error_ioncube_missing'] = '';
$_['error_license_missing'] = '';
$_['mail_support'] = '';
$_['module_licence'] = '';
$_['text_module_version'] = '';



/* =============== LECENSE INFO ================= */
$_['text_module_version'] = '298';
$_['error_license_missing'] = '<h3 style = "color: red"> Відсутній файл з ключем! </h3>
<p> Для отримання файлу з ключем зв`яжіться з NeoSeo по email <a href="mailto:license@neoseo.com.ua"> license@neoseo.com.ua </a>, при цьому вкажіть: </p>
<ul>
	<li> назву сайту, на якому ви купили модуль, наприклад, https://neoseo.com.ua </li>
	<li> назву модуля, який ви купили, наприклад: NeoSeo Обмін з 1С:Підприємство </li>
	<li> ваше ім`я користувача (нік-нейм) на цьому сайті, наприклад, NeoSeo </li>
	<li> номер замовлення на цьому сайті, наприклад, 355446 </li>
	<li> основний домен сайту для якого буде активований файл з ключем, наприклад, https://neoseo.ua </li>
</ul>
<p> Отриманий файл з ключем покладіть у корінь сайту, тобто поруч з файлом robots.txt і натисніть кнопку "Перевірити ще раз".</p>';
$_['error_ioncube_missing'] = '<h3 style="color: red">Відсутній IonCube Loader!</h3>
<p>Щоб користуватися нашим модулем, вам потрібно встановити IonCube Loader.</p>
<p>Для установки зверніться до ТП Вашого хостингу</p>
<p>Якщо ви не можете встановити IonCube Loader самостійно, у вас є можливість попросити допомоги у наших фахівців за адресою <a href="mailto:support@neoseo.com.ua"> support@neoseo.com.ua </a></p>
';
$_['module_licence'] = '<h2>Ліцензійні умови згоди на використання програмного забезпечення NeoSeo</h2>
<p>Дякуємо вам за покупку програмних продуктів нашої веб-студії.</p>
<p>Нижче наведені юридичні умови, які поширюються на всіх, хто відвідує наш сайт і користується нашими програмними продуктами або послугами. Дані умови спрямовані на те, щоб захистити ваші інтереси та інтереси ТОВ "НЕОСЕО" і його афілійованих структур і осіб (далі, "ми", "NeoSeo"), які виступають в договорах від його імені.</p>
<p><strong>1. Введення</strong></p>
<p>Ці Умови використання NeoSeo ( "Умови використання") поряд з додатковими умовами, які стосуються ряду конкретних послуг або програмних продуктів, розробок і представлені на веб-сайті (-ів) NeoSeo, містять умови і положення, дія яких поширюється на кожного відвідувача або користувача ( "Користувач", "ви" або "Покупець") веб-сайту NeoSeo, додатків, доповнень і компонентів, запропонованих нами поряд з наданням послуг і веб-сайту, якщо не вказано інше (всі послуги та програмне забезпечення, програмні модулі запропоновані через веб-сайт NeoSeo або допоміжні сервіси, веб-сервіси, ін. додатки від імені NeoSeo спільно іменуються - "Послуги NeoSeo" або "Послуги").</p>
<p>Умови NeoSeo є обов`язковим контрактом між NeoSeo і вами - тому просимо вас уважно ознайомитися з ними.</p>
<p>Ви можете відвідувати і / або використовувати Послуги NeoSeo тільки в тому випадку, якщо повністю згодні з Умовами NeoSeo: використовуючи будь-яку з Послуг NeoSeo і / або підписуючись на неї, ви висловлюєте і підтверджуєте свою згоду з даними Умовами користування та іншими Умовами NeoSeo, наприклад, умови надання послуг програмування в розрізі типових і нетипових завдань, які виписані тут:   <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a> , (далі Умови NeoSeo).</p>
<p>Якщо ви не можете прочитати Умови NeoSeo, не знаєте їх або не згодні з ними, ви повинні покинути Веб-сайт NeoSeo і не користуватися Послугами NeoSeo.</p>
<p>Використовуючи наші Програмні продукти, Сервіси і Послуги, ви підтверджуєте, що ознайомилися з нашою Політикою конфіденційності, доступною до перегляду за адресою <a href="https://neoseo.com.ua/politika-konfidencialnosti" target="_blank" class="external">https://neoseo.com.ua/politika-konfidencialnosti</a>   ("Політика конфіденційності").</p>
<p>Цей документ є ліцензійною угодою між вами і NeoSeo.</p>
<p>Погоджуючись на цю угоду або використовуючи програмне забезпечення, ви погоджуєтеся з усіма цими умовами.</p>
<p>Ця угода відноситься до програмного забезпечення NeoSeo, будь-яких шрифтів, піктограм, зображень або звукових файлів, що надаються у складі програмного забезпечення, а також до всіх оновлень, доповнень або служб NeoSeo для програмного забезпечення, якщо в їх відношенні не застосовуються інші умови. Це також стосується розроблених в NeoSeo додатків і доповнень для SEO-Магазину, які забезпечують розширення його функціональних можливостей.</p>
<p>До використання вами деяких функцій додатків можуть застосовуватися додаткові умови NeoSeo і третіх осіб. Для коректної роботи деяких додатків необхідні додаткові угоди з окремими умовами та політиками конфіденційності, наприклад з сервісами, які надають послуги смс-нотифікації.</p>
<p>Програмне забезпечення не продається, а надається за ліцензією.</p>
<p>NeoSeo зберігає за собою всі права (наприклад, права, передбачені законами про захист інтелектуальної власності), які не надаються явно в рамках цієї угоди. Наприклад, ця ліцензія не надає вам права:</p>
<li><span></span><span></span>окремо використовувати або віртуалізувати компоненти програмного забезпечення;</li>
<li>публікувати або копіювати (за винятком дозволеної резервної копії) програмне забезпечення, надавати програмне забезпечення у прокат, в оренду або в тимчасове користування;</li>
<li>передавати програмне забезпечення (за винятком випадків, передбачених цією угодою);</li>
<li>намагатися обійти технічні обмеження програмного продукту;</li>
<li>вивчати технологію, декомпілювати або деасемблувати програмне забезпечення, а також вживати відповідні спроби, крім тих що в мірі та у випадках, коли це (а) передбачено відповідним правом; (б) дозволено умовами ліцензії на використання компонентів з відкритим вихідним кодом, які можуть входити до складу цього програмного забезпечення; (c) необхідно для налагодження змін будь-яких бібліотек, що ліцензуються по малій стандартній громадській ліцензії GNU, які входять до складу програмного забезпечення та пов`язані з ним;</li>
<p>Ви маєте право використовувати дане програмне забезпечення, тільки якщо у вас є відповідна ліцензія і програмне забезпечення було належним чином активовано з використанням справжнього ключа продукту або в інший дозволений спосіб.</p>
<p>У вартість ліцензії SEO-Магазину не включені послуги установки, настройки і тим більше його стилізації, також як і інші платні / безкоштовні доповнення до нього. Дані послуги є додатковими, вартість залежить від кількості необхідних для реалізації годин, детальніше тут: <a href="https://neoseo.com.ua/vse-chto-nujno-znat-klienty" target="_blank" class="external">https://neoseo.com.ua/vse-chto-nujno-znat-klienty</a></p>
<p>З повною версією документа можна ознайомитися тут:</p>
<p><a href="https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya" target="_blank" class="external">https://neoseo.com.ua/usloviya-licenzionnogo-soglasheniya</a>
</p>';
$_['mail_support'] = '<P> Завжди раді допомогти, </ p>
<P> Відділ підтримки Клієнтів, веб-студія NeoSeo. </ P>
<P> Нагадуємо, веб-студія NeoSeo пропонує інформаційну підтримку безкоштовно на форумі <a href="https://opencartmasters.com/"> OpenCartMasters.com </a>
(Зазвичай відповіді надаються протягом доби протягом робочого дня). </ P>
<P>
Якщо у Вас термінове питання і його треба вирішити вже, будь ласка, замовляйте платну підтримку, яка надається в той же день з використанням Skype і TeamViewer.
</ P>
<P>
Із загальних питань пишіть в телеграм чат <a href="https://t.me/WebStudioNeoSeo1"> https://t.me/WebStudioNeoSeo1 </a>
</ P>
<P>
Гарного дня і відмінного настрою :) <br>
Команда NeoSeo. </ P>
';

// add_entry
$_['entry_module_key'] = "Введіть ключ ліцензії";
$_['entry_module_key_desc'] = 'Якщо у вас проблема з ліцензійним зверненням на <a href="https://opencartmasters.com/"> OpenCartMasters.com </a> або в телеграмі чату <a href="https://t.me/WebStudioNeoSeo1"> https://t.me/WebStudioNeoSeo1 </a>';

// License
$_['text_license_lifetime'] = 'Довічна';
$_['text_license_end_period'] = 'Ліцензія прострочена';
$_['text_license_error_domain'] = 'Ліцензія не для Вашого домену';
$_['text_license_error_key'] = 'Не вірний ключ ліцензії';
$_['text_license_missing'] = 'відсутнє ліцензія';
$_['text_valid_to'] = 'Дійсне до:';
$_['text_est_time'] = 'Залишилося днів:';
$_['text_mode'] = 'Рівень ліцензії:';
$_['text_not_included_in_license'] = 'Ця функція не дозволена в цьому типі ліцензії';

$_['text_mode_0'] = 'Немає ліцензії:';
$_['text_mode_1'] = 'Лайт';
$_['text_mode_2'] = 'Стандарт';
$_['text_mode_3'] = 'Про +';
$_['error_access_mode_1'] = 'Ця функція доступна починаючи з версії "Лайт"';
$_['error_access_mode_2'] = 'Ця функція доступна починаючи з версії "Стандарт"';
$_['error_access_mode_3'] = 'Ця функція доступна починаючи з версії "Про +"';

