<?php
// Text
$_['text_license_request']		= 'Форма запиту ліцензії';
$_['text_license']    			= 'Активація ліцензії';
$_['text_contacts']    			= 'Контакти';
$_['text_success_sent']  		= 'Дані про покупку успішно відправлені!';
$_['text_success_activate']		= 'Активація пройшла успішно!';
$_['text_about_license']  		= '<i class="fa fa-list-ol" aria-hidden="true"></i> Порядок активації ліцензії:<br/>
<ol>
	<li>Вкажіть всі дані про покупку та натисніть кнопку &laquo;Надіслати&raquo;</li>
	<li>Після перевірки розширення активується автоматично, а ключ ліцензії буде відправлений на вказану електронну адресу</li>
	<li>Якщо у Вас вже є ключ активації, то введіть його у відповідне поле і натисніть кнопку &laquo;Активувати&raquo;</li>
</ol>
<p><i class="fa fa-clock-o" aria-hidden="true"></i> Активація ліцензії відбувається протягом декількох годин після покупки!</p>
<p><i class="fa fa-info-circle" aria-hidden="true"></i> Щоб перевірити активацію досить оновити сторінку з налаштуваннями розширення!</p>
<p><i class="fa fa-exclamation-triangle" aria-hidden="true"></i> Ліцензія надається лише на 1 (один) домен та на будь-яку кулькість піддоменів та тестових сайтів!</p>';
$_['text_about_support']  		= 'По всім питанням, які пов`язані з роботою доповнення звертайтесь за наступними контактами:';
$_['text_support_skype']		= '<a href="skype:oc.max?chat">oc.max</a> (відповідаємо швидко, бажаний канал зв`язку)';
$_['text_support_email']		= '<a href="mailto:support@oc-max.com">support@oc-max.com</a> (відповідь протягом 24-72 годин)';
$_['text_support_site']			= 'oc-max.com';

// Entry
$_['entry_email'] 				= 'E-mail';
$_['entry_domain'] 				= 'Домен';
$_['entry_market'] 				= 'Продавець';
$_['entry_payment_id'] 			= '№ чеку/рахунку';
$_['entry_license'] 			= 'Ключ ліцензії';

// Help
$_['help_email']    			= 'Введіть e-mail на який буде відправлено ключ ліцензії';
$_['help_domain']    			= 'Домен до якого буде прив`язана ліцензія. Можна вказати декілька через кому без пробілу';
$_['help_market']    			= 'Оберіть місце де Ви придбали розширення';
$_['help_payment_id']    		= 'Введіть номер чеку/рахунку або іншу інформацію для ідентифікації покупки';
$_['help_send']    				= 'Надіслати дані про покупку';
$_['help_license'] 				= 'Вставте ключ та натисніть &laquo;Активувати&raquo; (зображення ключа)';
$_['help_activate']    			= 'Активувати';

// Error
$_['error_sent']				= 'Помилка! Дані про покупку не відправлені!';
$_['error_activate']			= 'Помилка! Код ліцензії не вірний!';