<?php
// Text
$_['text_success'] = 'Статус заказа успешно изменен! Заказ №: ';

$_['text_payment_method'] = 'Оплата';
$_['text_shipping_method'] = 'Доставка';
$_['text_order_id'] = '№ заказа:';
$_['text_order_detail']   = 'Для просмотра заказа нажмите на ссылку ниже:<br>';
$_['text_order_download'] = 'После подтверждения платежа вы можете нажать на ссылку ниже, чтобы получить доступ к загружаемым товарам:<br>';
$_['text_download'] = 'Загрузить';

// Error
$_['error_permission']       = 'Внимание: У вас нет разрешения на доступ к API!';
$_['error_not_found'] = 'Статус заказа не был изменен! Не найден заказ №: ';
