<?php
// Heading
$_['heading_title']			= 'Список товаров';
//Button
$_['button_apply']				= 'Применить';
$_['button_save']				= 'Сохранить';
$_['button_cancel']				= 'Отменить';
$_['filters_action']			= 'Действие';
$_['filtered_products']			= 'Отфильтровать по выбранным параметрам';
$_['filtered_products_titles']	= 'Отметить и выбрать<br>все отфильтрованные товары';
$_['button_clears']				= 'Очистить всё!<br>Сбросить фильтр!';
// Text
$_['text_success']		= 'Группа товаров обновлена!';
$_['text_list']			= 'Редактор групп товаров';
$_['text_default']		= 'Магазины';
// Column
$_['column_action']			= 'Действие';
$_['column_image']			= 'Фото';
$_['column_name']			= 'Наименование';
$_['column_model']			= 'Модель';
$_['column_suppler']		= 'Поставщик';
$_['column_brand']			= 'Бренд';
$_['column_manufacturer']	= 'Производитель';
$_['column_category']		= 'Категория';
$_['column_price']			= 'Цена';
$_['column_quantity']		= 'Кол-во';
$_['column_status']			= 'Статус';
// Entry
$_['entry_store']			= 'Магазины:';
$_['entry_name']			= 'Наименование:';
$_['entry_price']			= 'Цена:';
$_['entry_status']			= 'Статус:';
$_['entry_quantity']		= 'Количество:';
$_['entry_model']			= 'Модель:';
$_['entry_suppler']			= 'Поставщик:';
$_['entry_manufacturer']	= 'Производитель:';
$_['entry_status_on']		= '<span style="color:green;">ON</span>';
$_['entry_status_off']		= '<span style="color:red;">OFF</span>';
//
$_['entry_sku']				= 'Артикул:';
$_['entry_upc']				= 'UPC:';
$_['entry_ean']				= 'EAN:';
$_['entry_jan']				= 'JAN:';
$_['entry_isbn']			= 'ISBN:';
$_['entry_mpn']				= 'MPN:';
$_['entry_location']		= 'Расположение:';
$_['entry_shipping']		= 'Необходима доставка:';
$_['entry_brand']			= 'Бренд';
$_['entry_manufacturer']	= 'Производитель:';
$_['entry_date_available']	= 'Дата поступления:';
$_['entry_minimum']			= 'Минимальное количество:';
$_['entry_stock_status']	= 'Отсутствие на складе:';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= 'Помощь';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_first_text'] 		= 'Отметьте товары, на которые будет действовать скидка.<br>
Для применения скидки только на определённые категории очистите фильтр и отметьте нужных вам поставщиков, производителей
и нужные категории - далее  нажмите кнопку сохранить или применить!';
$_['help_second_text']		= 'Выбор возможен и по нескольким параметрам, для этого достаточно воспользоваться фильтром над списком.';
$_['help_third_text']		= 'Фильтр по поставщикам: требуется модуль -
<a href="http://goo.gl/z0K67u" target="blank">АОП</a>.';
$_['help_fourth_text']		= 'Отфильтровав, вы можете выбрать все выведенные товары, отметив их кнопкой <b>Выбор</b> рядом с кнопкой фильтр.';
$_['help_fifth_text']		= 'Или же выбрать только те товары, которые соответствуют вашим критериям, помечая каждый из них.';
$_['help_end_text']			= 'Завершив выбор, сохраните список кнопкой "Применить" - расположен вверху справа.';
//
$_['help_sku']				= 'Складской Номер';
$_['help_upc']				= 'Универсальный код товара';
$_['help_ean']				= 'Европейский Номер Товара (Штрихкод EAN-13)';
$_['help_jan']				= 'Японский штрихкод';
$_['help_isbn']				= 'Уникальный номер книжного издания, необходимый для распространения книги и автоматизации работы с изданием.';
$_['help_mpn']				= 'Номер партии изготовителя';
$_['help_manufacturer']		= '(Автодополнение)';
$_['help_minimum']			= 'Минимальное количество для заказа этого товара';
$_['help_stock_status']		= 'Статус, показываемый, когда товара нет на складе';
$_['help_points']			= 'Количество баллов для покупки товара. Поставьте 0, чтобы товар нельзя было приобрести за баллы.';
$_['help_category']			= '(Автодополнение)';
$_['help_filter']			= '(Автодополнение)';
$_['help_download']			= '(Автодополнение)';
$_['help_related']			= '(Автодополнение)';
$_['help_tag']				= 'разделяются запятой';
// Error
$_['error_warning']		= 'Внимательно проверьте форму на ошибки!';
