<?php
// Heads
$_['tab_discount_kit']		= 'Скидки на количество товаров';
$_['column_name']					= 'Название';
$_['column_name_titles']			= 'Название скидки';
$_['column_description']			= 'Комментарий';
$_['column_description_titles']		= 'Описание / комментарий скидки';
$_['column_sort_order']				= '<i class="fa fa-sort-numeric-asc" aria-hidden="true"></i> ';
$_['column_sort_order_titles']		= 'Порядок сортировки';
$_['column_delete']					= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']			= 'Добавить<br>Удалить';
$_['column_edit']					= '<i class="fa fa-wrench" aria-hidden="true"></i> ';
$_['column_edit_titles']			= 'Редакторы';
$_['column_status']					= '<i class="fa fa-power-off" aria-hidden="true"></i> ';
$_['column_status_titles']			= 'Вкл | Выкл<br>ON | OFF';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками <b>HELPER</b> - Хелпера, в правом верхнем углу каждого пункта,
если что-либо не понятно.</span>';
$_['help_text']				= 'ОПИСАНИЕ';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Help kit Discount
$_['help_name_kit']		= '<b style="color:green;">Скидки на количество товаров</b>';
$_['help_first_kit']		= '';
$_['help_second_kit']		= 'Вкладка <b>На кол-во товаров</b> позволяет создавать гибко настраиваемые скидки на определённые наименования
товаров при покупке их комплектом в связке.
На группы, комплекты, серии, наборы и прочие категории товаров в заказе
(как в двух различных фиксированных значениях, так и в процентном значении) - для каждого магазина, если вы используете
режим мульти-магазина. По географическим зонам, групп покупателей или отдельных покупателей, а так же гостей - на ваш выбор,
так и для любых товаров с возможностью их фильтрации по различным параметрам.
<br>Дополнительно ко всему внедрены инструменты работы со встроенными в редактор карточки скидками от кол-ва товара и акциями
- позволяя каждую из них использовать в нескольких вариациях совместно со скидкой на количество товаров.
<br>Также, есть возможность разграничивать их действия в отношении друг друга,
т.е. встроенная скидка от количества товаров или акция что, используются в редакторе карточки товара по умолчанию.
<br>Также доступна для редактирования дата действия скидки. Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['help_third_kit']		= '<b>КОЛОНКИ</b>';
$_['help_fourth_kit']		= 'НАЗВАНИЕ - название добавленной вами скидки. Задаётся на странице редактирования.';
$_['help_fifth_kit']		= '';
$_['help_sixth_kit']		= 'КОММЕНТАРИЙ - краткое описание / комментарий к скидке. Задаётся на странице редактирования.';
$_['help_seventh_kit']		= '';
$_['help_eighth_kit']		= '<i class="fa fa-wrench" aria-hidden="true"></i> - Редактор: редактирование скидки.
При её нажатии вы попадёте на страницу редактирования.';
$_['help_ninth_kit']		= '';
$_['help_tenth_kit']		= '';
$_['help_eleventh_kit']	= '';
$_['help_twelfth_kit']		= '<i class="fa fa-power-off"></i> - Статус>: Активация или деактивация скидки.';
$_['help_thirteenth_kit']	= '';
$_['help_fourteenth_kit']	= '<b style="line-height: 0; font-size: 18px;">±</b> - Действие: Добавление или удаление.';

$_['help_fifteenth_kit']	= '<b style="color:green;">СТАРТ</b>';
$_['help_sixteenth_kit']	= 'Добавляйте нужное кол-во количественных скидок кнопкой <i class="fa fa-plus-circle"></i> добавить
<br>и сохраните добавленное кнопками в правом верхнем углу!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на редактирование добавленной скидки, кликнув на иконку <i class="fa fa-pencil"></i> редактирования.
<br>Пользуйтесь подсказками <b>HELPER</b> - Хелпера, в правом верхнем углу каждого пункта, если что-то не понятно!';
// Error
$_['error_warning']			= 'У вас недостаточно прав на добавление, удаление и редактирование этого модуля!';
