<?php 
$_['text_rorder_id']            = 'Заказ № ';

$_['error_license']             = 'Лицензия отсутствует, операция не возможна!';
$_['error_permission']          = 'У вас нет прав для изменения заказа!';
$_['error_recalculate']         = 'Пересчет итогов заказа невозможен!';
$_['error_shipping_nofound']    = 'Внимание! Способ доставки не найден! Возможно в данный момент он отключен!';
$_['error_shipping_getquote']   = 'Внимание! Способ доставки не доступен для данных условий! Проверьте настройки метода по сумме и региону!';
$_['error_payment_nofound']     = 'Внимание! Способ оплаты не найден! Возможно в данный момент он отключен!';
$_['error_payment_getmetod']    = 'Внимание! Способ оплаты не доступен для данных условий! Проверьте настройки метода по сумме и региону!';
$_['error_reward_usemax']       = 'Внимание! Максимальное количество баллов у покупателя: %s!';
$_['error_coupon_use']          = 'Внимание! Указанный купон не найден! Возможно он выключен, истек его срок действия или параметры заказа не соответствуют настройкам купона!';
$_['error_voucher_use']         = 'Внимание! Указанный сертификат не найден! Возможно он выключен, удален или уже был использован в другом заказе!';
$_['error_method_available']    = '(недоступен)';
?>