<?php
// Headers
$_['heading_title']				= 'HDP Скидка от количества товара';
$_['settings_text']				= 'Настройка';
$_['discount_editor_text']		= 'Редактор скидок';
$_['add_name']					= 'Создание скидки';
$_['heading_action_text']		= 'Редактор скидки от количества товара';
$_['products_discount_text']	= 'Скидка от количества товара';
// Name
$_['entry_title']					= 'Заголовок';
$_['entry_title_titles']			= 'Наименование скидки';
$_['entry_description']				= 'Комментарий';
$_['entry_description_titles']		= 'Комментарий | описание к скидке';
$_['entry_shops']					= 'Магазины';
$_['entry_shops_titles']			= 'Редактор магазинов<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_geo_titles']				= 'Редактор гео-зон<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_products_variants']			= 'Вариант';
$_['entry_products_variants_titles']	= 'Скидка или Наценка';
//button
$_['button_edit_shops_list']		= 'Редактировать список магазинов<br>активно только в режиме EDIT';
$_['button_product_group_list']		= 'Редактировать группу товаров<br>активно только в режиме EDIT';
$_['button_clone_title']			= 'Клонирование';
$_['button_clone_titles']			= 'Клонировать';
// Editors
$_['entry_users_groups']				= 'Группа покупателей';
$_['entry_users_groups_titles']			= 'Группа покупателей<br>возможен мульти-выбор';
$_['entry_date']						= 'Дата';
$_['entry_date_titles']					= 'Дата начала и окончания<br>Если пусто = всегда';
$_['entry_date_start']					= 'начала';
$_['entry_date_end']					= 'окончания';
$_['entry_product_groups']				= 'Товары';
$_['entry_product_groups_titles']		= 'Редактор товаров<br>ALL = все товары<br>EDIT = редактировать';
$_['entry_qty_title']					= 'Количество и приоритет';
$_['entry_qty_titles']					= 'Кол-во';
$_['entry_priority_titles']				= 'Приоритет';
$_['entry_cost_title']					= 'Исходная цена<br>закупочная - COST<br>основная - PRICE';
$_['entry_round_name']					= 'Округлять';
$_['entry_round_title']					= 'Округление итоговой цены';
//protected
$_['protect_cost']			= 'COST';
$_['protect_price']			= 'PRICE';
$_['protect_current']		= 'CURRENT';
$_['round_no']				= 'Нет';
$_['round_tenth']			= 'до десятых';
$_['round_hundredths']		= 'до сотых';
$_['round_whole_number']	= 'до целого';
$_['round_five']			= 'до 5';
$_['round_nine']			= 'до 9';
$_['round_ten']				= 'до 10';
$_['round_ninety_nine']		= 'до 99';
//
$_['entry_groups_clients']				= 'Группа';
$_['entry_groups_clients_titles']		= 'Группа покупателей<br>';
$_['entry_product_group']				= 'Товары';
$_['entry_product_group_titles']		= 'Редактор товаров<br>ALL = все товары<br>EDIT - редактировать';
$_['entry_discount_formula']			= 'Формула';
$_['entry_discount_formula_titles']		= 'Формула получения<br>итоговой цены скидки';
$_['discount_products_start']			= 'Запуск и приостановка скидок';
$_['discount_products_start_title']		= 'Запустить';
$_['discount_products_stop_title']		= 'Завершить';
$_['column_delete']						= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']				= 'Добавить<br>Удалить';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками "Хелпера" в правом верхнем углу каждого пункта
если, что-то не понятно.</span>';
$_['help_text']				= 'Помошник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Products discount
$_['help_name_products']		= 'Редактор скидки от количества товара';
$_['help_first_products']		= '<b>СТАРТ</b>';
$_['help_second_products']		= 'Введите заголовок / наименование данной группы скидок от количества товаров
и его краткое описание / комментарий в соответствующие для этого поля.
<br>Далее: Сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>После применения изменений, можете переходить на редактирование добавленной скидки, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования со страницы добавления скидки.';
// Info Modal Products discount
$_['info_first_products']	= '<b>ОПИСАНИЕ</b>';
$_['info_second_products']	= 'Массовый редактор скидок от количества товаров (те самые скидки, что расположены в редакторе карточки товара админ части).
<br>Позволяет массово создавать скидки от количества товара (от 2х и более) для товаров на ваш выбор с возможностью их фильтрации по различным параметрам с памятью, тем самым подвязывая
определённую группу товаров к группам покупателей.<br>Получение конечной цены скидки от количества товара, используя  инструмент "формула".
<br>Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['info_third_products']	= '<b>НАЗВАНИЕ и КОММЕНТАРИЙ</b>';
$_['info_fourth_products']	= '<b>Название</b>: выводится в корзине напротив самой скидки.
<br><b>Комментарий</b>: используется для краткого комментария и прочей технической информации к данной скидке.';

// Help Products One
$_['help_name_products_one']		= 'Настройка';
$_['helper_name_products_one']		= '<b>ВТОРОЙ ЭТАП</b>';
$_['helpers_name_products_one']		= 'Выбрав и настроив нужные вам значения: исходную цену для расчёта количественной
скидки на товар и один из вариантов округления итоговой цены на ваше усмотрение - сохраните первоначальные изменения кнопками
<i class="fa fa-lg fa-check-circle-o"></i> или <i class="fa fa-lg fa-save"></i>  в правом верхнем углу!
<br>Далее можете переходить на массовое редактирование скидок на количество по каждому товару.';
$_['help_first_products_one']		= '';
$_['help_second_products_one']		= '';

$_['help_third_products_one']		= '<i class="fa fa-gg fa-rotate-90" aria-hidden="true"></i> <b>ИСХОДНАЯ ЦЕНА</b>';
$_['help_fourth_products_one']		= 'Выбор исходной цены для расчёта формулой стоимости по скидке от количества товара:
<br><b>COST</b> - от закупочной стоимости;
<br><b>PRICE</b> - от основной цены;
<br>Выбор расчёта от закупочной стоимости <b>COST</b> возможен только если вы используете подобный функционал и это поле имеется в БД.';
$_['help_fifth_products_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ОКРУГЛЕНИЕ</b>';
$_['help_sixth_products_one']		= 'Выбор округления итоговой цены.';

// Help Products Two
$_['help_name_products_two']		= 'Редактор скидок';
$_['help_first_products_two']		= '<b>ТРЕТИЙ ЭТАП</b>';
$_['help_second_products_two']		= 'Добавляйте нужное кол-во групп скидок кнопкой <i class="fa fa-plus-circle"></i> добавить.
Настроив нужные вам значения <b style="color:green;">ALL</b> / <b>EDIT</b> редактора группы товаров, групп покупателей, кол-ва, приоритета, формулы и т.д. на ваше усмотрение -
сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование скидкок для групп покупателей и их товаров, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования.';

$_['help_third_products_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГРУППЫ ТОВАРОВ</b>';
$_['help_fourth_products_two']		= 'Товары, на которые будут распространяться скидки от количества товара.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все товары!
<br>Для действия скидки на конкретные товары: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_fifth_products_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГРУППА ПОКУПАТЕЛЕЙ</b>';
$_['help_sixth_products_two']		= 'Выбор групп покупателей, к которым будет подвязана скидка от количества товара.
<br>Также возможен мульти-выбор групп покупателей.';

$_['help_seventh_products_two']		= '<i class="fa fa-signal" aria-hidden="true"></i> <b>КОЛИЧЕСТВО</b> и
<i class="fa fa-sort-amount-asc fa-rotate-180" aria-hidden="true"></i> <b>ПРИОРИТЕТ</b>';
$_['help_eighth_products_two']		= 'Поле количества товара, при достижении которого скидка будет задействована - 2 и более но не менее 2х!
<br>Поле приоритет - даёт возможность приоритета одной цены над другой, чем больше цифра - тем меньше приоритет.';

$_['help_ninth_products_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ФОРМУЛА</b>';
$_['help_tenth_products_two']		= 'Формула получения итоговой цены скидки от количества товара.
<br>В выпадающем списке выберите одно из необходимых вам действий (+, -, *, /,.. и т.д.).
<br>Далее в поле справа от него введите необходимое значение.
<br>Учтите, что формула рассчитывает каждое поле последовательно!
<br>Можете использовать любое одно, любые два или все три поля на ваше усмотрение!
<br>Если нет надобности в каких-либо полях, то просто оставьте в этом поле выпадающий список действий пустым.
В таком случае это поле вне зависимости от его значения будет игнорироваться.**';

$_['help_eleventh_products_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ДАТА</b>';
$_['help_twelfth_products_two']		= 'Время действия скидки.
<br>По умолчанию дата не установленна (Пустое поле = время действия - всегда).
<br>Для действия данной скидки в определённое время установите свою дату от её начала и до её конца включительно!';

$_['help_thirteenth_products_two']		= '<i class="fa fa-eject fa-rotate-90" aria-hidden="true"></i> <b>СТАРТ и СТОП</b>';
$_['help_fourteenth_products_two']		= 'Вы можете включать или отключать ту или иную скидку, переключая свитчер <b>ON | OFF</b>.
<br>Каждый раз при включении и отключении редактора обновляются и очищаются соответствующие поля цен выбранных товаров.
<br><b style="color:red;">ВАЖНО!</b>: Пркежде чем запустить какую-либо скидку, обязательно сохраните все изменения кнопкой
<i class="fa fa-lg fa-check-circle-o"></i> в правом верхнем углу!';

$_['help_fifteenth_products_two']		= '<i class="fa fa-clone" aria-hidden="true"></i> <b>КЛОНИРОВАНИЕ</b>';
$_['help_sixteenth_products_two']	= 'Функция клонирования скидки. Упрощает работу с редактированием товаров.
Если вы хотите применить иную формулу, группу покупателей к уже используемым товарам в каком-либо редакторе, то просто нажмите для её
клонирования на кнопку <i class="fa fa-lg fa-clone" aria-hidden="true"></i> и отредактируйте на ваше усмотрение.';

$_['help_seventeenth_products_two']	= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['help_eighteenth_products_two']	= 'Иконка <i class="fa fa-plus-circle"></i> добавить скидку:
добавляет неопределённое количество скидок.<br>Иконка <i class="fa fa-minus-circle"></i> удалить скидку: удаляет добавленную скидку!
Будьте осторожны: востановление удалёной скидки невозможно!';
// Error
$_['error_name']			= 'Впишите заголовок!';
$_['error_warning']			= 'У вас недостаточно прав на добавление, удаление и редактирование этого модуля!';
