<?php
// Heading
$_['heading_title']				= 'Список магазинов';
//Button
$_['button_apply']		= 'Применить';
$_['button_save']		= 'Сохранить';
$_['button_cancel']		= 'Отменить';
// Text
$_['text_success']		= 'Список магазинов обновлён!';
$_['text_list']			= 'Редактор магазинов';
// Column
$_['column_name']		= 'Название магазина';
$_['column_url']		= 'URL магазина';
$_['column_action']		= 'Действие';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= 'Помощь';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_first_text']		= 'Отметьте магазины, на которые будет действовать скидка.';
$_['help_second_text']		= 'Каждая созданная скидка будет распространяться именно на те магазины, которые вы выбрали.';
$_['help_third_text']		= 'Выбрать все магазины: установите свитчер в позицию "ALL" на странице редактирования скидок.';
$_['help_fourth_text']		= 'Выбрать только те магазины, которые соответствуют вашим критериям - помечайте каждый из них на выбор.';
$_['help_end_text']		 	= 'Завершив выбор, сохраните список кнопкой "Сохранить" или "Применить" - расположены вверху справа.';
// Error
$_['error_warning']		= 'Внимательно проверьте форму на ошибки!';
