<?php
$_['button_apply']				= 'Применить';
$_['filters_action']			= 'Действие';
$_['filtered_clients']			= 'Отфильтровать по выбранным параметрам';
$_['filtered_clients_titles']	= 'Отметить и выбрать<br>всех отфильтрованных клиентов';
$_['button_clears']				= 'Очистить всё!<br>Сбросить фильтр!';
// Heading
$_['heading_titles']			= 'Список покупателей';
$_['hyper_discount_name']		= 'HYPER LOYALTY +';
$_['hyper_discount_title']		= 'Управление лояльностью клиентов';
$_['column_names']				= 'Имя покупателя';
// Text
$_['text_success']		= 'Группа клиентов обновлена!';
$_['text_lists']		= 'Редактор групп покупателей';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= 'Помощь';
$_['help_text']				= 'Помощник';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_first_text']		= 'Отметьте клиентов / покупателей, на которых будет распространяться скидка.<br>
Для применения скидки только на определённые группы покупателей очистите фильтр, отметьте нужные вам группы
и нажмите кнопку сохранить или применить!';
$_['help_second_text']		= 'Выбор возможен и по нескольким параметрам, для этого достаточно воспользоваться фильтром над списком.';
$_['help_third_text']		= 'Отфильтровав клиентов / покупателей, вы можете выбрать всех выведенных клиентов / покупателей,
отметив их кнопкой <b>Выбор</b> рядом с кнопкой фильтр.';
$_['help_fourth_text']		= 'Или же выбрать только тех клиентов / покупателей, которые соответствуют вашим критериям, помечая каждого из них.';
$_['help_end_text']			= 'Завершив выбор, сохраните список кнопкой "Применить" - расположена вверху справа.';
