<?php
$_['tab_name_discount_specials']	= 'Массовое редактирование акций';
$_['column_name']					= 'Название';
$_['column_name_titles']			= 'Название группы акции';
$_['column_description']			= 'Комментарий';
$_['column_description_titles']		= 'Описание / комментарий акции';
$_['column_delete']					= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']			= 'Добавить<br>Удалить';
$_['column_edit']					= '<i class="fa fa-wrench" aria-hidden="true"></i> ';
$_['column_edit_titles']			= 'Редакторы';
$_['column_status']					= '<i class="fa fa-power-off" aria-hidden="true"></i> ';
$_['column_status_titles']			= 'Вкл | Выкл<br>ON | OFF';
// Help
$_['help_name']				= 'HELPER';
$_['help_name_titles']		= 'Подсказки';
$_['help_name_title']		= '<b style="color:green;">FAQ</b>';
$_['help_list']				= '<span style="color:green;">Пользуйтесь подсказками <b>HELPER</b> - Хелпера в правом верхнем углу каждого пункта
если, что-то не понятно.</span>';
$_['help_text']				= 'ОПИСАНИЕ';
$_['help_ok']				= 'Сё понял! Спасибо!';
$_['help_warning']			= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']				= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';
// Help products Discount
$_['help_name_specials']		= '<b style="color:green;">Массовый редактор акций</b>';
$_['help_specials_text']		= 'Массовый редактор акций (те самые акции, что расположены в редакторе карточки товара админ части).
<br>Позволяет массово создавать акции - с гибкими настройками для каждого магазина если вы используете
режим мультимагазина, для товаров на ваш выбор с возможностью их фильтрации по различным параметрам с памятью, тем самым подвязывая определённую
группу товаров к группам покупателей.<br>Получение конечной акционной цены товара используя формулу.
<br>Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['help_first_specials']		= '<b style="color:green;">СТАРТ</b>';
$_['help_second_specials']		= 'Добавляйте нужное кол-во редакторов акций кнопкой <i class="fa fa-plus-circle"></i> добавить
<br>и сохраните добавленное кнопками в правом верхнем углу!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на редактирование добавленной скидки, кликнув на иконку <i class="fa fa-pencil"></i> редактирования.
<br>Пользуйтесь подсказками <b>HELPER</b> - Хелпера в правом верхнем углу каждого пункта если, что-то не понятно!';

$_['help_third_specials']		= '<b>КОЛОНКИ</b>';
$_['help_fourth_specials']		= '<b></b>НАЗВАНИЕ - название добавленной вами группы редакторов акций. Задаётся на странице редактирования.
<br><b>КОММЕНТАРИЙ</b> - краткое описание / комментарий к акции. Задаётся на странице редактирования.
<br><i class="fa fa-wrench" aria-hidden="true"></i> - Редактор: редактирование акций. При её нажатии вы попадёте на страницу редактирования.
<br><b style="line-height: 0; font-size: 18px;">±</b> - Действие: Добавление или удаление.';

// Error
$_['error_warning']			= 'У вас недостаточно прав на добавление, удаление и редактирование этого модуля!';
