

<?php

/*
Translated with
Массовый автоматический перевод текстов, товаров, категорий, статей и тд с Google translate API
https://translator.codeguild.com.ua/
*/
$_['text_rorder_id'] = "Замовлення №";
$_['error_license'] = "Ліцензія відсутня, операція неможлива!";
$_['error_permission'] = "У вас немає прав для зміни замовлення!";
$_['error_recalculate'] = "Перелік результатів замовлення неможливий!";
$_['error_shipping_nofound'] = "Увага! Спосіб доставки не знайдено! Можливо зараз він відключений!";
$_['error_shipping_getquote'] = "Увага! Спосіб доставки не доступний для цих умов! Перевірте налаштування методу за сумою та регіоном!";
$_['error_payment_nofound'] = "Увага! Спосіб оплати не знайдено! Можливо зараз він відключений!";
$_['error_payment_getmetod'] = "Увага! Спосіб оплати недоступний для цих умов! Перевірте налаштування методу за сумою та регіоном!";
$_['error_reward_usemax'] = "Увага! Максимальна кількість балів у покупця: %s!";
$_['error_coupon_use'] = "Увага! Вказаний купон не знайдено! Можливо він вимкнений, закінчився термін дії або параметри замовлення не відповідають настройкам купона!";
$_['error_voucher_use'] = "Увага! Вказаний сертифікат не знайдено! Можливо, він вимкнений, видалений або вже був використаний в іншому замовленні!";
$_['error_method_available'] = "(недоступний)";