<?php

$_['heading_title']					= 'HDP На количество товаров';
$_['settings_text']					= 'Настройка';
$_['discount_editor_text']			= 'Редактор скидок';
$_['add_name']						= 'Создание скидки';
$_['heading_action_text']			= 'Редактор скидок на количество товаров';
$_['kit_discount_text']				= 'Скидка на количество товаров';
// Name
$_['entry_title']					= 'Заголовок';
$_['entry_title_titles']			= 'Наименование скидки';
$_['entry_guest']					= 'Гости';
$_['entry_guest_titles']			= 'Активировать гостей';
$_['entry_description']				= 'Комментарий';
$_['entry_description_titles']		= 'Комментарий к скидке';
$_['entry_shops']					= 'Магазины';
$_['entry_shops_titles']			= 'Редактор магазинов<br>ALL = все магазины<br>EDIT - редактировать';
$_['entry_geo']						= 'Гео-зоны';
$_['entry_geo_titles']				= 'Редактор гео-зон<br>ALL = все магазины<br>EDIT - редактировать';
$_['kit_price_correction_titles']	= 'Коррекция цены по условиям скидки<br>MAIN - по основной цене<br>GROUP - по групповым ценам';
//protected
$_['protect_all']			= 'Все значения';
$_['protect_custom']		= 'Хотя бы одно значение';
$_['protect_globals']		= 'Глобально';
$_['protect_default']		= 'По умолчанию';
$_['protect_active']		= 'Активировать';
$_['protect_ignore']		= 'Игнорировать';
$_['protect_priority']		= 'Приоритет';
$_['protect_summary']		= 'Суммировать';
// HIDDEN
$_['protect_discount']		= 'Скидка';
$_['protect_markup']		= 'Наценка';
$_['entry_kit_variants']			= 'Вариант';
$_['entry_kit_variants_titles']		= 'Скидка или Наценка';
// HIDDEN
// Buttons
$_['button_edit_shops_list']		= 'Редактировать список магазинов<br>активно только в режиме EDIT';
$_['button_edit_geo_list']			= 'Редактировать список гео-зон<br>активно только в режиме EDIT';
$_['button_client_group_list']		= 'Редактировать список клиентов<br>активно только в режиме EDIT';
$_['button_product_group_list']		= 'Редактировать группу товаров<br>активно только в режиме EDIT';
// Editors
$_['entry_total_number']						= 'Кол-во';
$_['entry_total_number_titles']					= 'Кол-во наименований товаров.<br>При ONE - Каждого наименования<br>При ANY - любое из наименований!';
$_['entry_date']								= 'Дата';
$_['entry_date_titles']							= 'Дата начала и окончания<br>Если пусто = всегда';
$_['entry_product_groups']						= 'Товары';
$_['entry_product_groups_titles']				= 'Редактор групп товаров';
$_['entry_discounts']							= 'Скидки';
$_['entry_discounts_titles']					= 'Скидки от кол-ва товаров<br>Те, что в редакторе карточки товаров';
$_['entry_discount_specials_condition']			= 'Условие';
$_['entry_discount_specials_condition_titles']	= 'Варианты работы скидок<br>от кол-ва товара и акций';
$_['entry_stock']								= 'Акции';
$_['entry_stock_titles']						= 'Акции товаров';
$_['entry_options']								= 'Опции';
$_['entry_options_titles']						= 'Опции товара';
$_['entry_type_qty']							= 'Тип';
$_['entry_type_qty_titles']						= 'Тип условия<br>ALL = все по одному<br>ANY = любое кол-во';
$_['clone_kit_titles']							= 'Клонирование';
$_['button_clone']								= 'Клонировать';
$_['entry_extension_total_number_titles']       = 'Кол-во наименований товаров.';


$_['entry_client_group']				= 'Клиенты';
$_['entry_client_group_titles']			= 'Редактор групп и зарегистрированных клиентов<br>ALL = все клиенты<br>EDIT - редактировать';
$_['entry_product_group']				= 'Товары';
$_['entry_product_group_titles']		= 'Редактор товаров';
$_['copy_product_group']				= 'Товары | Кол-во';
$_['copy_product_group_titles']			= 'Редактор товаров<br>COPY = на те же товары<br>EDIT - редактировать<br>На кол-во из выбранных';
$_['entry_discount_percent']			= 'Размер|Тип';
$_['entry_discount_percent_titles']		= 'Размер скидки<br>Тип: % - процент<br>each fix - фикс. к товару<br>full fix - фикс. на общую';
$_['entry_discount_editor_status']		= '<i class="fa fa-power-off" aria-hidden="true"></i> ';

$_['entry_discount_editor_status_titles']	= 'Вкл | Выкл<br>ON | OFF';
$_['entry_date_start']						= 'Дата начала';
$_['entry_date_end']						= 'Дата окончания';
$_['column_delete']							= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['column_delete_titles']					= 'Добавить<br>Удалить';

// Help
$_['help_name']			= 'HELPER';
$_['help_name_titles']	= 'Подсказки';
$_['help_name_title']	= '<b style="color:green;">FAQ</b>';
$_['help_list']			= '<span style="color:green;">Пользуйтесь подсказками "Хелпера" в правом верхнем углу каждого пункта,
если что-либо не понятно.</span>';
$_['help_text']			= 'Помощник';
$_['help_ok']			= 'Сё понял! Спасибо!';
$_['help_warning']		= '<b style="color:red;">ВАЖНО!</b>';
$_['help_end']			= '<span style="color:red;">Обязательно сохраняйте все изменения, которые вы внесли в каждом пункте, кнопками в правом верхнем углу, прежде чем перейти к следующему этапу настроек!
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)</span>';

// Help Start kit
$_['help_name_kit']	= '<b>Скидка на количество товаров</b>';
$_['help_first_kit']	= '<b>СТАРТ</b>';
$_['help_second_kit']	= 'Введите заголовок / наименование данной скидки на количество товаров
и его краткое описание / комментарий в соответствующие для этого поля.
<br>Далее: Сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>После применения изменений, можете переходить на редактирование добавленной скидки, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования со страницы добавления скидок.';

// Info Modal kit
$_['info_first_kit']	= '<b>ОПИСАНИЕ</b>';
$_['info_second_kit']	= 'Вкладка <b>Скидка на количество товаров</b> позволяет создавать гибко настраиваемые скидки на количество наименований товаров.
На группы, комплекты, серии, наборы и прочие категории товаров в заказе
(как в двух различных фиксированных значениях, так и в процентном значении) - для каждого магазина, если вы используете
режим мульти-магазина. По географическим зонам, групп покупателей или отдельных покупателей, а так же гостей - на ваш выбор,
так и для любых товаров с возможностью их фильтрации по различным параметрам.
<br>Дополнительно ко всему внедрены инструменты работы со встроенными в редактор карточки скидками от кол-ва товара и акциями
- позволяя каждую из них использовать в нескольких вариациях совместно со скидкой на количество товаров.
<br>Также, есть возможность разграничивать их действия в отношении друг друга,
т.е. встроенная скидка от количества товаров или акция что, используются в редакторе карточки товара по умолчанию.
<br>Встроены инструменты разграничения опций товара и дата действия скидки. Каждый элемент более детально расписан в <b>HELPER</b>!';

$_['info_third_kit']	= '<b>НАЗВАНИЕ и КОММЕНТАРИЙ</b>';
$_['info_fourth_kit']	= '<b>Название</b>: выводится в корзине напротив самой скидки.
<br><b>Комментарий</b>: используется для краткого комментария и прочей технической информации к данной скидке.';
// Help Users One
$_['help_name_kit_one']		= 'Настройка';
$_['helper_name_kit_one']		= '<b>ВТОРОЙ ЭТАП</b>';
$_['helpers_name_kit_one']		= 'Выбрав нужные вам значения: магазинов,
гео-зон, гостей, клиентов <b style="color:green;">ALL</b> / <b>EDIT</b> - на ваше усмотрение -
сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование скидок на количество товаров по магазинам, гео-зонам, гостям,
клиентам, кликнув на иконку <i class="fa fa-pencil"></i> редактирования.';

$_['help_first_kit_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>МАГАЗИНЫ</b>';
$_['help_second_kit_one']	= 'Магазины, на которые будут распространяться скидки на количество товаров.
<br>По умолчанию <b style="color:green;">ALL</b> - выбраны все магазины!
<br>Для действия скидок в конкретных магазинах: переключите свитчер в режим <b>EDIT</b>, сохраните изменения
и далее кликните на активировавшуюся справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора магазинов выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_third_kit_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГЕО</b>';
$_['help_fourth_kit_one']	= 'Выбор географических зон | регионов - на которые будут распространяться скидки на количество товаров.
<br>По умолчанию <b style="color:green;">ALL</b> - выбранны все географические зоны!
<br>Для действия скидки в конкретных магазинах: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора географических зон отредактируйте их по своему усмотрению или при необходимости
воспользуйтесь подсказками "Хелпера"!';

$_['help_fifth_kit_one']	= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ГОСТИ</b>';
$_['help_sixth_kit_one']	= '<br>По умолчанию <b style="color:green;">YES</b> - скидка распространяется только на гостей!
<br>Чтобы скидка не действовала на незарегистрированных клиентов, переключите свитчер в режим <b>NO</b>';

$_['help_seventh_kit_one']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РЕДАКТОР КЛИЕНТОВ</b>';
$_['help_eighth_kit_one']		= 'Зарегистрированные клиенты / покупатели, на которых будет распространяться каждая добавленная скидка!
<br>По умолчанию <b style="color:green;">ALL</b> - выбранны все существующие покупатели!
<br>Для действия скидки на конкретных покупателей: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора покупателей выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"';

$_['help_ninth_kit_one']		= '<i class="fa fa-exchange" aria-hidden="true"></i> <b>КОРРЕКЦИЯ</b>';
$_['help_tenth_kit_one']		= 'Коррекция цены для условий количественной скидки товара (те что встроены в редактор карточки товара в административной части).
<br><b style="color:green;">MAIN</b> условия работы скидки от количества товара по основной цене. Т.е. отсчёт будет исходя из основной цены товара.
<br><b>GROUP</b> - условия работы скидки от количества товара по групповым ценам. Т.е. отсчёт будет исходя из групповой цены товара
(имеются в виду разные цены для групп покупателей / оптовые цены).
<br><b style="color:red;">**</b> Если у товара нет групповой / оптовой цены - то используется основная цена товара для расчета скидки';

// Help Users Two
$_['help_name_kit_two']		= 'Редакторы скидок';
$_['help_first_kit_two']		= '<b>ТРЕТИЙ ЭТАП</b>';
$_['help_second_kit_two']		= 'Добавляйте нужное кол-во групп скидок кнопкой <i class="fa fa-plus-circle"></i> добавить.
Настроив нужные вам значения <b style="color:green;">ALL</b> / <b>EDIT</b>, скидки, акции и их опций - на ваше усмотрение и
сохраните изменения кнопками в правом верхнем углу для перехода к следующему этапу настроек:
<br><i class="fa fa-check-circle-o"></i> - (применить изменения и остаться)
<br><i class="fa fa-lg fa-save"></i> - (сохранить изменения и выйти)
<br>Далее можете переходить на более гибкое редактирование скидки для гостей, клиентов и товаров, кликнув на иконку
<i class="fa fa-pencil"></i> редактирования.';

$_['help_third_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ТИП</b>';
$_['help_fourth_kit_two']		= '<br>По умолчанию <b style="color:green;">ALL</b> - тип условия, при котором товары учитываются по выбранному количеству всех наименований.
<br><b>ANY</b> - тип условия, при котором учитывается любое количество из выбранных наименований товаров.';

$_['help_fifth_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ТОВАРЫ</b>';
$_['help_sixth_kit_two']	= 'Товары, которые будут участвовать для начисления скидки.
<br>Для действия скидки на конкретные товары  кликните на иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!';

$_['help_seventh_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>Кол-во</b>';
$_['help_eighth_kit_two']		= 'Поле ввода значений для количества наименований товаров, при которых
скидка на количество выбранных товаров будет задействована.<br>При условии типа <b style="color:green;">ALL</b> - на каждое наименование всех выбранных
(Пример: Кол-во 1 - все по 1му наименованию;<br>Кол-во 2 - все по два наименования и т.д.)
<br>При условии типа ANY - на любое установленное количество из выбранных товаров по наименованию
(Пример: Выбрано 10 наименований в редакторе товаров - Устанавливаем кол-во 5 - значит на любые 5 наименований товаров из выбранных 10ти).';

$_['help_ninth_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>РАЗМЕР СКИДКИ | ТИП</b>';
$_['help_tenth_kit_two']		= 'Поле для установки размера скидки на количество товаров
<br>• <b style="color:red;">%</b> - в процентах.
<br>• <b style="color:red;">each fix</b> - фиксированная на каждый товар.
<br>• <b style="color:red;">full fix</b> - фиксированная с общей суммы.';

$_['help_eleventh_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>ТОВАРЫ | Кол-во</b>';
$_['help_twelfth_kit_two']	= 'Товары, на которые будет распространяться скидка на количество товаров.
<br>По умолчанию <b style="color:green;">COPY</b> - выбраны те же товары, что и в предыдущем редакторе!
<br>Для действия скидки на иные товары: переключите свитчер в режим <b>EDIT</b> и кликните на активировавшуюся
справа иконку <i class="fa fa-pencil"></i> редактирования.
<br>На открывшейся странице редактора товаров выберите их по своему усмотрению или при необходимости воспользуйтесь подсказками "Хелпера"!
<b>Кол-во</b> - поле установки количества, на которое будет применяться скидка из общего числа выбранных (Пример: 1 на один любой товар;
2 - на любые 2 товара по наименованию из выбранных во втором редакторе, и т.д.';

$_['help_thirteenth_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>СКИДКИ</b>';
$_['help_fourteenth_kit_two']		= 'Функция - скидки от кол-ва товара (те, что добавляются во вкладке "Скидки" в редакторе
карточки товара). Позволяет более гибко настраивать каждую скидку на количество товаров со скидкой от кол-ва товара в 3х вариантах.
';

$_['help_fifteenth_kit_two']	= '';
$_['help_sixteenth_kit_two']	= '• <b style="color:green;">Активировать</b>: Если скидка на количество (та, что на закладке "Скидки" в товаре), меньше текущей настроенной скидки, то из скидки вычитается это значение. Если значение скидки товара больше, то оно поглощает настроенную скидку на количество. Проверка производится для каждого товара в корзине, поэтому на какие-то товары скидка на количество будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: скидка на количество товаров применяется только на то кол-во товаров, на которое не распространяется
скидка от кол-ва товара!  (Пример: если у товара скидка от кол-ва товара активна на 2шт (больше одного), то скидка на количество товаров модуля
применяется только к одному товару, а не на два и более товара).
<br>• <b style="color:blue;">Суммировать</b>: суммируется скидки - на количество товаров и скидка от количества товара!
(т.е. скидка от кол-ва товара + скидка на количество товаров модуля).';

$_['help_seventeenth_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>АКЦИИ</b>';
$_['help_eighteenth_kit_two']		= 'Функция - акций товара (те, что добавляются во вкладке "Акции" в редакторе карточки товара).
Позволяет более гибко настраивать скидку на количество товаров с акцией товара в 3-х вариантах.
';

$_['help_nineteenth_kit_two']		= '';
$_['help_twentieth_kit_two']		= '• <b style="color:green;">Активировать</b>: Если акция (та, что на закладке "Акции" в товаре), меньше текущей настроенной скидки на количество, то из скидки на количество вычитается это значение. Если значение акции товара больше, то оно поглощает настроенную скидку на количество. Проверка производится для каждого товара в корзине, поэтому на какие-то товары скидка на количество будет действовать в полном объеме, на какие-то - частично, а на какие-то может вообще не действовать.
<br>• <b style="color:red;">Игнорировать</b>: игнорируется скидка на количество товаров на товары по Акции! -
(т.е. к товарам на которые установлена акция, скидка на количество товаров не применяется!)
<br>• <b style="color:blue;">Суммировать</b>: суммируется скидка на количество товаров и акция товара!
(т.е. цена товара по акции + скидка на количество товаров).';

$_['help_twentyfirst_kit_two']		= '<i class="fa fa-pencil-square-o" aria-hidden="true"></i> <b>•ДАТА•</b>';
$_['help_twentysecond_kit_two']		= 'Время действия скидок на количество товаров.
<br>По умолчанию дата не установлена = время действия - всегда!<br>Для действия данной скидки в определённое время,
установите свою дату от её начала и до её конца включительно!
<br>Для понимания, с какого периода работает скидка, можно установить только дату её начала.';

$_['help_twentythird_kit_two']		= '<i class="fa fa-clone" aria-hidden="true"></i> <b>КЛОНИРОВАНИЕ</b>';
$_['help_twentyfourth_kit_two']		= 'Клонирование добавленной скидки со всеми настройками один в один - для удобства последующего её редактирования.';

$_['help_twentyfifth_kit_two']		= '<b><i class="fa fa-power-off" aria-hidden="true"></i></b>';
$_['help_twentysixth_kit_two']		= 'Статус конкретной скидки - вы можете включать или отключать ту или иную скидку.';

$_['help_twentyseventh_kit_two']	= '<b style="line-height: 0; font-size: 18px;">±</b>';
$_['help_twentyeighth_kit_two']		= 'Иконка <i class="fa fa-plus-circle"></i> добавить скидку:
добавляет неопределённое количество скидок.<br>Иконка <i class="fa fa-minus-circle"></i> удалить скидку: удаляет добавленную скидку!
Будьте осторожны: востановление удалёной скидки невозможно!';

$_['help_end_kit_two']				= 'Общее описание вкладок скидок.';
// Error
$_['error_permission']		= 'Не хватает прав!';
$_['error_name']			= 'Впишите заголовок!';
$_['error_warning']			= 'Внимательно проверьте форму на ошибки!';
