

<?php

/*
Translated with
Массовый автоматический перевод текстов, товаров, категорий, статей и тд с Google translate API
https://translator.codeguild.com.ua/
*/
$_['text_success'] = "Статус замовлення успішно змінено! Замовлення №:";
$_['text_payment_method'] = "Оплата";
$_['text_shipping_method'] = "Доставка";
$_['text_order_id'] = "№ замовлення:";
$_['text_order_detail'] = "Щоб переглянути замовлення, натисніть на посилання нижче:<br>";
$_['text_order_download'] = "Після підтвердження платежу ви можете натиснути на посилання нижче, щоб отримати доступ до товарів, що завантажуються:<br>";
$_['text_download'] = "Завантажити";
$_['error_permission'] = "Увага: Ви не маєте дозволу на доступ до API!";
$_['error_not_found'] = "Статус замовлення не змінено! Не знайдено замовлення №:";