<?php
$_['hyper_discount_name']		= 'HYPER DISCOUNT PACKAGE';
$_['heading_text_name']			= '<span style="color:red;">Активация лицензии</span>';
$_['hyper_discount_title']		= 'Пакет скидок, акции, цены';
$_['text_abouts']				= 'HYPER DISCOUNT PACKAGE - Пакет скидок, акции, цены';
$_['activation_key_name']		= 'Лицензионный ключ';
$_['description_warning']		= '<span style="color:red;">Лицензионное соглашение</span>';
$_['description_name']			= 'О Модуле';
$_['description_start']			= '<b>"HYPER DISCOUNT PACKAGE" - это полный комплекс управления лояльностью клиентов.</b><br>
 Модуль содержит в себе полный пакет редактируемых скидок - пользовательских, накопительных и количественных.
Различные скидки для всех или избранных покупателей, пользовательская и гостевая скидка
<br> Всё это с различными параметрами редактирования модуля по работе со скидками от количества товаров и по акциям с выбором условия их работы
между собой.<br> 
Поддержка мультимагазинов, фильтрация товаров по поиску, модели, поставщику, производителю, категориям, цене, количеству и т.д.,
фильтрация покупателей по различным параметрам и многое другое.
<br> Используя все возможности модуля управления лояльностью клиентов <b>"HYPER DISCOUNT PACKAGE"</b>, вы легко организуете гибкую многоуровневую
систему скидок в различных вариантах, мотивируя тем самым ваших покупателей на новые и новые покупки.';
$_['save_key']						= 'Применить';
$_['name_key']						= 'Скопируйте сюда номер вашего лицензионного ключа и нажмите - Применить!';
$_['description_warning_start']		= ' <span style="font-weight: bold;" class="text-center">ВНИМАНИЕ!</span>
Это программное обеспечение не свободно!
 Условия использования лицензии - "одна покупка модуля > на один домен".
Это означает, что Вы можете использовать одну лицензию для одного домена.
<br> Для дополнительных доменов или поддоменов требуется дополнительная покупка модуля!
Запрещена передача данного ПО третьим лицам, распространение от своего имени, изменение исходных файлов модуля без
получения разрешения на то автора модуля.<br>
 Перепродажа данного программного обеспечения, его присвоение, передача третьим лицам, выкладывание в публичный доступ
и прочие несанкционированные действия, нарушающие авторские права разработчиков, запрещены и преследуются по закону!';
// Help
$_['help_name']			= 'KEY HELPER';
$_['help_name_titles']	= 'Подсказки';
$_['help_text']			= 'Получение лицензионного ключа';
$_['help_name_abouts']	= '<b style="color:green;">Лицензионный ключ</b>';
$_['help_list']			= '<b style="color:#035eff;text-align:center;">Для получения лицензионного ключа прочтите полностью файл readme.txt
<br>и следуйте описанным в нём указаниям!</b>';
$_['help_ok']			= 'Сё понял! Спасибо!';
$_['help_warning']		= '<b style="color:red;">ВНИМАНИЕ!</b>';
$_['help_end']			= '<span style="color:red;">Обязательно сохраните себе номер лицензионного ключа, чтобы не потерять его!</span>';
// Error
$_['error_warning']		= 'У вас недостаточно прав на добавление, удаление и редактирование этого модуля!';
